[
    {
        "title": "Three facets of mathematical cancer biology research",
        "year": "January 2023",
        "authors": "Yue Wang",
        "abstract": "Cancer, as the uncontrollable cell growth, is related to many branches of\nbiology. In this review, we will discuss three mathematical approaches for\nstudying cancer biology: population dynamics, gene regulation, and\ndevelopmental biology. If we understand all biochemical mechanisms of cancer\ncells, we can directly calculate how the cancer cell population behaves.\nInversely, just from the cell count data, we can use population dynamics to\ninfer the mechanisms. Cancer cells emerge from certain genetic mutations, which\naffect the expression of other genes through gene regulation. Therefore,\nknowledge of gene regulation can help with cancer prevention and treatment.\nDevelopmental biology studies acquisition and maintenance of normal cellular\nfunction, which is inspiring to cancer biology in the opposite direction.\nBesides, cancer cells implanted into an embryo can differentiate into normal\ntissues, which provides a possible approach of curing cancer. This review\nillustrates the role of mathematics in these three fields: what mathematical\nmodels are used, what data analysis tools are applied, and what mathematical\ntheorems need to be proved. We hope that applied mathematicians and even pure\nmathematicians can find meaningful mathematical problems related to cancer\nbiology.",
        "link": "http://arxiv.org/pdf/2301.11126v1"
    },
    {
        "title": "The case for algebraic biology: from research to education",
        "year": "February 2020",
        "authors": "Matthew Macauley, Nora Youngs",
        "abstract": "Though it goes without saying that linear algebra is fundamental to\nmathematical biology, polynomial algebra is less visible. In this article, we\nwill give a brief tour of four diverse biological problems where multivariate\npolynomials play a central role -- a subfield that is sometimes called\n\"algebraic biology.\" Namely, these topics include biochemical reaction\nnetworks, Boolean models of gene regulatory networks, algebraic statistics and\ngenomics, and place fields in neuroscience. After that, we will summarize the\nhistory of discrete and algebraic structures in mathematical biology, from\ntheir early appearances in the late 1960s to the current day. Finally, we will\ndiscuss the role of algebraic biology in the modern classroom and curriculum,\nincluding resources in the literature and relevant software. Our goal is to\nmake this article widely accessible, reaching the mathematical biologist who\nknows no algebra, the algebraist who knows no biology, and especially the\ninterested student who is curious about the synergy between these two seemingly\nunrelated fields.",
        "link": "http://arxiv.org/pdf/2003.01812v1"
    },
    {
        "title": "An Optimal Likelihood Free Method for Biological Model Selection",
        "year": "August 2022",
        "authors": "Vincent D. Zaballa, Elliot E. Hui",
        "abstract": "Systems biology seeks to create math models of biological systems to reduce\ninherent biological complexity and provide predictions for applications such as\ntherapeutic development. However, it remains a challenge to determine which\nmath model is correct and how to arrive optimally at the answer. We present an\nalgorithm for automated biological model selection using mathematical models of\nsystems biology and likelihood free inference methods. Our algorithm shows\nimproved performance in arriving at correct models without a priori information\nover conventional heuristics used in experimental biology and random search.\nThis method shows promise to accelerate biological basic science and drug\ndiscovery.",
        "link": "http://arxiv.org/pdf/2208.02344v1"
    },
    {
        "title": "Computer algebra in systems biology",
        "year": "December 2007",
        "authors": "Reinhard Laubenbacher, Bernd Sturmfels",
        "abstract": "Systems biology focuses on the study of entire biological systems rather than\non their individual components. With the emergence of high-throughput data\ngeneration technologies for molecular biology and the development of advanced\nmathematical modeling techniques, this field promises to provide important new\ninsights. At the same time, with the availability of increasingly powerful\ncomputers, computer algebra has developed into a useful tool for many\napplications. This article illustrates the use of computer algebra in systems\nbiology by way of a well-known gene regulatory network, the Lac Operon in the\nbacterium E. coli.",
        "link": "http://arxiv.org/pdf/0712.4248v2"
    },
    {
        "title": "The Lost Art of Mathematical Modelling",
        "year": "January 2023",
        "authors": "Linnéa Gyllingberg, Abeba Birhane, David J. T. Sumpter",
        "abstract": "We provide a critique of mathematical biology in light of rapid developments\nin modern machine learning. We argue that out of the three modelling activities\n-- (1) formulating models; (2) analysing models; and (3) fitting or comparing\nmodels to data -- inherent to mathematical biology, researchers currently focus\ntoo much on activity (2) at the cost of (1). This trend, we propose, can be\nreversed by realising that any given biological phenomena can be modelled in an\ninfinite number of different ways, through the adoption of an open/pluralistic\napproach. We explain the open approach using fish locomotion as a case study\nand illustrate some of the pitfalls -- universalism, creating models of models,\netc. -- that hinder mathematical biology. We then ask how we might rediscover a\nlost art: that of creative mathematical modelling.\n  This article is dedicated to the memory of Edmund Crampin.",
        "link": "http://arxiv.org/pdf/2301.08559v2"
    },
    {
        "title": "Approximation of Intractable Likelihood Functions in Systems Biology via Normalizing Flows",
        "year": "December 2023",
        "authors": "Vincent D. Zaballa, Elliot E. Hui",
        "abstract": "Systems biology relies on mathematical models that often involve complex and\nintractable likelihood functions, posing challenges for efficient inference and\nmodel selection. Generative models, such as normalizing flows, have shown\nremarkable ability in approximating complex distributions in various domains.\nHowever, their application in systems biology for approximating intractable\nlikelihood functions remains unexplored. Here, we elucidate a framework for\nleveraging normalizing flows to approximate complex likelihood functions\ninherent to systems biology models. By using normalizing flows in the\nSimulation-based inference setting, we demonstrate a method that not only\napproximates a likelihood function but also allows for model inference in the\nmodel selection setting. We showcase the effectiveness of this approach on\nreal-world systems biology problems, providing practical guidance for\nimplementation and highlighting its advantages over traditional computational\nmethods.",
        "link": "http://arxiv.org/pdf/2312.02391v1"
    },
    {
        "title": "Guidelines for benchmarking of optimization approaches for fitting mathematical models",
        "year": "July 2019",
        "authors": "Clemens Kreutz",
        "abstract": "Insufficient performance of optimization approaches for fitting of\nmathematical models is still a major bottleneck in systems biology. In this\nmanuscript, the reasons and methodological challenges are summarized as well as\ntheir impact in benchmark studies. Important aspects for increasing evidence of\noutcomes of benchmark analyses are discussed. Based on general guidelines for\nbenchmarking in computational biology, a collection of tailored guidelines is\npresented for performing informative and unbiased benchmarking of\noptimization-based fitting approaches. Comprehensive benchmark studies based on\nthese recommendations are urgently required for establishing of a robust and\nreliable methodology for the systems biology community.",
        "link": "http://arxiv.org/pdf/1907.03427v1"
    },
    {
        "title": "Reproducible research using biomodels",
        "year": "June 2018",
        "authors": "Pedro Mendes",
        "abstract": "Like other types of computational research, modeling and simulation of\nbiological processes (biomodels) is still largely communicated without\nsufficient detail to allow independent reproduction of results. But\nreproducibility in this area of research could easily be achieved by making use\nof existing resources, such as supplying models in standard formats and\ndepositing code, models, and results in public repositories.",
        "link": "http://arxiv.org/pdf/1806.01078v1"
    },
    {
        "title": "Global Existence for some Cross Diffusion Systems with Equal Cross Diffusion/Reaction Rates",
        "year": "October 2019",
        "authors": "Dung Le",
        "abstract": "We consider some cross diffusion systems which is inspired by models in\nmathematical biology/ecology, in particular the Shigesada-Kawasaki-Teramoto\n(SKT) model in population biology. We establish the global existence of strong\nsolutions to systems for multiple species having equal either diffusion or\nreaction rates. The systems are given on bounded domains of arbitrary\ndimension.",
        "link": "http://arxiv.org/pdf/1910.07260v2"
    },
    {
        "title": "On the Positivity of Weak Solutions to a Class of Cross Diffusion Systems",
        "year": "June 2020",
        "authors": "Dung Le",
        "abstract": "We establish the positivity of weak (and very weak) solutions to a class of\ncross diffusion systems which is inspired by models in mathematical\nbiology/ecology, in particular the Shigesada-Kawasaki-Teramoto (SKT) model in\npopulation biology. Examples and counterexamples will be provided to show that\nour contions are near optimal.",
        "link": "http://arxiv.org/pdf/2006.10465v1"
    },
    {
        "title": "On the well-posedness of some model arising in the mathematical biology",
        "year": "April 2024",
        "authors": "Messoud Efendiev, Vitali Vougalter",
        "abstract": "In the article we establish the global well-posedness in W^{1, 2, 2}(R\\times\nR^{+}) of the integro-differential equation in the case of the anomalous\ndiffusion when the one dimensional negative Laplace operator is raised to a\nfractional power in the presence of the transport term. The model is relevant\nto the cell population dynamics in the Mathematical Biology. Our proof relies\non a fixed point technique.",
        "link": "http://arxiv.org/pdf/2404.04342v1"
    },
    {
        "title": "Using Glowscript to Teach Numerical Modeling in Undergraduate Biology Education",
        "year": "April 2022",
        "authors": "Joshua G. Schreibeis, Olivia M. Merideth, Gavin A. Buxton",
        "abstract": "Mathematical and numerical modeling is an increasingly important, yet often\nneglected, topic for biology students. We have found Glowscript to facilitate\nteaching and introducing computer simulations to students. In particular, the\nbuilt-in the graphics and graphing capabilities can provide students with\nimmediate feedback. Glowscript is a web-based form of visual Python that runs\nin a standard browser, and students can easily embed their simulations in\nexternal websites. Here we show various examples of how Glowscript is\nimplemented in an undergraduate computational biology course. We hope these\nexamples inspire others to adopt Glowscript in their science classrooms.",
        "link": "http://arxiv.org/pdf/2204.12911v1"
    },
    {
        "title": "A (possible) mathematical model to describe biological \"context-dependence\" : case study with protein structure",
        "year": "February 2009",
        "authors": "Anirban Banerji",
        "abstract": "Context-dependent nature of biological phenomena are well documented in every\nbranch of biology. While there have been few previous attempts to (implicitly)\nmodel various facets of biological context-dependence, a formal and general\nmathematical construct to model the wide spectrum of context-dependence, eludes\nthe students of biology. An objective and rigorous model, from both 'bottom-up'\nas well as 'top-down' perspective, is proposed here to serve as the template to\ndescribe the various kinds of context-dependence that we encounter in different\nbranches of biology. Interactions between biological contexts was found to be\ntransitive but non-commutative. It is found that a hierarchical nature of\ndependence amongst the biological contexts models the emergent biological\nproperties efficiently. Reasons for these findings are provided with a general\nmodel to describe biological reality. Scheme to algorithmically implement the\nhierarchic structure of organization of biological contexts was achieved with a\nconstruct named 'Context tree'. A 'Context tree' based analysis of context\ninteractions among biophysical factors influencing protein structure was\nperformed.",
        "link": "http://arxiv.org/pdf/0902.0664v2"
    },
    {
        "title": "Open Problems in Mathematical Biology",
        "year": "June 2022",
        "authors": "Sean T. Vittadello, Michael P. H. Stumpf",
        "abstract": "Biology is data-rich, and it is equally rich in concepts and hypotheses. Part\nof trying to understand biological processes and systems is therefore to\nconfront our ideas and hypotheses with data using statistical methods to\ndetermine the extent to which our hypotheses agree with reality. But doing so\nin a systematic way is becoming increasingly challenging as our hypotheses\nbecome more detailed, and our data becomes more complex. Mathematical methods\nare therefore gaining in importance across the life- and biomedical sciences.\nMathematical models allow us to test our understanding, make testable\npredictions about future behaviour, and gain insights into how we can control\nthe behaviour of biological systems. It has been argued that mathematical\nmethods can be of great benefit to biologists to make sense of data. But\nmathematics and mathematicians are set to benefit equally from considering the\noften bewildering complexity inherent to living systems. Here we present a\nsmall selection of open problems and challenges in mathematical biology. We\nhave chosen these open problems because they are of both biological and\nmathematical interest.",
        "link": "http://arxiv.org/pdf/2206.09516v1"
    },
    {
        "title": "A Mathematical Model Accounting for the Organisation in Multiplets of the Genetic Code",
        "year": "February 2001",
        "authors": "A. Sciarrino",
        "abstract": "Requiring stability of genetic code against translation errors, modelised by\nsuitable mathematical operators in the crystal basis model of the genetic code,\nthe main features of the organisation in multiplets of the mitochondrial and of\nthe standard genetic code are explained.",
        "link": "http://arxiv.org/pdf/math-ph/0102022v1"
    },
    {
        "title": "A mathematical model for Neanderthal extinction",
        "year": "December 1997",
        "authors": "J. C. Flores",
        "abstract": "A simple mathematical homogeneous model of competition is used to describe\nNeanderthal extinction in Europe. It considers two interacting species,\nNeanderthals and Early Modern Men, in the same ecological niche. Using\npaleontological data we claim that the parameter of similarity, between both\nspecies, fluctuates between 0.992 and 0.997. An extension of the model\nincluding migration (diffusion) is also discussed nevertheless, extinction of\nNeanderthal seems unavoidable. Numerical analysis of travelling wave solution\n(fronts) comfirms the extinction. The wave-front-velocity is estimated from\nlinear analysis and numerical simulations confirm this estimation. We\nconjecture a mathematical formulation for the principle of exclusion between\ncompetitive interacting species (Gause).",
        "link": "http://arxiv.org/pdf/physics/9712024v1"
    },
    {
        "title": "On a Model of Superconductivity and Biology",
        "year": "March 2012",
        "authors": "Monica De Angelis",
        "abstract": "The paper deals with a semilinear integrodifferential equation that\ncharacterizes several dissipative models of Viscoelasticity, Biology and\nSuperconductivity. The initial - boundary problem with Neumann conditions is\nanalyzed. When the source term F is a linear function, then the explicit\nsolution is obtained. When F is non linear, some results on existence,\nuniqueness and a priori estimates are deduced. As example of physical model the\nreaction - diffusion system of Fitzhugh Nagumo is considered.",
        "link": "http://arxiv.org/pdf/1203.0448v1"
    },
    {
        "title": "Mass Extinction in a Simple Mathematical Biological Model",
        "year": "February 1997",
        "authors": "Kei Tokita, Ayumu Yasutomi",
        "abstract": "Introducing the effect of extinction into the so-called replicator equations\nin mathematical biology, we construct a general model of ecosystems. The\npresent model shows mass extinction by its own extinction dynamics when the\nsystem initially has a large number of species ( diversity). The extinction\ndynamics shows several significant features such as a power law in basin size\ndistribution, induction time, etc. The present theory can be a mathematical\nfoundation of the species-area effect in the paleontologic theory for mass\nextinction.",
        "link": "http://arxiv.org/pdf/adap-org/9702004v1"
    },
    {
        "title": "For principled model fitting in mathematical biology",
        "year": "April 2014",
        "authors": "Thomas House",
        "abstract": "The mathematical models used to capture features of complex, biological\nsystems are typically non-linear, meaning that there are no generally valid\nsimple relationships between their outputs and the data that might be used to\nvalidate them. This invalidates the assumptions behind standard statistical\nmethods such as linear regression, and often the methods used to parameterise\nbiological models from data are ad hoc. In this perspective, I will argue for\nan approach to model fitting in mathematical biology that incorporates modern\nstatistical methodology without losing the insights gained through non-linear\ndynamic models, and will call such an approach principled model fitting.\nPrincipled model fitting therefore involves defining likelihoods of observing\nreal data on the basis of models that capture key biological mechanisms.",
        "link": "http://arxiv.org/pdf/1404.5324v1"
    },
    {
        "title": "Increasing certainty in systems biology models using Bayesian multimodel inference",
        "year": "June 2024",
        "authors": "Nathaniel Linden-Santangeli, Jin Zhang, Boris Kramer, Padmini Rangamani",
        "abstract": "Mathematical models are indispensable to the system biology toolkit for\nstudying the structure and behavior of intracellular signaling networks. A\ncommon approach to modeling is to develop a system of equations that encode the\nknown biology using approximations and simplifying assumptions. As a result,\nthe same signaling pathway can be represented by multiple models, each with its\nset of underlying assumptions, which opens up challenges for model selection\nand decreases certainty in model predictions. Here, we use Bayesian multimodel\ninference to develop a framework to increase certainty in systems biology\nmodels. Using models of the extracellular regulated kinase (ERK) pathway, we\nfirst show that multimodel inference increases predictive certainty and yields\npredictors that are robust to changes in the set of available models. We then\nshow that predictions made with multimodel inference are robust to data\nuncertainties introduced by decreasing the measurement duration and reducing\nthe sample size. Finally, we use multimodel inference to identify a new model\nto explain experimentally measured sub-cellular location-specific ERK activity\ndynamics. In summary, our framework highlights multimodel inference as a\ndisciplined approach to increasing the certainty of intracellular signaling\nactivity predictions.",
        "link": "http://arxiv.org/pdf/2406.11178v1"
    }
]