[
    {
        "title": "Mathematics at the eve of a historic transition in biology",
        "year": "November 2017",
        "authors": "Guo-Wei Wei",
        "abstract": "A century ago physicists and mathematicians worked in tandem and established\nquantum mechanism. Indeed, algebras, partial differential equations, group\ntheory, and functional analysis underpin the foundation of quantum mechanism.\nCurrently, biology is undergoing a historic transition from qualitative,\nphenomenological and descriptive to quantitative, analytical and predictive.\nMathematics, again, becomes a driving force behind this new transition in\nbiology.",
        "link": "http://arxiv.org/pdf/1711.02001v1"
    },
    {
        "title": "Three facets of mathematical cancer biology research",
        "year": "January 2023",
        "authors": "Yue Wang",
        "abstract": "Cancer, as the uncontrollable cell growth, is related to many branches of\nbiology. In this review, we will discuss three mathematical approaches for\nstudying cancer biology: population dynamics, gene regulation, and\ndevelopmental biology. If we understand all biochemical mechanisms of cancer\ncells, we can directly calculate how the cancer cell population behaves.\nInversely, just from the cell count data, we can use population dynamics to\ninfer the mechanisms. Cancer cells emerge from certain genetic mutations, which\naffect the expression of other genes through gene regulation. Therefore,\nknowledge of gene regulation can help with cancer prevention and treatment.\nDevelopmental biology studies acquisition and maintenance of normal cellular\nfunction, which is inspiring to cancer biology in the opposite direction.\nBesides, cancer cells implanted into an embryo can differentiate into normal\ntissues, which provides a possible approach of curing cancer. This review\nillustrates the role of mathematics in these three fields: what mathematical\nmodels are used, what data analysis tools are applied, and what mathematical\ntheorems need to be proved. We hope that applied mathematicians and even pure\nmathematicians can find meaningful mathematical problems related to cancer\nbiology.",
        "link": "http://arxiv.org/pdf/2301.11126v1"
    },
    {
        "title": "A mathematician's view of the unreasonable ineffectiveness of mathematics in biology",
        "year": "March 2021",
        "authors": "Alexandre Borovik",
        "abstract": "This paper discusses, from a mathematician's point of view, the thesis\nformulated by Israel Gelfand, one of the greatest mathematicians of the 20th\ncentury, and one of the pioneers of mathematical biology: \"There is only one\nthing which is more unreasonable than the unreasonable effectiveness of\nmathematics in physics, and this is the unreasonable ineffectiveness of\nmathematics in biology.\"",
        "link": "http://arxiv.org/pdf/2103.04190v1"
    },
    {
        "title": "A Note on Applications of Support Vector Machine",
        "year": "June 2001",
        "authors": "Seung-chan Ahn, Gene Kim, MyungHo Kim",
        "abstract": "We describe in a rudimentary fashion how SVM(support vector machine) plays\nthe role of classifier in a mathematical setting. We then discuss its\napplication in the study of multiple SNP(single nucleotide polymorphism)\nvariations. Also presented is a set of preliminary test results with clinical\ndata.",
        "link": "http://arxiv.org/pdf/math/0106166v2"
    },
    {
        "title": "The case for algebraic biology: from research to education",
        "year": "February 2020",
        "authors": "Matthew Macauley, Nora Youngs",
        "abstract": "Though it goes without saying that linear algebra is fundamental to\nmathematical biology, polynomial algebra is less visible. In this article, we\nwill give a brief tour of four diverse biological problems where multivariate\npolynomials play a central role -- a subfield that is sometimes called\n\"algebraic biology.\" Namely, these topics include biochemical reaction\nnetworks, Boolean models of gene regulatory networks, algebraic statistics and\ngenomics, and place fields in neuroscience. After that, we will summarize the\nhistory of discrete and algebraic structures in mathematical biology, from\ntheir early appearances in the late 1960s to the current day. Finally, we will\ndiscuss the role of algebraic biology in the modern classroom and curriculum,\nincluding resources in the literature and relevant software. Our goal is to\nmake this article widely accessible, reaching the mathematical biologist who\nknows no algebra, the algebraist who knows no biology, and especially the\ninterested student who is curious about the synergy between these two seemingly\nunrelated fields.",
        "link": "http://arxiv.org/pdf/2003.01812v1"
    },
    {
        "title": "Qualitative analysis of differential equations",
        "year": "March 2018",
        "authors": "Alexander V Panfilov",
        "abstract": "Here I introduce basic methods of qualitative analysis of differential\nequations used in mathematical biology for people with minimal mathematical\nbackground.",
        "link": "http://arxiv.org/pdf/1803.05291v1"
    },
    {
        "title": "Computer algebra in systems biology",
        "year": "December 2007",
        "authors": "Reinhard Laubenbacher, Bernd Sturmfels",
        "abstract": "Systems biology focuses on the study of entire biological systems rather than\non their individual components. With the emergence of high-throughput data\ngeneration technologies for molecular biology and the development of advanced\nmathematical modeling techniques, this field promises to provide important new\ninsights. At the same time, with the availability of increasingly powerful\ncomputers, computer algebra has developed into a useful tool for many\napplications. This article illustrates the use of computer algebra in systems\nbiology by way of a well-known gene regulatory network, the Lac Operon in the\nbacterium E. coli.",
        "link": "http://arxiv.org/pdf/0712.4248v2"
    },
    {
        "title": "A framework for philosophical biology",
        "year": "April 2016",
        "authors": "Sepehr Ehsani",
        "abstract": "Advances in biology have mostly relied on theories that were subsequently\nrevised, expanded or eventually refuted using experimental and other means.\nTheoretical biology used to primarily provide a basis to rationally examine the\nframeworks within which biological experiments were carried out and to shed\nlight on overlooked gaps in understanding. Today, however, theoretical biology\nhas generally become synonymous with computational and mathematical biology.\nThis could in part be explained by a relatively recent tendency in which a\n\"data first\", rather than a \"theory first\", approach is preferred. Moreover,\ngenerating hypotheses has at times become procedural rather than theoretical.\nThis situation leaves our understanding enmeshed in data, which should be\ndisentangled from much noise. Given the many unresolved questions in biology\nand medicine, it seems apt to revive the role of pure theory in the biological\nsciences. This paper makes the case for a \"philosophical biology\"\n(philbiology), distinct from but quite complementary to philosophy of biology\n(philobiology), which would entail biological investigation through\nphilosophical approaches. Philbiology would thus be a reincarnation of\ntheoretical biology, adopting the true sense of the word \"theory\" and making\nuse of a rich tradition of serious philosophical approaches in the natural\nsciences. A philbiological investigation, after clearly defining a given\nbiological problem, would aim to propose a set of empirical questions, along\nwith a class of possible solutions, about that problem. Importantly, whether or\nnot the questions can be tested using current experimental paradigms would be\nsecondary to whether the questions are inherently empirical or not. The final\ngoal of a philbiological investigation would be to develop a theoretical\nframework that can lead observational and/or interventional experimental\nstudies of the defined problem.",
        "link": "http://arxiv.org/pdf/1605.00033v1"
    },
    {
        "title": "Mathematics, Biology, and Physics: Interactions and Interdependence",
        "year": "September 2004",
        "authors": "Michael C. Mackey, Moises Santillan",
        "abstract": "This paper traces the seminal roles that physicists and mathematicians have\nplayed in the conceptual development of the biological sciences in the past,\nand especially in the 19th and 20th centuries.",
        "link": "http://arxiv.org/pdf/q-bio/0409001v1"
    },
    {
        "title": "Disciplinary authenticity: Enriching the reforms of introductory physics courses for life-science students",
        "year": "September 2011",
        "authors": "Jessica Watkins, Janet E. Coffey, Edward F. Redish, Todd J. Cooke",
        "abstract": "Educators and policy-makers have advocated for reform of undergraduate\nbiology education, calling for greater integration of mathematics and physics\nin the biology curriculum. While these calls reflect the increasingly\ninterdisciplinary nature of biology research, crossing disciplinary boundaries\nin the classroom carries epistemological challenges for both instructors and\nstudents. In this paper we expand on the construct of authenticity to better\ndescribe and understand disciplinary practices, in particular to examine those\nused in physics and biology courses. We then apply these ideas to examine an\nintroductory biology course that incorporates physics and mathematics. We\ncharacterize the uses of interdisciplinary tools in this biology course and\ncontrast them with the typical uses of these tools in physics courses. Finally,\nwe examine student responses to the use of mathematics and physics in this\ncourse, to better understand the challenges and consequences of using\ninterdisciplinary tools in introductory courses. We link these results to the\nreform initiatives of introductory physics courses for life-science students.",
        "link": "http://arxiv.org/pdf/1109.4983v1"
    },
    {
        "title": "An Optimal Likelihood Free Method for Biological Model Selection",
        "year": "August 2022",
        "authors": "Vincent D. Zaballa, Elliot E. Hui",
        "abstract": "Systems biology seeks to create math models of biological systems to reduce\ninherent biological complexity and provide predictions for applications such as\ntherapeutic development. However, it remains a challenge to determine which\nmath model is correct and how to arrive optimally at the answer. We present an\nalgorithm for automated biological model selection using mathematical models of\nsystems biology and likelihood free inference methods. Our algorithm shows\nimproved performance in arriving at correct models without a priori information\nover conventional heuristics used in experimental biology and random search.\nThis method shows promise to accelerate biological basic science and drug\ndiscovery.",
        "link": "http://arxiv.org/pdf/2208.02344v1"
    },
    {
        "title": "Approximation of Intractable Likelihood Functions in Systems Biology via Normalizing Flows",
        "year": "December 2023",
        "authors": "Vincent D. Zaballa, Elliot E. Hui",
        "abstract": "Systems biology relies on mathematical models that often involve complex and\nintractable likelihood functions, posing challenges for efficient inference and\nmodel selection. Generative models, such as normalizing flows, have shown\nremarkable ability in approximating complex distributions in various domains.\nHowever, their application in systems biology for approximating intractable\nlikelihood functions remains unexplored. Here, we elucidate a framework for\nleveraging normalizing flows to approximate complex likelihood functions\ninherent to systems biology models. By using normalizing flows in the\nSimulation-based inference setting, we demonstrate a method that not only\napproximates a likelihood function but also allows for model inference in the\nmodel selection setting. We showcase the effectiveness of this approach on\nreal-world systems biology problems, providing practical guidance for\nimplementation and highlighting its advantages over traditional computational\nmethods.",
        "link": "http://arxiv.org/pdf/2312.02391v1"
    },
    {
        "title": "Guidelines for benchmarking of optimization approaches for fitting mathematical models",
        "year": "July 2019",
        "authors": "Clemens Kreutz",
        "abstract": "Insufficient performance of optimization approaches for fitting of\nmathematical models is still a major bottleneck in systems biology. In this\nmanuscript, the reasons and methodological challenges are summarized as well as\ntheir impact in benchmark studies. Important aspects for increasing evidence of\noutcomes of benchmark analyses are discussed. Based on general guidelines for\nbenchmarking in computational biology, a collection of tailored guidelines is\npresented for performing informative and unbiased benchmarking of\noptimization-based fitting approaches. Comprehensive benchmark studies based on\nthese recommendations are urgently required for establishing of a robust and\nreliable methodology for the systems biology community.",
        "link": "http://arxiv.org/pdf/1907.03427v1"
    },
    {
        "title": "The Lost Art of Mathematical Modelling",
        "year": "January 2023",
        "authors": "Linnéa Gyllingberg, Abeba Birhane, David J. T. Sumpter",
        "abstract": "We provide a critique of mathematical biology in light of rapid developments\nin modern machine learning. We argue that out of the three modelling activities\n-- (1) formulating models; (2) analysing models; and (3) fitting or comparing\nmodels to data -- inherent to mathematical biology, researchers currently focus\ntoo much on activity (2) at the cost of (1). This trend, we propose, can be\nreversed by realising that any given biological phenomena can be modelled in an\ninfinite number of different ways, through the adoption of an open/pluralistic\napproach. We explain the open approach using fish locomotion as a case study\nand illustrate some of the pitfalls -- universalism, creating models of models,\netc. -- that hinder mathematical biology. We then ask how we might rediscover a\nlost art: that of creative mathematical modelling.\n  This article is dedicated to the memory of Edmund Crampin.",
        "link": "http://arxiv.org/pdf/2301.08559v2"
    },
    {
        "title": "Finding meaningful and workable applied mathematics problems in science",
        "year": "January 2023",
        "authors": "Yue Wang",
        "abstract": "In this short review, I will summarize my research experience in three fields\nin applied mathematics: mathematical biology, applied probability, and applied\ndiscrete mathematics. Specifically, I will show how each project was initiated,\nand what wrong approaches were applied. Such details are important in learning\nhow to do research, but they cannot be read out from research papers. I wish\nthat students and junior researchers in applied mathematics could learn a\nlesson from this summary.",
        "link": "http://arxiv.org/pdf/2301.06224v1"
    },
    {
        "title": "Explicit and Exact Traveling Wave Solutions of Cahn Allen equation using MSE Method",
        "year": "November 2016",
        "authors": "Harun-Or-Roshid, M. Zulfikar Ali, Md. Rafiqul Islam",
        "abstract": "By using Modified simple equation method, we study the Cahn Allen equation\nwhich arises in many scientific applications such as mathematical biology,\nquantum mechanics and plasma physics. As a result, the existence of solitary\nwave solutions of the Cahn Allen equation is obtained. Exact explicit solutions\ninterms of hyperbolic solutions of the associated Cahn Allen equation are\ncharacterized with some free parameters. Finally, the variety of structure and\ngraphical representation make the dynamics of the equations visible and\nprovides the mathematical foundation in mathematical biology, quantum mechanics\nand plasma physics.",
        "link": "http://arxiv.org/pdf/1611.06847v1"
    },
    {
        "title": "On Reidys and Stadler's metrics for RNA secondary structures",
        "year": "May 2003",
        "authors": "Francesc Rossello",
        "abstract": "We compute explicitly several abstract metrics for RNA secondary structures\ndefined by Reidys and Stadler.",
        "link": "http://arxiv.org/pdf/math/0305222v1"
    },
    {
        "title": "Quantitative Measure of Stability in Gene Regulatory Networks",
        "year": "July 2005",
        "authors": "P. Ao",
        "abstract": "A quantitative measure of stability in stochastic dynamics starts to emerge\nin recent experiments on bioswitches. This quantity, similar to the potential\nfunction in mathematics, is deeply rooted in biology, dated back at the\nbeginning of quantitative description of biological processes: the adaptive\nlandscape of Wright (1932) and the development landscape of Waddington (1940).\nNevertheless, its quantitative implication has been frequently challenged by\nbiologists. Recent progresses in quantitative biology begin to meet those\noutstanding challenges.",
        "link": "http://arxiv.org/pdf/q-bio/0507009v1"
    },
    {
        "title": "Reproducible research using biomodels",
        "year": "June 2018",
        "authors": "Pedro Mendes",
        "abstract": "Like other types of computational research, modeling and simulation of\nbiological processes (biomodels) is still largely communicated without\nsufficient detail to allow independent reproduction of results. But\nreproducibility in this area of research could easily be achieved by making use\nof existing resources, such as supplying models in standard formats and\ndepositing code, models, and results in public repositories.",
        "link": "http://arxiv.org/pdf/1806.01078v1"
    },
    {
        "title": "Global Existence for some Cross Diffusion Systems with Equal Cross Diffusion/Reaction Rates",
        "year": "October 2019",
        "authors": "Dung Le",
        "abstract": "We consider some cross diffusion systems which is inspired by models in\nmathematical biology/ecology, in particular the Shigesada-Kawasaki-Teramoto\n(SKT) model in population biology. We establish the global existence of strong\nsolutions to systems for multiple species having equal either diffusion or\nreaction rates. The systems are given on bounded domains of arbitrary\ndimension.",
        "link": "http://arxiv.org/pdf/1910.07260v2"
    }
]