{
    "last_month": [
        {
            "title": "Open Mathematical Tasks as a Didactic Response to Generative Artificial Intelligence in Post-AI Contexts",
            "year": "February 2026",
            "date": "2026-02-09",
            "authors": "Felix De la Cruz Serrano",
            "abstract": "The widespread availability of generative artificial intelligence tools poses new challenges for school mathematics education, particularly regarding the formative role of traditional mathematical tasks. In post-AI educational contexts, many activities can be solved automatically, without engaging students in interpretation, decision-making, or mathematical validation processes.\n  This study analyzes a secondary school classroom experience in which open mathematical tasks are implemented as a didactic response to this scenario, aiming to sustain students' mathematical activity. Adopting a qualitative and descriptive-interpretative approach, the study examines the forms of mathematical work that emerge during task resolution, mediated by the didactic regulation device COMPAS.\n  The analysis is structured around four analytical axes: open task design in post-AI contexts, students' mathematical agency, human-AI complementarity, and modeling and validation practices. The findings suggest that, under explicit didactic regulation, students retain epistemic control over mathematical activity, even in the presence of generative artificial intelligence.",
            "link": "https://arxiv.org/pdf/2602.09242v1"
        },
        {
            "title": "On the well-posedness of a certain model with two kernels appearing in the mathematical biology",
            "year": "February 2026",
            "date": "2026-02-08",
            "authors": "Messoud Efendiev, Vitali Vougalter",
            "abstract": "The work is devoted to establishing the global well-posedness in \\(W^{(1,2),2}(R\\times R^{+})\\) of the integro-differential problem involving the two nonlocal terms describing the diffusion and the production in the biological system in the presence of the transport term. Such model is relevant to the cell population dynamics in the Mathematical Biology. The proof is based on a fixed point technique.",
            "link": "https://arxiv.org/pdf/2602.08102v1"
        },
        {
            "title": "AI for Mathematics: Progress, Challenges, and Prospects",
            "year": "January 2026",
            "date": "2026-01-19",
            "authors": "Haocheng Ju, Bin Dong",
            "abstract": "AI for Mathematics (AI4Math) has emerged as a distinct field that leverages machine learning to navigate mathematical landscapes historically intractable for early symbolic systems. While mid-20th-century symbolic approaches successfully automated formal logic, they faced severe scalability limitations due to the combinatorial explosion of the search space. The recent integration of data-driven approaches has revitalized this pursuit. In this review, we provide a systematic overview of AI4Math, highlighting its primary focus on developing AI models to support mathematical research. Crucially, we emphasize that this is not merely the application of AI to mathematical activities; it also encompasses the development of stronger AI systems where the rigorous nature of mathematics serves as a premier testbed for advancing general reasoning capabilities. We categorize existing research into two complementary directions: problem-specific modeling, involving the design of specialized architectures for distinct mathematical tasks, and general-purpose modeling, focusing on foundation models capable of broader reasoning, retrieval, and exploratory workflows. We conclude by discussing key challenges and prospects, advocating for AI systems that go beyond facilitating formal correctness to enabling the discovery of meaningful results and unified theories, recognizing that the true value of a proof lies in the insights and tools it offers to the broader mathematical landscape.",
            "link": "https://arxiv.org/pdf/2601.13209v4"
        },
        {
            "title": "Large Language Models: A Mathematical Formulation",
            "year": "January 2026",
            "date": "2026-01-21",
            "authors": "Ricardo Baptista, Andrew Stuart, Son Tran",
            "abstract": "Large language models (LLMs) process and predict sequences containing text to answer questions, and address tasks including document summarization, providing recommendations, writing software and solving quantitative problems. We provide a mathematical framework for LLMs by describing the encoding of text sequences into sequences of tokens, defining the architecture for next-token prediction models, explaining how these models are learned from data, and demonstrating how they are deployed to address a variety of tasks. The mathematical sophistication required to understand this material is not high, and relies on straightforward ideas from information theory, probability and optimization. Nonetheless, the combination of ideas resting on these different components from the mathematical sciences yields a complex algorithmic structure; and this algorithmic structure has demonstrated remarkable empirical successes. The mathematical framework established here provides a platform from which it is possible to formulate and address questions concerning the accuracy, efficiency and robustness of the algorithms that constitute LLMs. The framework also suggests directions for development of modified and new methodologies.",
            "link": "https://arxiv.org/pdf/2601.22170v1"
        },
        {
            "title": "LLAMA LIMA: A Living Meta-Analysis on the Effects of Generative AI on Learning Mathematics",
            "year": "January 2026",
            "date": "2026-01-26",
            "authors": "Anselm Strohmaier, Samira Bödefeld, Frank Reinhold",
            "abstract": "The capabilities of generative AI in mathematics education are rapidly evolving, posing significant challenges for research to keep pace. Research syntheses remain scarce and risk being outdated by the time of publication. To address this issue, we present a Living Meta-Analysis (LIMA) on the effects of generative AI-based interventions for learning mathematics. Following PRISMA-LSR guidelines, we continuously update the literature base, apply a Bayesian multilevel meta-regression model to account for cumulative data, and publish updated versions on a preprint server at regular intervals. This paper reports results from the first version, including 15 studies. The analyses indicate a small positive effect (g = 0.31) with a wide credible interval [0.06, 0.58], reflecting the still limited evidence base.",
            "link": "https://arxiv.org/pdf/2601.18685v1"
        }
    ],
    "last_year": [
        {
            "title": "The Folding Mathematics",
            "year": "March 2025",
            "date": "2025-03-03",
            "authors": "Archana S. Morye",
            "abstract": "Origami is the art of paper folding, and it borrows its name from two Japanese words \\emph{ori} and \\emph{kami}. In Japanese, {ori} means folding, and the paper is called {kami}. While origami is just a hobby to most, there is a lot more to it. If you fold a square sheet of paper into any of the traditional origami model (for example the flapping bird) and unfold it, you can see crease patterns. These crease patterns tell us that there is a lot of geometry hidden behind the folds.\n  In this article, we investigate the symbiotic relationship between mathematics and origami. The first part of this article explores the utility of origami in education. We will see how origami could become an effective way of teaching methods of geometry, mainly because of its experiential nature. Complex origami patterns cannot be created out of thin air. They usually involve understanding deep mathematical theories and the ability to apply them to paper folding. In the second part of the article, we attempt to provide a glimpse of this beautiful connection between origami and mathematics.",
            "link": "https://arxiv.org/pdf/2503.11679v1"
        },
        {
            "title": "Open Mathematical Tasks as a Didactic Response to Generative Artificial Intelligence in Post-AI Contexts",
            "year": "February 2026",
            "date": "2026-02-09",
            "authors": "Felix De la Cruz Serrano",
            "abstract": "The widespread availability of generative artificial intelligence tools poses new challenges for school mathematics education, particularly regarding the formative role of traditional mathematical tasks. In post-AI educational contexts, many activities can be solved automatically, without engaging students in interpretation, decision-making, or mathematical validation processes.\n  This study analyzes a secondary school classroom experience in which open mathematical tasks are implemented as a didactic response to this scenario, aiming to sustain students' mathematical activity. Adopting a qualitative and descriptive-interpretative approach, the study examines the forms of mathematical work that emerge during task resolution, mediated by the didactic regulation device COMPAS.\n  The analysis is structured around four analytical axes: open task design in post-AI contexts, students' mathematical agency, human-AI complementarity, and modeling and validation practices. The findings suggest that, under explicit didactic regulation, students retain epistemic control over mathematical activity, even in the presence of generative artificial intelligence.",
            "link": "https://arxiv.org/pdf/2602.09242v1"
        },
        {
            "title": "Decoding the Ishango Bone: Unveiling Prehistoric Mathematical Art",
            "year": "April 2025",
            "date": "2025-04-08",
            "authors": "Jenny Baur",
            "abstract": "The Ishango Bone, a prehistoric artifact dated to approximately 20,000 years ago and discovered near the Semliki River in what is now the Democratic Republic of Congo, has intrigued researchers for the past 75 years. The artifact displays sixteen groups of notches arranged in three columns. While its function remains debated, this study suggests that the first two columns consist exclusively of all prime or odd numbers between 9 and 21, with the exception of 15, which appears only in the third column as two grouped pairs. Five groupings totaling 30 could be identified, and their arrangement may follow a consistent pattern. Additional numerical relationships between all three columns can be interpreted to support all four basic arithmetic operations. It is hypothesized that the notches may have served as reference marker to lay out their values for storytelling or teaching in the form of mathematical art. This study aims to broaden perspectives on the Ishango Bone and its traditional interpretation as a simple tallying device, and to encourage a re-evaluation of the mathematical capabilities of prehistoric humans.",
            "link": "https://arxiv.org/pdf/2504.06412v3"
        },
        {
            "title": "On Physical Mathematics: an approach through Gilles Châtelet's philosophy",
            "year": "October 2025",
            "date": "2025-10-15",
            "authors": "John Alexander Cruz Morales",
            "abstract": "Starting from Greg Moore's description about Physical Mathematics, a framework is proposed in order to understand it, based on Gilles Châtelet's philosophy. It will be argued that Châtelet's ideas of inverting, splitting, augmenting and virtuality are crucial in the discussion about the nature of Physical Mathematics. Along this line, it will be proposed that mirror symmetry is a natural study case to test Châtelet's ideas in this context. This should be considered as a first step in a long term project aiming to study the relations among mathematics, physics and philosophy in the construction of a global understanding of the structure of the universe, as it was envisioned by Grothendieck in the late 80's of the last century and it was started to be developed independently by Châtelet in the beginning of the 90's. The main suggestion of the essay is that it is in the relations between mathematics, physics and philosophy that new knowledge arises.",
            "link": "https://arxiv.org/pdf/2510.13125v1"
        },
        {
            "title": "The Mathematical Theory of Behavioural Swarms: Towards Modelling the Collective Dynamics of Living Systems",
            "year": "August 2025",
            "date": "2025-08-16",
            "authors": "Rene Fabregas, Jie Liao, Nisrine Outada",
            "abstract": "Classical swarm models, exemplified by the Cucker--Smale framework, provide foundational insights into collective alignment but exhibit fundamental limitations in capturing the adaptive, heterogeneous behaviours intrinsic to living systems. This paper formalises the mathematical theory of \\textit{Behavioural Swarms}, a comprehensive framework where each particle's state incorporates a dynamic internal variable, the \\textit{activity} that co-evolves with position and velocity through nonlocal interactions. We demonstrate how this approach transcends prior models by integrating adaptive decision-making mechanisms and heterogeneous behavioural states into rigorous differential systems. Through applications in behavioural economics and crowd dynamics, we establish the theory's capacity to predict emergent macroscopic patterns from individual behavioural states. Our critical analysis positions this framework against kinetic theories of active particles and agent-based approaches, revealing distinct advantages for modelling systems where individual agency drives collective outcomes.",
            "link": "https://arxiv.org/pdf/2508.12183v2"
        }
    ],
    "last_5_years": [
        {
            "title": "The Modern Mathematics of Deep Learning",
            "year": "May 2021",
            "date": "2021-05-09",
            "authors": "Julius Berner, Philipp Grohs, Gitta Kutyniok, Philipp Petersen",
            "abstract": "We describe the new field of mathematical analysis of deep learning. This field emerged around a list of research questions that were not answered within the classical framework of learning theory. These questions concern: the outstanding generalization power of overparametrized neural networks, the role of depth in deep architectures, the apparent absence of the curse of dimensionality, the surprisingly successful optimization performance despite the non-convexity of the problem, understanding what features are learned, why deep architectures perform exceptionally well in physical problems, and which fine aspects of an architecture affect the behavior of a learning task in which way. We present an overview of modern approaches that yield partial answers to these questions. For selected approaches, we describe the main ideas in more detail.",
            "link": "https://arxiv.org/pdf/2105.04026v2"
        },
        {
            "title": "The Folding Mathematics",
            "year": "March 2025",
            "date": "2025-03-03",
            "authors": "Archana S. Morye",
            "abstract": "Origami is the art of paper folding, and it borrows its name from two Japanese words \\emph{ori} and \\emph{kami}. In Japanese, {ori} means folding, and the paper is called {kami}. While origami is just a hobby to most, there is a lot more to it. If you fold a square sheet of paper into any of the traditional origami model (for example the flapping bird) and unfold it, you can see crease patterns. These crease patterns tell us that there is a lot of geometry hidden behind the folds.\n  In this article, we investigate the symbiotic relationship between mathematics and origami. The first part of this article explores the utility of origami in education. We will see how origami could become an effective way of teaching methods of geometry, mainly because of its experiential nature. Complex origami patterns cannot be created out of thin air. They usually involve understanding deep mathematical theories and the ability to apply them to paper folding. In the second part of the article, we attempt to provide a glimpse of this beautiful connection between origami and mathematics.",
            "link": "https://arxiv.org/pdf/2503.11679v1"
        },
        {
            "title": "Points of convergence -- music meets mathematics",
            "year": "September 2023",
            "date": "2023-09-12",
            "authors": "Lasse Rempe",
            "abstract": "\"Phase-locking\" is a fundamental phenomenon in which coupled or periodically forced oscillators synchronise. The Arnold family of circle maps, which describes a forced oscillator, is the simplest mathematical model of phase-locking and has been studied intensively since its introduction in the 1960s. The family exhibits regions of parameter space where phase-locking phenomena can be observed. A long-standing question asked whether \"hyperbolic\" parameters~-- those whose behaviour is dominated by periodic attractors, and which are therefore stable under perturbation~-- are dense within the family. A positive answer was given in 2015 by van Strien and the author, which implies that, no matter how chaotic a map within the family may behave, there are always systems with stable behaviour nearby. This research was a focal point of a pioneering collaboration with composer Emily Howard, commencing with Howard's residency in Liverpool's mathematics department in 2015. The collaboration generated impacts on creativity, culture and society, including several musical works by Howard, and lasting influence on artistic practice through a first-of-its-kind centre for science and music. We describe the research and the collaboration, and reflect on the factors that contributed to the latter's success.",
            "link": "https://arxiv.org/pdf/2309.06595v1"
        },
        {
            "title": "Open Mathematical Tasks as a Didactic Response to Generative Artificial Intelligence in Post-AI Contexts",
            "year": "February 2026",
            "date": "2026-02-09",
            "authors": "Felix De la Cruz Serrano",
            "abstract": "The widespread availability of generative artificial intelligence tools poses new challenges for school mathematics education, particularly regarding the formative role of traditional mathematical tasks. In post-AI educational contexts, many activities can be solved automatically, without engaging students in interpretation, decision-making, or mathematical validation processes.\n  This study analyzes a secondary school classroom experience in which open mathematical tasks are implemented as a didactic response to this scenario, aiming to sustain students' mathematical activity. Adopting a qualitative and descriptive-interpretative approach, the study examines the forms of mathematical work that emerge during task resolution, mediated by the didactic regulation device COMPAS.\n  The analysis is structured around four analytical axes: open task design in post-AI contexts, students' mathematical agency, human-AI complementarity, and modeling and validation practices. The findings suggest that, under explicit didactic regulation, students retain epistemic control over mathematical activity, even in the presence of generative artificial intelligence.",
            "link": "https://arxiv.org/pdf/2602.09242v1"
        },
        {
            "title": "Constructive mathematics and teaching",
            "year": "May 2023",
            "date": "2023-05-31",
            "authors": "Alexander Shen",
            "abstract": "Constructivists (and intuitionists in general) asked what kind of mental construction is needed to convince ourselves (and others) that some mathematical statement is true. This question has a much more practical (and even cynical) counterpart: a student of a mathematics class wants to know what will the teacher accept as a correct solution of a homework problem. Here the logical structure of the claim is also very important, and we discuss several types of problems and their use in teaching mathematics.",
            "link": "https://arxiv.org/pdf/2305.19882v1"
        }
    ],
    "all_time": [
        {
            "title": "Developing a 21st Century Global Library for Mathematics Research",
            "year": "April 2014",
            "date": "2014-04-04",
            "authors": "Committee on Planning a Global Library of the Mathematical Sciences",
            "abstract": "Developing a 21st Century Global Library for Mathematics Research discusses how information about what the mathematical literature contains can be formalized and made easier to express, encode, and explore. Many of the tools necessary to make this information system a reality will require much more than indexing and will instead depend on community input paired with machine learning, where mathematicians' expertise can fill the gaps of automatization. This report proposes the establishment of an organization; the development of a set of platforms, tools, and services; the deployment of an ongoing applied research program to complement the development work; and the mobilization and coordination of the mathematical community to take the first steps toward these capabilities. The report recommends building on the extensive work done by many dedicated individuals under the rubric of the World Digital Mathematical Library, as well as many other community initiatives. Developing a 21st Century Global Library for Mathematics envisions a combination of machine learning methods and community-based editorial effort that makes a significantly greater portion of the information and knowledge in the global mathematical corpus available to researchers as linked open data through a central organizational entity-referred to in the report as the Digital Mathematics Library. This report describes how such a library might operate - discussing development and research needs, role in facilitating discover and interaction, and establishing partnerships with publishers.",
            "link": "https://arxiv.org/pdf/1404.1905v1"
        },
        {
            "title": "Idempotent and tropical mathematics and problems of mathematical physics (Volume I)",
            "year": "October 2007",
            "date": "2007-10-01",
            "authors": "Grigory Litvinov, Victor Maslov, Sergei Sergeev",
            "abstract": "This volume contains the proceedings of an International Workshop on Idempotent and Tropical Mathematics and Problems of Mathematical Physics, held at the Independent University of Moscow, Russia, on August 25-30, 2007.",
            "link": "https://arxiv.org/pdf/0710.0377v1"
        },
        {
            "title": "Idempotent and tropical mathematics and problems of mathematical physics (Volume II)",
            "year": "September 2007",
            "date": "2007-09-26",
            "authors": "Grigory Litvinov, Victor Maslov, Sergei Sergeev",
            "abstract": "This volume contains the proceedings of an International Workshop on Idempotent and Tropical Mathematics and Problems of Mathematical Physics, held at the Independent University of Moscow, Russia, on August 25-30, 2007.",
            "link": "https://arxiv.org/pdf/0709.4119v1"
        },
        {
            "title": "The Modern Mathematics of Deep Learning",
            "year": "May 2021",
            "date": "2021-05-09",
            "authors": "Julius Berner, Philipp Grohs, Gitta Kutyniok, Philipp Petersen",
            "abstract": "We describe the new field of mathematical analysis of deep learning. This field emerged around a list of research questions that were not answered within the classical framework of learning theory. These questions concern: the outstanding generalization power of overparametrized neural networks, the role of depth in deep architectures, the apparent absence of the curse of dimensionality, the surprisingly successful optimization performance despite the non-convexity of the problem, understanding what features are learned, why deep architectures perform exceptionally well in physical problems, and which fine aspects of an architecture affect the behavior of a learning task in which way. We present an overview of modern approaches that yield partial answers to these questions. For selected approaches, we describe the main ideas in more detail.",
            "link": "https://arxiv.org/pdf/2105.04026v2"
        },
        {
            "title": "The Folding Mathematics",
            "year": "March 2025",
            "date": "2025-03-03",
            "authors": "Archana S. Morye",
            "abstract": "Origami is the art of paper folding, and it borrows its name from two Japanese words \\emph{ori} and \\emph{kami}. In Japanese, {ori} means folding, and the paper is called {kami}. While origami is just a hobby to most, there is a lot more to it. If you fold a square sheet of paper into any of the traditional origami model (for example the flapping bird) and unfold it, you can see crease patterns. These crease patterns tell us that there is a lot of geometry hidden behind the folds.\n  In this article, we investigate the symbiotic relationship between mathematics and origami. The first part of this article explores the utility of origami in education. We will see how origami could become an effective way of teaching methods of geometry, mainly because of its experiential nature. Complex origami patterns cannot be created out of thin air. They usually involve understanding deep mathematical theories and the ability to apply them to paper folding. In the second part of the article, we attempt to provide a glimpse of this beautiful connection between origami and mathematics.",
            "link": "https://arxiv.org/pdf/2503.11679v1"
        }
    ]
}