{
    "last_month": [
        {
            "title": "AI for Mathematics: Progress, Challenges, and Prospects",
            "year": "January 2026",
            "date": "2026-01-19",
            "authors": "Haocheng Ju, Bin Dong",
            "abstract": "AI for Mathematics (AI4Math) has emerged as a distinct field that leverages machine learning to navigate mathematical landscapes historically intractable for early symbolic systems. While mid-20th-century symbolic approaches successfully automated formal logic, they faced severe scalability limitations due to the combinatorial explosion of the search space. The recent integration of data-driven approaches has revitalized this pursuit. In this review, we provide a systematic overview of AI4Math, highlighting its primary focus on developing AI models to support mathematical research. Crucially, we emphasize that this is not merely the application of AI to mathematical activities; it also encompasses the development of stronger AI systems where the rigorous nature of mathematics serves as a premier testbed for advancing general reasoning capabilities. We categorize existing research into two complementary directions: problem-specific modeling, involving the design of specialized architectures for distinct mathematical tasks, and general-purpose modeling, focusing on foundation models capable of broader reasoning, retrieval, and exploratory workflows. We conclude by discussing key challenges and prospects, advocating for AI systems that go beyond facilitating formal correctness to enabling the discovery of meaningful results and unified theories, recognizing that the true value of a proof lies in the insights and tools it offers to the broader mathematical landscape.",
            "link": "https://arxiv.org/pdf/2601.13209v2"
        },
        {
            "title": "Mathematical Analysis of Symmetry-Protected Bound States in the Continuum in Waveguide Arrays",
            "year": "December 2025",
            "date": "2025-12-24",
            "authors": "Xin Feng, Wei Wu",
            "abstract": "This paper presents a rigorous mathematical analysis for symmetry-based Bound States in the Continuum (BICs) in optical waveguide arrays. Different from existing research, we consider a finite system of horizontally and equidistantly aligned waveguides and transform the wave propagation problem into Nonorthogonal Coupled-Mode Equations (NCME), rather than adopting the tight-binding approximation or orthogonal coupled-mode equations. We derive the exact expressions of the overlap integrals and coupling coefficients by utilizing the addition theorems of Bessel functions. We then generalize the discussion to an infinite waveguide array and rigorously characterize the dispersion relation and continuum with the help of theories in harmonic analysis. In the second part of the paper, we give a strict proof of the existence of BICs in the aforementioned waveguide system with two additional identical vertical waveguides aligned symmetrically above and below the horizontal waveguide array. We further numerically demonstrate the transition from a perfect BIC to a leaky mode by introducing a symmetry-breaking refractive index perturbation and quantitatively analyze the resulting radiation losses. This work gives a comprehensive study of symmetry-protected BICs and provides an efficient and precise computational model for designing such BICs devices.",
            "link": "https://arxiv.org/pdf/2512.20895v1"
        },
        {
            "title": "A dynamical model of the U.S. mathematics graduate degree pipeline",
            "year": "January 2026",
            "date": "2026-01-13",
            "authors": "Chad M. Topaz, Oluwatosin Babasola, Ron Buckmire, Daozhou Gao, Maila Hallare, Olaniyi Iyiola, Deanna Needell, Andrés R. Vindas-Meléndez",
            "abstract": "We present a latent-stock compartmental framework for modeling degree production systems when only completion flows, rather than enrollments, are observed. Applied to U.S.\\ mathematics degrees from 1969 to 2017, the model treats master's and PhD populations as latent compartments -- unobserved state variables that are inferred indirectly because they generate the observed completion flows -- with time-varying routing fractions and completion hazards. Using information-criterion model comparison across a grid of specifications, we find strong support for smooth nonlinear time variation in routing fractions and hazards, while models with explicit international forcing are disfavored. The preferred model achieves a log-scale root mean squared error of approximately 0.036, corresponding to a typical multiplicative error of about 4\\% in fitted degree counts, and highlights key structural shifts in the graduate pipeline: the master's pathway became increasingly central to PhD production through the late twentieth century before weakening, while direct bachelor's-to-PhD entry remained small but persistent. Estimated completion hazards for both degrees rise over time, indicating faster effective turnover in the graduate compartments. Methodologically, our main contribution is a latent stock dynamical approach that recasts linked degreecompletion time series as a coherent stock-flow system when intermediate enrollments are unobserved, making explicit both what features of pipeline dynamics are identifiable from completion data alone and what limitations such data impose.",
            "link": "https://arxiv.org/pdf/2601.08525v1"
        },
        {
            "title": "Mathematical Theory for Photonic Hall Effect in Honeycomb Photonic Crystals",
            "year": "December 2025",
            "date": "2025-12-30",
            "authors": "Wei Li, Junshan Lin, Jiayu Qiu, Hai Zhang",
            "abstract": "In this work, we develop a mathematical theory for the photonic Hall effect and prove the existence of guided electromagnetic waves at the interface of two honeycomb photonic crystals. The guided wave resembles the edge states in electronic systems: it is induced by the topological Hall effect, and the wave propagates along the interface but not in the bulk media. Starting from a symmetric honeycomb photonic crystal that attains Dirac points at the high-symmetry points of the Brillouin zone, \\(K\\) and \\(K'\\), we introduce two classes of perturbations for the periodic medium. The perturbations lift the Dirac degeneracy, forming a spectral band valley at the points \\(K\\) and \\(K'\\) with well-defined topological phase that depends on the sign of the perturbation parameters. By employing the layer potential techniques and spectral analysis, we investigate the existence of guided wave along an interface when two honeycomb photonic crystals are glued together. In particular, we elucidate the relationship between the existence of the interface mode and the nature of perturbations imposed on the two periodic media separated by the interface.",
            "link": "https://arxiv.org/pdf/2512.24477v1"
        },
        {
            "title": "Process In-Context Learning: Enhancing Mathematical Reasoning via Dynamic Demonstration Insertion",
            "year": "January 2026",
            "date": "2026-01-17",
            "authors": "Ang Gao, Changshuo Zhang, Xiao Zhang, Deyang Li, Minjun Zhao, Fangchao Liu, Xinyu Zhang",
            "abstract": "In-context learning (ICL) has proven highly effective across diverse large language model (LLM) tasks. However, its potential for enhancing tasks that demand step-by-step logical deduction, such as mathematical reasoning, remains underexplored. A core limitation of existing ICL approaches is their static use of demonstrations: examples are pre-selected before inference and remain fixed, failing to adapt to the dynamic confusion points that often arise during multi-step reasoning such as ambiguous calculations or logical gaps. These unresolved confusion points can lead to cascading errors that degrade final accuracy. To tackle this issue, we propose Process In-Context Learning (PICL), a dynamic demonstration integration framework designed to boost mathematical reasoning by responding to real-time inference needs. PICL operates in two stages: 1)~it identifies potential confusion points by analyzing semantics and entropy in the reasoning process and summarizes their core characteristics; 2)~upon encountering these points, it retrieves relevant demonstrations from the demonstration pool that match the confusion context and inserts them directly into the ongoing reasoning process to guide subsequent steps. Experiments show that PICL outperforms baseline methods by mitigating mid-inference confusion, highlighting the value of adaptive demonstration insertion in complex mathematical reasoning.",
            "link": "https://arxiv.org/pdf/2601.11979v1"
        }
    ],
    "last_year": [
        {
            "title": "The Folding Mathematics",
            "year": "March 2025",
            "date": "2025-03-03",
            "authors": "Archana S. Morye",
            "abstract": "Origami is the art of paper folding, and it borrows its name from two Japanese words \\emph{ori} and \\emph{kami}. In Japanese, {ori} means folding, and the paper is called {kami}. While origami is just a hobby to most, there is a lot more to it. If you fold a square sheet of paper into any of the traditional origami model (for example the flapping bird) and unfold it, you can see crease patterns. These crease patterns tell us that there is a lot of geometry hidden behind the folds.\n  In this article, we investigate the symbiotic relationship between mathematics and origami. The first part of this article explores the utility of origami in education. We will see how origami could become an effective way of teaching methods of geometry, mainly because of its experiential nature. Complex origami patterns cannot be created out of thin air. They usually involve understanding deep mathematical theories and the ability to apply them to paper folding. In the second part of the article, we attempt to provide a glimpse of this beautiful connection between origami and mathematics.",
            "link": "https://arxiv.org/pdf/2503.11679v1"
        },
        {
            "title": "Decoding the Ishango Bone: Unveiling Prehistoric Mathematical Art",
            "year": "April 2025",
            "date": "2025-04-08",
            "authors": "Jenny Baur",
            "abstract": "The Ishango Bone, a prehistoric artifact dated to approximately 20,000 years ago and discovered near the Semliki River in what is now the Democratic Republic of Congo, has intrigued researchers for the past 75 years. The artifact displays sixteen groups of notches arranged in three columns. While its function remains debated, this study suggests that the first two columns consist exclusively of all prime or odd numbers between 9 and 21, with the exception of 15, which appears only in the third column as two grouped pairs. Five groupings totaling 30 could be identified, and their arrangement may follow a consistent pattern. Additional numerical relationships between all three columns can be interpreted to support all four basic arithmetic operations. It is hypothesized that the notches may have served as reference marker to lay out their values for storytelling or teaching in the form of mathematical art. This study aims to broaden perspectives on the Ishango Bone and its traditional interpretation as a simple tallying device, and to encourage a re-evaluation of the mathematical capabilities of prehistoric humans.",
            "link": "https://arxiv.org/pdf/2504.06412v3"
        },
        {
            "title": "On Physical Mathematics: an approach through Gilles Châtelet's philosophy",
            "year": "October 2025",
            "date": "2025-10-15",
            "authors": "John Alexander Cruz Morales",
            "abstract": "Starting from Greg Moore's description about Physical Mathematics, a framework is proposed in order to understand it, based on Gilles Châtelet's philosophy. It will be argued that Châtelet's ideas of inverting, splitting, augmenting and virtuality are crucial in the discussion about the nature of Physical Mathematics. Along this line, it will be proposed that mirror symmetry is a natural study case to test Châtelet's ideas in this context. This should be considered as a first step in a long term project aiming to study the relations among mathematics, physics and philosophy in the construction of a global understanding of the structure of the universe, as it was envisioned by Grothendieck in the late 80's of the last century and it was started to be developed independently by Châtelet in the beginning of the 90's. The main suggestion of the essay is that it is in the relations between mathematics, physics and philosophy that new knowledge arises.",
            "link": "https://arxiv.org/pdf/2510.13125v1"
        },
        {
            "title": "The Mathematical Theory of Behavioural Swarms: Towards Modelling the Collective Dynamics of Living Systems",
            "year": "August 2025",
            "date": "2025-08-16",
            "authors": "Rene Fabregas, Jie Liao, Nisrine Outada",
            "abstract": "Classical swarm models, exemplified by the Cucker--Smale framework, provide foundational insights into collective alignment but exhibit fundamental limitations in capturing the adaptive, heterogeneous behaviours intrinsic to living systems. This paper formalises the mathematical theory of \\textit{Behavioural Swarms}, a comprehensive framework where each particle's state incorporates a dynamic internal variable, the \\textit{activity} that co-evolves with position and velocity through nonlocal interactions. We demonstrate how this approach transcends prior models by integrating adaptive decision-making mechanisms and heterogeneous behavioural states into rigorous differential systems. Through applications in behavioural economics and crowd dynamics, we establish the theory's capacity to predict emergent macroscopic patterns from individual behavioural states. Our critical analysis positions this framework against kinetic theories of active particles and agent-based approaches, revealing distinct advantages for modelling systems where individual agency drives collective outcomes.",
            "link": "https://arxiv.org/pdf/2508.12183v2"
        },
        {
            "title": "Ethical and sustainable mathematics is localised: why global paradigms fail and culturally-situated practices are essential",
            "year": "October 2025",
            "date": "2025-10-07",
            "authors": "Dennis Müller, Maurice Chiodo",
            "abstract": "This paper identifies several different interconnected challenges preventing the move towards more ethical and sustainable mathematics education: the entrenched belief in mathematical neutrality, the difficulty of simultaneously reforming mathematics and its pedagogy, the gap between academic theory and classroom practice, and the need for epistemic decolonisation. In this context, we look at both bottom-up and top-down approaches, and argue that globalised frameworks such as the United Nations' Sustainable Development Goals are insufficient for this transformation, and that ethical and sustainable forms of mathematics ought not to be built using these as their (philosophical) foundation. These frameworks are often rooted in a Western-centric development paradigm that can perpetuate colonial hierarchies and fails to resolve inherent conflicts between economic growth and ecological integrity. As an alternative, this paper advocates for embracing localised, culturally-situated mathematical practices. Using the Ethics in Mathematics Project as a case study within a Western, Global North institution, this paper illustrates a critical-pragmatic, multi-level strategy for fostering ethical consciousness within a specific research community, and shows how this may be achieved in otherwise adversarial circumstances.",
            "link": "https://arxiv.org/pdf/2510.05892v1"
        }
    ],
    "last_5_years": [
        {
            "title": "The Modern Mathematics of Deep Learning",
            "year": "May 2021",
            "date": "2021-05-09",
            "authors": "Julius Berner, Philipp Grohs, Gitta Kutyniok, Philipp Petersen",
            "abstract": "We describe the new field of mathematical analysis of deep learning. This field emerged around a list of research questions that were not answered within the classical framework of learning theory. These questions concern: the outstanding generalization power of overparametrized neural networks, the role of depth in deep architectures, the apparent absence of the curse of dimensionality, the surprisingly successful optimization performance despite the non-convexity of the problem, understanding what features are learned, why deep architectures perform exceptionally well in physical problems, and which fine aspects of an architecture affect the behavior of a learning task in which way. We present an overview of modern approaches that yield partial answers to these questions. For selected approaches, we describe the main ideas in more detail.",
            "link": "https://arxiv.org/pdf/2105.04026v2"
        },
        {
            "title": "The Folding Mathematics",
            "year": "March 2025",
            "date": "2025-03-03",
            "authors": "Archana S. Morye",
            "abstract": "Origami is the art of paper folding, and it borrows its name from two Japanese words \\emph{ori} and \\emph{kami}. In Japanese, {ori} means folding, and the paper is called {kami}. While origami is just a hobby to most, there is a lot more to it. If you fold a square sheet of paper into any of the traditional origami model (for example the flapping bird) and unfold it, you can see crease patterns. These crease patterns tell us that there is a lot of geometry hidden behind the folds.\n  In this article, we investigate the symbiotic relationship between mathematics and origami. The first part of this article explores the utility of origami in education. We will see how origami could become an effective way of teaching methods of geometry, mainly because of its experiential nature. Complex origami patterns cannot be created out of thin air. They usually involve understanding deep mathematical theories and the ability to apply them to paper folding. In the second part of the article, we attempt to provide a glimpse of this beautiful connection between origami and mathematics.",
            "link": "https://arxiv.org/pdf/2503.11679v1"
        },
        {
            "title": "Points of convergence -- music meets mathematics",
            "year": "September 2023",
            "date": "2023-09-12",
            "authors": "Lasse Rempe",
            "abstract": "\"Phase-locking\" is a fundamental phenomenon in which coupled or periodically forced oscillators synchronise. The Arnold family of circle maps, which describes a forced oscillator, is the simplest mathematical model of phase-locking and has been studied intensively since its introduction in the 1960s. The family exhibits regions of parameter space where phase-locking phenomena can be observed. A long-standing question asked whether \"hyperbolic\" parameters~-- those whose behaviour is dominated by periodic attractors, and which are therefore stable under perturbation~-- are dense within the family. A positive answer was given in 2015 by van Strien and the author, which implies that, no matter how chaotic a map within the family may behave, there are always systems with stable behaviour nearby. This research was a focal point of a pioneering collaboration with composer Emily Howard, commencing with Howard's residency in Liverpool's mathematics department in 2015. The collaboration generated impacts on creativity, culture and society, including several musical works by Howard, and lasting influence on artistic practice through a first-of-its-kind centre for science and music. We describe the research and the collaboration, and reflect on the factors that contributed to the latter's success.",
            "link": "https://arxiv.org/pdf/2309.06595v1"
        },
        {
            "title": "Constructive mathematics and teaching",
            "year": "May 2023",
            "date": "2023-05-31",
            "authors": "Alexander Shen",
            "abstract": "Constructivists (and intuitionists in general) asked what kind of mental construction is needed to convince ourselves (and others) that some mathematical statement is true. This question has a much more practical (and even cynical) counterpart: a student of a mathematics class wants to know what will the teacher accept as a correct solution of a homework problem. Here the logical structure of the claim is also very important, and we discuss several types of problems and their use in teaching mathematics.",
            "link": "https://arxiv.org/pdf/2305.19882v1"
        },
        {
            "title": "Applications of Teaching Secondary Mathematics in Undergraduate Mathematics Courses",
            "year": "February 2021",
            "date": "2021-02-08",
            "authors": "Elizabeth G. Arnold, Elizabeth A. Burroughs, Elizabeth W. Fulton, James A. Mendoza Álvarez",
            "abstract": "Robust preparation of future secondary mathematics teachers requires attention to the acquisition of mathematical knowledge for teaching. Many future teachers learn mathematics content primarily through mathematics major courses that are taught by mathematicians who do not specialize in teacher preparation. How can mathematics education researchers assist mathematicians in making explicit connections between the content of undergraduate mathematics courses and the content of secondary mathematics? We present an articulation of five types of connections that can be used in secondary mathematics teacher preparation and give examples of question prompts that mathematicians can use as applications of teaching secondary mathematics in undergraduate mathematics courses.",
            "link": "https://arxiv.org/pdf/2102.04537v1"
        }
    ],
    "all_time": [
        {
            "title": "Developing a 21st Century Global Library for Mathematics Research",
            "year": "April 2014",
            "date": "2014-04-04",
            "authors": "Committee on Planning a Global Library of the Mathematical Sciences",
            "abstract": "Developing a 21st Century Global Library for Mathematics Research discusses how information about what the mathematical literature contains can be formalized and made easier to express, encode, and explore. Many of the tools necessary to make this information system a reality will require much more than indexing and will instead depend on community input paired with machine learning, where mathematicians' expertise can fill the gaps of automatization. This report proposes the establishment of an organization; the development of a set of platforms, tools, and services; the deployment of an ongoing applied research program to complement the development work; and the mobilization and coordination of the mathematical community to take the first steps toward these capabilities. The report recommends building on the extensive work done by many dedicated individuals under the rubric of the World Digital Mathematical Library, as well as many other community initiatives. Developing a 21st Century Global Library for Mathematics envisions a combination of machine learning methods and community-based editorial effort that makes a significantly greater portion of the information and knowledge in the global mathematical corpus available to researchers as linked open data through a central organizational entity-referred to in the report as the Digital Mathematics Library. This report describes how such a library might operate - discussing development and research needs, role in facilitating discover and interaction, and establishing partnerships with publishers.",
            "link": "https://arxiv.org/pdf/1404.1905v1"
        },
        {
            "title": "Idempotent and tropical mathematics and problems of mathematical physics (Volume I)",
            "year": "October 2007",
            "date": "2007-10-01",
            "authors": "Grigory Litvinov, Victor Maslov, Sergei Sergeev",
            "abstract": "This volume contains the proceedings of an International Workshop on Idempotent and Tropical Mathematics and Problems of Mathematical Physics, held at the Independent University of Moscow, Russia, on August 25-30, 2007.",
            "link": "https://arxiv.org/pdf/0710.0377v1"
        },
        {
            "title": "Idempotent and tropical mathematics and problems of mathematical physics (Volume II)",
            "year": "September 2007",
            "date": "2007-09-26",
            "authors": "Grigory Litvinov, Victor Maslov, Sergei Sergeev",
            "abstract": "This volume contains the proceedings of an International Workshop on Idempotent and Tropical Mathematics and Problems of Mathematical Physics, held at the Independent University of Moscow, Russia, on August 25-30, 2007.",
            "link": "https://arxiv.org/pdf/0709.4119v1"
        },
        {
            "title": "The Modern Mathematics of Deep Learning",
            "year": "May 2021",
            "date": "2021-05-09",
            "authors": "Julius Berner, Philipp Grohs, Gitta Kutyniok, Philipp Petersen",
            "abstract": "We describe the new field of mathematical analysis of deep learning. This field emerged around a list of research questions that were not answered within the classical framework of learning theory. These questions concern: the outstanding generalization power of overparametrized neural networks, the role of depth in deep architectures, the apparent absence of the curse of dimensionality, the surprisingly successful optimization performance despite the non-convexity of the problem, understanding what features are learned, why deep architectures perform exceptionally well in physical problems, and which fine aspects of an architecture affect the behavior of a learning task in which way. We present an overview of modern approaches that yield partial answers to these questions. For selected approaches, we describe the main ideas in more detail.",
            "link": "https://arxiv.org/pdf/2105.04026v2"
        },
        {
            "title": "The Folding Mathematics",
            "year": "March 2025",
            "date": "2025-03-03",
            "authors": "Archana S. Morye",
            "abstract": "Origami is the art of paper folding, and it borrows its name from two Japanese words \\emph{ori} and \\emph{kami}. In Japanese, {ori} means folding, and the paper is called {kami}. While origami is just a hobby to most, there is a lot more to it. If you fold a square sheet of paper into any of the traditional origami model (for example the flapping bird) and unfold it, you can see crease patterns. These crease patterns tell us that there is a lot of geometry hidden behind the folds.\n  In this article, we investigate the symbiotic relationship between mathematics and origami. The first part of this article explores the utility of origami in education. We will see how origami could become an effective way of teaching methods of geometry, mainly because of its experiential nature. Complex origami patterns cannot be created out of thin air. They usually involve understanding deep mathematical theories and the ability to apply them to paper folding. In the second part of the article, we attempt to provide a glimpse of this beautiful connection between origami and mathematics.",
            "link": "https://arxiv.org/pdf/2503.11679v1"
        }
    ]
}