[
    {
        "title": "India's tryst with modern astronomy",
        "year": "September 2011",
        "authors": "S. Anathpindika",
        "abstract": "Sumedh Anathpindika surveys astronomy in India and finds a lively and\ndeveloping community as well as great public interest.",
        "link": "http://arxiv.org/pdf/1109.0904v1"
    },
    {
        "title": "Astronomy Identity Framework for Undergraduate Students and Researchers",
        "year": "October 2024",
        "authors": "Zachary Richards, Angela Kelly",
        "abstract": "This research was a qualitative transcendental phenomenological exploration\nof astronomy identity formation among astronomy majors and physics majors\nengaged in astronomy research. Participants (N=10), all of whom identified with\ntraditionally marginalized groups in astronomy, were recruited from two large\nuniversities in New York State at different stages in their undergraduate\ncareers. Social cognitive career theory and the physics identity framework\nconceptually guided the analysis of astronomy identity for undergraduate majors\nand undergraduate astronomy researchers by exploring participants interest in,\nchoice to study, and persistence in astronomy. Themes related to astronomy\ninterest were popular culture and directly observing astronomical phenomena,\nwhile astronomy choice and persistence were facilitated by experiences in\nintroductory coursework, recognition from faculty, and socializing with peers.\nThe emergent astronomy identity framework was characterized by six distinct yet\ninterrelated constructs: 1) interest, typically rooted in observing naturally\noccurring phenomena and engaging with popular culture; 2) recognition from\npeers, experts, and families; 3) peer socialization; 4) competence; 5) sense of\nbelonging; and 6) astronomy career expectations. Implications from this\nresearch provide insights on factors that influence undergraduates in four-year\ncolleges to study astronomy, and how students' past experiences lead to a\nnatural interest in astronomy that may be fostered in secondary and\npost-secondary contexts. Findings suggest departments and institutions may\nfacilitate the accessibility of astronomy at the collegiate level by promoting\na more inclusive astronomy community, fostering interactions with astronomy\nfaculty and graduate students, providing opportunities for undergraduate\nresearch, and communicating expectancy for astronomy-related future careers.",
        "link": "http://arxiv.org/pdf/2410.00885v1"
    },
    {
        "title": "Status of VHE Astronomy c.2000",
        "year": "October 2000",
        "authors": "Trevor C. Weekes",
        "abstract": "The status of VHE Astronomy is reviewed",
        "link": "http://arxiv.org/pdf/astro-ph/0010431v1"
    },
    {
        "title": "Astronomy and astronomers in Jules Verne's novels",
        "year": "June 2009",
        "authors": "Jacques Crovisier",
        "abstract": "Almost all the \"Voyages Extraordinaires\" written by Jules Verne refer to\nastronomy. In some of them, astronomy is even the leading theme. However, Jules\nVerne was basically not learned in science. His knowledge of astronomy came\nfrom contemporaneous popular publications and discussions with specialists\namong his friends or his family. In this article, I examine, from the text and\nillustrations of his novels, how astronomy was perceived and conveyed by Jules\nVerne, with errors and limitations on the one hand, with great respect and\nenthusiasm on the other hand. This informs us on how astronomy was understood\nby an \"honn\\^ete homme\" in the late 19th century.",
        "link": "http://arxiv.org/pdf/0906.1052v1"
    },
    {
        "title": "Journey of X-ray astronomy: Indian perspectives",
        "year": "June 2024",
        "authors": "A R Rao",
        "abstract": "X-ray astronomy is a mature area of observational astronomy. After the\ndiscovery of the first non-solar X-ray source in 1962, X-ray astronomy\nproliferated during the Apollo era's space race. Then, it matured as an\nestablished area of research during the period of Great Observatories, and now\nit has become an indispensable tool to understand a wide variety of\nastrophysical phenomena. Consequently, in recent times, niche observational\nareas in X-ray astronomy have been explored, and attempts have been made to\nexpand the sensitivity of observations vastly. India was an active partner in\nthe growth of X-ray astronomy. In the initial years, India leveraged its\nexpertise in balloon technology to get significant results in the research area\nof hard X-ray astronomy. During the rapid growth phase of X-ray astronomy,\nIndia made divergent all-round efforts. Later on, however, the technical\nexpertise available in India was insufficient to compete with the highly\nsophisticated satellite experiments from around the world. During this phase,\nwork in X-ray astronomy continued in a few low-key experiments, eventually\nresulting in the launch of India's first multi-wavelength astronomical\nsatellite, AstroSat, in 2015. In this article, I will trace the journey of\nX-ray astronomy and the developments in the Indian context. I will also explore\nthe sociological aspects of the growth of X-ray astronomy, and, in the end, I\nwill present a speculative sketch of the future of X-ray astronomy with an\nemphasis on the Indian contribution.",
        "link": "http://arxiv.org/pdf/2407.00335v1"
    },
    {
        "title": "Conference Summary: Astronomy Perspective of Astro-Statistics",
        "year": "October 2006",
        "authors": "Ofer Lahav",
        "abstract": "This is a summary of the `Astronomy Perspective' of the 4th meeting on\n'Statistical Challenges in Modern Astronomy' held at Penn State University in\nJune 2006. We comment on trends in the Astronomy community towards Bayesian\nmethods and model selection criteria. We describe two examples where Bayesian\nmethods have improved our inference: (i) photometric redshift estimation (ii)\norbital parameters of extra-solar planets. We also comment on the pros and cons\nof Globalization of scientific research. Communities like Astronomy, High\nEnergy Physics and Statistics develop ideas separately, but also have frequent\ninteraction. This illustrates the benefits of 'comparing notes'.",
        "link": "http://arxiv.org/pdf/astro-ph/0610713v1"
    },
    {
        "title": "Birth and Early Development of Indian Astronomy",
        "year": "January 2001",
        "authors": "Subhash Kak",
        "abstract": "This paper provides an overview of the birth and early development of Indian\nastronomy. Taking account of significant new findings from archaeology and\nliterary analysis, it is shown that early mathematical astronomy arose in India\nin the second millennium BC. The paper reviews the astronomy of the period of\nthe Vedas, the Brahmanas, and the Vedanga Jyotisha. The origins of Puranic\ncosmology are also explained.",
        "link": "http://arxiv.org/pdf/physics/0101063v1"
    },
    {
        "title": "Fourth Time's a XARM",
        "year": "May 2018",
        "authors": "Poshak Gandhi",
        "abstract": "Arguably, no mission changed X-ray astronomy in as short a time as did\nHitomi. The planned X-ray Astronomy Recovery Mission, XARM, will carry its\nlegacy forward.",
        "link": "http://arxiv.org/pdf/1805.03681v1"
    },
    {
        "title": "Astrophotonics: the rise of integrated photonics in astronomy",
        "year": "September 2019",
        "authors": "Barnaby Norris, Joss Bland-Hawthorn",
        "abstract": "Astronomers have come to recognize the benefits of photonics, often in\ncombination with optical systems, in solving longstanding experimental problems\nin Earth-based astronomy. Here, we explore some of the recent advances made\npossible by integrated photonics. We also look to the future with a view to\nentirely new kinds of astronomy, particularly in an era of the extremely large\ntelescopes.",
        "link": "http://arxiv.org/pdf/1909.10688v1"
    },
    {
        "title": "From gamma-ray bursts to fast radio bursts",
        "year": "November 2018",
        "authors": "S. R. Kulkarni",
        "abstract": "The field of gamma-ray burst astronomy arguably went through three decades of\ngrowing pains before reaching maturity. What development lessons can be learned\nfor the adolescent field of fast radio burst astronomy?",
        "link": "http://arxiv.org/pdf/1811.00448v1"
    },
    {
        "title": "Predicting community college astronomy performance through logistic regression",
        "year": "April 2023",
        "authors": "Zachary Richards, Angela M. Kelly",
        "abstract": "The present study examined demographic and academic predictors of astronomy\nperformance of community college students enrolled in astronomy courses in a\nlarge suburban community college. The theoretical framework was based upon a\ndeconstructive approach for predicting community college performance whereby\nstudents academic pathways through higher education institutions are examined\nto understand their dynamic interaction with institutional integration and\nprogress towards academic goals. Transcript data analysis was employed to\nelicit student demographics and longitudinal academic coursework and\nperformance. A logistic regression model was generated to identify significant\npredictors of astronomy performance which included mathematics achievement\nenrollment in remedial mathematics and enrollment in multiple astronomy\ncourses. The results imply a greater focus on mathematics preparation and\nperformance may mediate astronomy outcomes for community college students.\nNotably demographic variables including ethnicity socioeconomic status gender\nand age were not significant predictors of astronomy performance in the\nmultivariable model suggesting the course is a potential gateway for\ndiversifying STEM access. Also astronomy interest as measured by enrollment in\nmultiple astronomy courses was related to performance. Further implications for\npractice are discussed.",
        "link": "http://arxiv.org/pdf/2304.09954v1"
    },
    {
        "title": "VHE Astronomy before the New Millenium",
        "year": "October 1999",
        "authors": "Trevor C. Weekes",
        "abstract": "A report on the observational status of VHE astronomy is given.",
        "link": "http://arxiv.org/pdf/astro-ph/9910394v1"
    },
    {
        "title": "Strategic Plan for Astronomy in the Netherlands 2011-2020",
        "year": "June 2012",
        "authors": "P. J. Groot, K. Kuijken, R. Stark",
        "abstract": "Strategic Plan for Astronomy in the Netherlands 2011 - 2020, written by the\nNetherlands Committee for Astronomy (NCA), on behalf of the excellence research\nschool in astronomy NOVA, (combining the university astronomy institutes of the\nuniversities of Amsterdam, Groningen, Leiden and Nijmegen), the NWO division of\nPhysical Sciences, the Netherlands Institute for Radio Astronomy ASTRON and the\nNetherlands Institute for Space Research SRON. The Strategic plan outlines the\nscientific priorities for Dutch astronomy in the next decade; the\ninstrumentation effort required to address these priorities, and the connection\nbetween astronomical instrumentation and technology development and fundamental\ntechnological R&D; the financial contours needed to realise the priorities; and\nthe role of Dutch astronomy in education and outreach. The Strategic Plan also\nincludes a retrospective on the achievements since the last Strategic Plan\n(2000) and a forward look beyond 2020.",
        "link": "http://arxiv.org/pdf/1206.5497v2"
    },
    {
        "title": "Book Review Interferometry and Synthesis in Radio Astronomy - 3rd Ed",
        "year": "August 2017",
        "authors": "Jacob Baars",
        "abstract": "Review of the third edition of \"Interferometry and Synthesis in Radio\nAstronomy\" by Thompson, Moran and Swenson",
        "link": "http://arxiv.org/pdf/1708.09761v1"
    },
    {
        "title": "Recommendations for Planning Inclusive Astronomy Conferences",
        "year": "July 2020",
        "authors": "Inclusive Astronomy 2 Local Organizing Committee, :, Brian Brooks, Keira Brooks, Lea Hagen, Nimish Hathi, Samantha Hoffman, James Paranilam, Laura Prichard",
        "abstract": "The Inclusive Astronomy (IA) conference series aims to create a safe space\nwhere community members can listen to the experiences of marginalized\nindividuals in astronomy, discuss actions being taken to address inequities,\nand give recommendations to the community for how to improve diversity, equity,\nand inclusion in astronomy. The first IA was held in Nashville, TN, USA, 17-19\nJune, 2015. The Inclusive Astronomy 2 (IA2) conference was held in Baltimore,\nMD, USA, 14-15 October, 2019. The Inclusive Astronomy 2 (IA2) Local Organizing\nCommittee (LOC) has put together a comprehensive document of recommendations\nfor planning future Inclusive Astronomy conferences based on feedback received\nand lessons learned. While these are specific to the IA series, many parts will\nbe applicable to other conferences as well. Please find the recommendations and\naccompanying letter to the community here:\nhttps://outerspace.stsci.edu/display/IA2/LOC+Recommendations.",
        "link": "http://arxiv.org/pdf/2007.10970v1"
    },
    {
        "title": "The future of astronomy with small satellites",
        "year": "November 2020",
        "authors": "Stephen Serjeant, Martin Elvis, Giovanna Tinetti",
        "abstract": "The number of small satellites has grown dramatically in the past decade from\ntens of satellites per year in the mid-2010s to a projection of tens of\nthousands in orbit by the mid-2020s. This presents both problems and\nopportunities for observational astronomy. Small satellites offer complementary\ncost-effective capabilities to both ground-based astronomy and larger space\nmissions. Compared to ground-based astronomy, these advantages are not just in\nthe accessibility of wavelength ranges where the Earth's atmosphere is opaque,\nbut also in stable, high precision photometry, long-term monitoring and\nimproved areal coverage. Astronomy has a long history of new observational\nparameter spaces leading to major discoveries. Here we discuss the potential\nfor small satellites to explore new parameter spaces in astrophysics, drawing\non examples from current and proposed missions, and spanning a wide range of\nscience goals from binary stars, exoplanets and solar system science to the\nearly Universe and fundamental physics.",
        "link": "http://arxiv.org/pdf/2011.03478v1"
    },
    {
        "title": "The history of the Russian study of Chinese astronomy",
        "year": "January 2021",
        "authors": "Galina Sinkevich",
        "abstract": "A short history of Russian researches in Chinese astronomy in 19-20 centuries",
        "link": "http://arxiv.org/pdf/2102.09996v1"
    },
    {
        "title": "The purpose of astronomy",
        "year": "June 1995",
        "authors": "Emmanuel Davoust",
        "abstract": "This is a presentation of the purpose of astronomy in the context of modern\nsociety. After exposing two misconceptions about astronomy, I detail its role\nin five domains, certified knowledge, incorporated abilities, innovations,\ncollective goods, and popular science; with each domain is associated an\ninstitution, an incentive, and a method of evaluation. Finally, I point out the\nrole of astronomy as a source of inspiration in other fields than science.",
        "link": "http://arxiv.org/pdf/astro-ph/9506122v1"
    },
    {
        "title": "Astronomy in Argentina",
        "year": "December 2012",
        "authors": "Hernán Muriel",
        "abstract": "This article analyses the current state of Astronomy in Argentina and\ndescribes its origins. We briefly describe the institutions where astronomical\nresearch takes place, the observational facilities available, the training of\nstaff and professionals, and the role of the institutions in scientific\npromotion. We also discuss the outreach of Astronomy towards the general\npublic, as well as amateur activities. The article ends with an analysis of the\nfuture prospects of astronomy in Argentina.",
        "link": "http://arxiv.org/pdf/1212.6407v1"
    },
    {
        "title": "Data as a Research Infrastructure - CDS, the Virtual Observatory, Astronomy, and beyond",
        "year": "March 2018",
        "authors": "Francoise Genova",
        "abstract": "The situation of data sharing in astronomy is positioned in the current\ngeneral context of a political push towards, and rapid development of,\nscientific data sharing. Data is already one of the major infrastructures of\nastronomy, thanks to the data and service providers and to the International\nVirtual Observatory Alliance (IVOA). Other disciplines are moving on in the\nsame direction. International organisations, in particular the Research Data\nAlliance (RDA), are developing building blocks and bridges to enable scientific\ndata sharing across borders. The liaisons between RDA and astronomy, and RDA\nactivities relevant to the librarian community, are discussed.",
        "link": "http://arxiv.org/pdf/1803.05842v1"
    }
]