[
    {
        "title": "Integrating Interpretable Machine Learning and Multi-omics Systems Biology for Personalized Biomarker Discovery and Drug Repurposing in Alzheimer’s Disease",
        "authors": "Mohammadsadeq Mottaqi, Pengyue Zhang, Lei Xie",
        "doi": "https://doi.org/10.1101/2025.03.24.644676",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.24.644676v1.full.pdf",
        "abstract": "Background Alzheimer’s disease (AD) is a complex neurodegenerative disorder with substantial molecular variability across different brain regions and individuals, hindering therapeutic development. This study introduces PRISM-ML, an interpretable machine learning (ML) framework integrating multiomics data to uncover patient-specific biomarkers, subtissue-level pathology, and drug repurposing opportunities. Methods We harmonized transcriptomic and genomic data of three independent brain studies containing 2105 post-mortem brain samples (1363 AD, 742 controls) across nine tissues. A Random Forest classifier with SHapley Additive exPlanations (SHAP) identified patient-level biomarkers. Clustering further delineated each tissue into subtissues, and network analysis revealed critical “bottleneck” (hub) genes. Finally, a knowledge graph-based screening identified multi-target drug candidates, and a real-world pharmacoepidemiologic study evaluated their clinical relevance. Results We uncovered 36 molecularly distinct subtissues, each defined by a set of associated unique biomarkers and genetic drivers. Through network analysis of gene-gene interactions networks, we highlighted 262 bottleneck genes enriched in synaptic, cytoskeletal, and membrane-associated processes. Knowledge graph queries identified six FDA-approved drugs predicted to target multiple bottleneck genes and AD-relevant pathways simultaneously. One candidate, promethazine, demonstrated an association with reduced AD incidence in a large healthcare dataset of over 364000 individuals (hazard ratios ≤ 0.43; p < 0.001). These findings underscore the potential for multi-target approaches, reveal connections between AD and cardiovascular pathways, and offer novel insights into the heterogeneous biology of AD. Conclusions PRISM-ML bridges interpretable ML with multi-omics and systems biology to decode AD heterogeneity, revealing region-specific mechanisms and repurposable therapeutics. The validation of promethazine in real-world data underscores the clinical relevance of multi-target strategies, paving the way for more personalized treatments in AD and other complex disorders.",
        "posted": "March 28, 2025"
    },
    {
        "title": "Sensitivity based model agnostic scalable explanations of deep learning",
        "authors": "Manu Aggarwal, NG Cogan, Vipul Periwal",
        "doi": "https://doi.org/10.1101/2025.02.21.639516",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.21.639516v2.full.pdf",
        "abstract": "Deep neural networks (DNNs) are powerful tools for data-driven predictive machine learning, but their complex architecture obscures mechanistic relations that they have learned from data. This information is critical to the scientific method of hypotheses development, experiment design, and model validation, especially when DNNs are used for biological and clinical predictions that affect human health. We design SensX, a model agnostic explainable AI (XAI) framework that outperformed current state-of-the-art XAI in accuracy (up to 52% higher) and computation time (up to 158 times faster), with higher consistency in all cases. It also determines an optimal subset of important input features, reducing dimensionality of further analyses. SensX scaled to explain vision transformer (ViT) models with more than 150, 000 features, which is computationally infeasible for current state-of-the-art XAI. SensX validated that ViT models learned justifiable features as important for different facial attributes of different human faces. SensX revealed biases inherent to the ViT architecture, an observation possible only when importance of each feature is explained. We trained DNNs to annotate biological cell types using single-cell RNA-seq data and SensX determined the sets of genes that the DNNs learned to be important to different cell types.",
        "posted": "March 07, 2025"
    },
    {
        "title": "Aerobicity stimulon in Escherichia coli revealed using multi-scale computational systems biology of adapted respiratory variants",
        "authors": "Arjun Patel, Neha Banwani, Raegan Mink, Divya M. Prabhakaran, Snehal V. Khairnar, Adam M. Feist, Bernhard O. Palsson, Amitesh Anand",
        "doi": "https://doi.org/10.1101/2025.03.13.642450",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.13.642450v1.full.pdf",
        "abstract": "Energy homeostasis facilitated by the interplay of substrate-level and oxidative phosphorylation is crucial for bacterial adaptation to diverse substrates and environments. To investigate how bioenergetic systems optimize under restrictive conditions, we evolved ETS variants with distinct proton-pumping efficiencies (1, 2, 3, or 4 proton(s) per electron) on succinate and glycerol. These substrates impose unique metabolic constraints: succinate requires complete gluconeogenesis, while glycerol supports mixed glycolytic and gluconeogenic fluxes. Multi-scale computational analysis of the strains revealed (a) Growth optimization across carbon substrates for multiple ETS variants, (b) A conserved aerobicity stimulon comprising seven independently regulated gene groups that are co-regulated with increasing aerobic capacities, (c) Proteome reallocation linked to aerobicity, validated using genome-scale metabolism and expression modeling, and (d) Carbon source-specific compensatory mutations in succinate transporters and regulatory elements. These findings define the aerobicity stimulon and establish a unifying framework for understanding bacterial respiratory flexibility, demonstrating how transcriptional networks and metabolic systems integrate to achieve energy homeostasis and bioenergetic resilience.",
        "posted": "March 15, 2025"
    }
]