[
    {
        "title": "Data-driven model discovery and model selection for noisy biological systems",
        "authors": "Xiaojun Wu, MeiLu McDermott, Adam L. MacLean",
        "doi": "https://doi.org/10.1101/2024.10.03.616508",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.03.616508v1.full.pdf",
        "abstract": "Biological systems exhibit complex dynamics that differential equations can often adeptly represent. Ordinary differential equation models are widespread; until recently their construction has required extensive prior knowledge of the system. Machine learning methods offer alternative means of model construction: differential equation models can be learnt from data via model discovery using sparse identification of nonlinear dynamics (SINDy). However, SINDy struggles with realistic levels of biological noise and does not incorporate prior knowledge of the system. We propose a data-driven framework for model discovery and model selection using hybrid dynamical systems: partial models containing missing terms. Neural networks are used to approximate the unknown dynamics of a system, enabling the denoising the data while simultaneously learning the latent dynamics. Simulations from the fitted neural network are then used to infer models using SINDy. We show, via model selection, that model discovery in SINDy with hybrid dynamical systems outperforms alternative approaches. We find it possible to infer models correctly up to high levels of biological noise of different types. We demonstrate the potential to learn models from sparse, noisy data in application to a canonical cell state transition using data derived from single-cell transcriptomics. Overall, this approach provides a practical framework for model discovery in biology in cases where data are noisy and sparse, of particular utility when the underlying biological mechanisms are partially but incompletely known.",
        "posted": "October 04, 2024"
    },
    {
        "title": "Multifunctional Systems in Synthetic Biology: Single-Stranded DNA Signaling for Precise Control of Gene Activation",
        "authors": "Brian Ng, Yuying Ding, Matthew Cornall, Ravinash Krishna Kumar, Yujia Qing, Hagan Bayley",
        "doi": "https://doi.org/10.1101/2024.10.20.619289",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.20.619289v1.full.pdf",
        "abstract": "Controllable gene circuits that respond to defined inputs are essential tools in synthetic biology. By leveraging regulatory mechanisms at either transcriptional or translational levels, synthetic responsive systems have been engineered to recognize diverse signals, such as small molecules (e.g., tetracycline) or physical stimuli (e.g., light). However, these approaches have limitations: small-molecule signals often require high concentrations to be effective, and sophisticated engineering is needed to generate responsive effectors. Here, we establish a simple, versatile gene activation system in which short single-stranded DNAs trigger RNA or protein production by complementing defective single-stranded promoters upstream of target genes. We demonstrate selective gene activation with orthogonal promoters, and logic-gate operations with signal pairs. The signaling system operates in compartmentalized nanoliter droplets scaffolded by bilayers. Signal delivery is controlled by selectively disrupting bilayers or applying transmembrane potential to move signals through protein pores, thereby activating genes within the receiver compartments. This work expands the toolset for engineering multifunctional, responsive materials to meet biotechnological and medical needs, enabling gene activation in response to specific cues.",
        "posted": "October 21, 2024"
    },
    {
        "title": "An integrative systems-biology approach defines mechanisms of Alzheimer’s disease neurodegeneration",
        "authors": "Matthew J Leventhal, Camila A Zanella, Byunguk Kang, Jiajie Peng, David Gritsch, Zhixiang Liao, Hassan Bukhari, Tao Wang, Ping-Chieh Pao, Serwah Danquah, Joseph Benetatos, Ralda Nehme, Samouil Farhi, Li-Huei Tsai, Xianjun Dong, Clemens R Scherzer, Mel B Feany, Ernest Fraenkel",
        "doi": "https://doi.org/10.1101/2024.03.17.585262",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.17.585262v2.full.pdf",
        "abstract": "Despite years of intense investigation, the mechanisms underlying neuronal death in Alzheimer’s disease, the most common neurodegenerative disorder, remain incompletely understood. To define relevant pathways, we integrated the results of an unbiased, genome-scale forward genetic screen for age-associated neurodegeneration in Drosophila with human and Drosophila Alzheimer’s disease-associated multi-omics. We measured proteomics, phosphoproteomics, and metabolomics in Drosophila models of Alzheimer’s disease and identified Alzheimer’s disease human genetic variants that modify expression in disease-vulnerable neurons. We used a network optimization approach to integrate these data with previously published Alzheimer’s disease multi-omic data. We computationally predicted and experimentally demonstrated how HNRNPA2B1 and MEPCE enhance tau-mediated neurotoxicity. Furthermore, we demonstrated that the screen hits CSNK2A1 and NOTCH1 regulate DNA damage in Drosophila and human iPSC-derived neural progenitor cells. Our work identifies candidate pathways that could be targeted to ameliorate neurodegeneration in Alzheimer’s disease.",
        "posted": "October 09, 2024"
    },
    {
        "title": "Disentangling the Roles of Distinct Cell Classes with Cell-Type Dynamical Systems",
        "authors": "Aditi Jha, Diksha Gupta, Carlos D. Brody, Jonathan W. Pillow",
        "doi": "https://doi.org/10.1101/2024.07.08.602520",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.07.08.602520v2.full.pdf",
        "abstract": "Latent dynamical systems have been widely used to characterize the dynamics of neural population activity in the brain. However, these models typically ignore the fact that the brain contains multiple cell types. This limits their ability to capture the functional roles of distinct cell classes, and to predict the effects of cell-specific perturbations on neural activity or behavior. To overcome these limitations, we introduce the “cell-type dynamical systems” (CTDS) model. This model extends latent linear dynamical systems to contain distinct latent variables for each cell class, with biologically inspired constraints on both dynamics and emissions. To illustrate our approach, we consider neural recordings with distinct excitatory (E) and inhibitory (I) populations. The CTDS model defines separate latents for both cell types, and constrains the dynamics so that E (I) latents have a strictly positive (negative) effects on other latents. We applied CTDS to recordings from rat frontal orienting fields (FOF) and anterior dorsal striatum (ADS) during an auditory decision-making task. The model achieved higher accuracy than a standard linear dynamical system (LDS), and revealed that the animal’s choice can be decoded from both E and I latents and thus is not restricted to a single cell-class. We also performed in-silico optogenetic perturbation experiments in the FOF and ADS, and found that CTDS was able to replicate the experimentally observed effects of different perturbations on behavior, whereas a standard LDS model—which does not differentiate between cell types—did not. Crucially, our model allowed us to understand the effects of these perturbations by revealing the dynamics of different cell-specific latents. Finally, CTDS can also be used to identify cell types for neurons whose class labels are unknown in electrophysiological recordings. These results illustrate the power of the CTDS model to provide more accurate and more biologically interpretable descriptions of neural population dynamics and their relationship to behavior.",
        "posted": "November 05, 2024"
    },
    {
        "title": "A Machine Learning Model of Perturb-Seq Data for Use in Space Flight Gene Expression Profile Analysis",
        "authors": "Liam Johnson, James Casaletto, Sylvain Costes, Caitlin Proctor, Lauren Sanders",
        "doi": "https://doi.org/10.1101/2024.11.28.625741",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.28.625741v1.full.pdf",
        "abstract": "The genetic perturbations caused by spaceflight on biological systems tend to have a system-wide effect which is often difficult to deconvolute into individual signals with specific points of origin. Single cell multi-omic data can provide a profile of the perturbational effects but does not necessarily indicate the initial point of interference within a network. The objective of this project is to take advantage of large scale and genome-wide perturbational or Perturb-Seq datasets by using them to pre-train a generalist machine learning model that is capable of predicting the effects of unseen perturbations in new data. Perturb-Seq datasets are large libraries of single cell RNA sequencing data collected from CRISPR knock out screens in cell culture. The advent of generative machine learning algorithms, particularly transformers, make it an ideal time to re-assess large scale data libraries in order to grasp cell and even organism-wide genomic expression motifs. By tailoring an algorithm to learn the downstream effects of the genetic perturbations, we present a pre-trained generalist model capable of predicting the effects of multiple perturbations in combination, locating points of origin for perturbation in new datasets, predicting the effects of known perturbations in new datasets, and annotation of large-scale network motifs. We demonstrate the utility of this model by identifying key perturbational signatures in RNA sequencing data from spaceflown biological samples from the NASA Open Science Data Repository.",
        "posted": "November 29, 2024"
    },
    {
        "title": "Annotating CryoET Volumes: A Machine Learning Challenge",
        "authors": "Ariana Peck, Yue Yu, Jonathan Schwartz, Anchi Cheng, Utz Heinrich Ermel, Saugat Kandel, Dari Kimanius, Elizabeth Montabana, Daniel Serwas, Hannah Siems, Feng Wang, Zhuowen Zhao, Shawn Zheng, Matthias Haury, David Agard, Clinton Potter, Bridget Carragher, Kyle Harrington, Mohammadreza Paraan",
        "doi": "https://doi.org/10.1101/2024.11.04.621686",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.04.621686v2.full.pdf",
        "abstract": "Cryo-electron tomography (cryoET) has emerged as a powerful structural biology tool for understanding protein complexes in their native cellular environments. Presently, 3D volumes of cellular environments can be acquired in the thousands in a few days where each volume provides a rich and complex cellular landscape. Despite numerous innovations, localizing and identifying the vast majority of protein species in these volumes remains prohibitively difficult. Machine learning based methods provide an opportunity to automate the process of labeling and annotating cryoET volumes. Due to current bottlenecks in the annotation process, and a lack of large standardized datasets, training datasets for machine learning algorithms have been scarce. Here, we present a defined “phantom” sample, along with “ground truth” annotations, that will be the basis of a machine learning challenge to bring cryoET and ML experts together and spur creativity to address this annotation problem. We have also set up a cryoET data portal that provides additional diverse sets of annotated 3D volumes from cryoET experts across the world for the machine learning challenge.",
        "posted": "November 21, 2024"
    }
]