[
    {
        "title": "Sensitivity based model agnostic scalable explanations of deep learning",
        "authors": "Manu Aggarwal, NG Cogan, Vipul Periwal",
        "doi": "https://doi.org/10.1101/2025.02.21.639516",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.21.639516v2.full.pdf",
        "abstract": "Deep neural networks (DNNs) are powerful tools for data-driven predictive machine learning, but their complex architecture obscures mechanistic relations that they have learned from data. This information is critical to the scientific method of hypotheses development, experiment design, and model validation, especially when DNNs are used for biological and clinical predictions that affect human health. We design SensX, a model agnostic explainable AI (XAI) framework that outperformed current state-of-the-art XAI in accuracy (up to 52% higher) and computation time (up to 158 times faster), with higher consistency in all cases. It also determines an optimal subset of important input features, reducing dimensionality of further analyses. SensX scaled to explain vision transformer (ViT) models with more than 150, 000 features, which is computationally infeasible for current state-of-the-art XAI. SensX validated that ViT models learned justifiable features as important for different facial attributes of different human faces. SensX revealed biases inherent to the ViT architecture, an observation possible only when importance of each feature is explained. We trained DNNs to annotate biological cell types using single-cell RNA-seq data and SensX determined the sets of genes that the DNNs learned to be important to different cell types.",
        "posted": "March 07, 2025"
    },
    {
        "title": "Dual process impairments in reinforcement learning and working memory systems underlie learning deficits in physiological anxiety",
        "authors": "Jennifer Senta, Sonia Bishop, Anne GE Collins",
        "doi": "https://doi.org/10.1101/2025.02.14.638024",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.14.638024v1.full.pdf",
        "abstract": "Anxiety has been robustly linked to deficits in frontal executive function including working memory (WM) and attentional control processes. However, although anxiety has also been associated with impaired performance on learning tasks, computational investigations of reinforcement learning (RL) impairment in anxiety have yielded mixed results. WM processes are known to contribute to learning behavior in parallel to RL processes and to modulate the effective learning rate as a function of load. However, WM processes have typically not been modeled in investigations of anxiety and RL. In the current study, we leveraged an experimental paradigm (RLWM) which manipulates the relative contributions of WM and RL processes in a reinforcement learning and retention task using multiple stimulus set sizes. Using a computational model of interactive RL and WM processes, we investigated whether individual differences in physiological or cognitive anxiety impacted task performance via deficits in RL or WM. Elevated physiological, but not cognitive, anxiety scores were strongly associated with worse performance during learning and retention testing across all set sizes. Computationally, higher physiological anxiety scores were significantly related to reduced learning rate and increased rate of WM decay. To highlight the importance of modeling WM contributions to learning, we considered the effect of fitting RL models without WM modules to the data. Here we found that reduced learning performance for higher physiological anxiety was at least partially misattributed to stochastic decision noise in 9 out of 10 RL-only models considered. These findings reveal a dual-process impairment in learning in anxiety that is linked to a more physiological than cognitive anxiety phenotype. More broadly, this work also points to the importance of accounting for the contribution of WM to RL when investigating psychopathology-related deficits in learning.",
        "posted": "February 14, 2025"
    },
    {
        "title": "Evolutionary trends in Bombella apis CRISPR-Cas systems",
        "authors": "Carrie L Ganote, Lílian Caesar, Danny W Rice, Rachel J Whitaker, Irene LG Newton",
        "doi": "https://doi.org/10.1101/2025.02.05.636693",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.05.636693v1.full.pdf",
        "abstract": "Bacteria and archaea employ a rudimentary immune system, CRISPR-Cas, to protect against foreign genetic elements such as bacteriophage. CRISPR-Cas systems are found in Bombella apis, a microbe associated with honey bee queens, brood, and royal jelly. Unlike other honey bee microbiome members, B. apis does not colonize the worker bee midgut or hindgut and has therefore been understudied with regards to its importance in the honey bee colony. However, B. apis appears to play beneficial roles in the colony, by protecting developing brood from fungal pathogens and by bolstering their development under nutritional stress. Previously we identified CRISPR-Cas systems as being acquired by B. apis in its transition to bee association, as they are absent in a sister clade. Here we assess the variation and distribution of CRISPR-Cas types across B. apis strains. We found multiple CRISPR-Cas types, some of which have multiple arrays, within the same B. apis genomes and also in the honey bee queen gut metagenomes. We analyzed the spacers between strains to identify the history of mobile element interaction for each B. apis strain. Finally, we predict interactions between viral sequences and CRISPR systems from different honey bee microbiome members. Our analyses show that the B. apis CRISPR-Cas systems are dynamic, that microbes in the same niche have unique spacers which supports the functionality of these CRISPR-Cas systems, and that acquisition of new spacers may be occurring in multiple locations in the genome, allowing for a flexible antiviral arsenal for the microbe. IMPORTANCE Honey bee worker gut microbes have been implicated in everything from protection from pathogens to breakdown of complex polysaccharides in the diet. However, there are multiple niches within a honey bee colony that host a different group of microbes, including the acetic acid bacterium Bombella apis. B. apis is found in the colony food stores, in association with brood, in worker hypopharyngeal glands, and in the queen digestive tract. The roles that B. apis may serve in these environments are just beginning to be discovered and include production of a potent antifungal that protects developing bees and supplementation of dietary lysine to young larvae, bol-stering their nutrition. Niche specificity in B. apis may be affected by the pressures of bacteriophage and other mobile elements which may target different strains in each specific bee environment. Studying the interplay between B. apis and its mobile genetic elements (MGEs) may help us better understand microbial community dynamics within the colony and the potential ramifications for the honey bee host.",
        "posted": "February 07, 2025"
    },
    {
        "title": "Aerobicity stimulon in Escherichia coli revealed using multi-scale computational systems biology of adapted respiratory variants",
        "authors": "Arjun Patel, Neha Banwani, Raegan Mink, Divya M. Prabhakaran, Snehal V. Khairnar, Adam M. Feist, Bernhard O. Palsson, Amitesh Anand",
        "doi": "https://doi.org/10.1101/2025.03.13.642450",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.13.642450v1.full.pdf",
        "abstract": "Energy homeostasis facilitated by the interplay of substrate-level and oxidative phosphorylation is crucial for bacterial adaptation to diverse substrates and environments. To investigate how bioenergetic systems optimize under restrictive conditions, we evolved ETS variants with distinct proton-pumping efficiencies (1, 2, 3, or 4 proton(s) per electron) on succinate and glycerol. These substrates impose unique metabolic constraints: succinate requires complete gluconeogenesis, while glycerol supports mixed glycolytic and gluconeogenic fluxes. Multi-scale computational analysis of the strains revealed (a) Growth optimization across carbon substrates for multiple ETS variants, (b) A conserved aerobicity stimulon comprising seven independently regulated gene groups that are co-regulated with increasing aerobic capacities, (c) Proteome reallocation linked to aerobicity, validated using genome-scale metabolism and expression modeling, and (d) Carbon source-specific compensatory mutations in succinate transporters and regulatory elements. These findings define the aerobicity stimulon and establish a unifying framework for understanding bacterial respiratory flexibility, demonstrating how transcriptional networks and metabolic systems integrate to achieve energy homeostasis and bioenergetic resilience.",
        "posted": "March 15, 2025"
    },
    {
        "title": "A Population Model Reveals Surprising Role of Stochastic Cell Division in Epigenetic Memory Systems",
        "authors": "Viviane Klingel, Dimitri Graf, Sara Weirich, Albert Jeltsch, Nicole E. Radde",
        "doi": "https://doi.org/10.1101/2025.03.17.643620",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.17.643620v1.full.pdf",
        "abstract": "Epigenetic memory systems can store transient environmental signals in bacteria in form of DNA methylation patterns. A synthetic zinc finger protein (ZnF4) binds to the DNA in a methylation-dependent manner and represses the expression of the DNA methyltransferase CcrM. The ON-state of these systems is characterized by high CcrM expression, high methylation levels, and low ZnF4 binding, but the mechanisms ensuring long-term ON-state stability remain unclear. Measurements showed a gradual shift of cell populations from ON to OFF starting after about four days of cultivation. We use a hybrid modeling approach integrating flow-cytometry data and bulk methylation measurements to test the hypothesis that stochastic cell division is a key factor in this transition. Interestingly, model parameters cluster into two groups with opposite effects of cell division rates on ON-state stability. Experiments under varying growth conditions show that faster cell division increases memory stability — an initially unexpected result. Model simulations provide a potential explanation for this observation and deepen our understanding about the mechanisms and timing of the ON/OFF switch in individual cells.",
        "posted": "March 20, 2025"
    },
    {
        "title": "Mapping energy metabolism systems in the human brain",
        "authors": "Moohebat Pourmajidian, Justine Y. Hansen, Golia Shafiei, Bratislav Misic, Alain Dagher",
        "doi": "https://doi.org/10.1101/2025.03.17.643763",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.17.643763v1.full.pdf",
        "abstract": "Energy metabolism involves a network of biochemical reactions that generate ATP, utilizing substrates such as glucose and oxygen supplied via cerebral blood flow. Energy substrates are metabolized in multiple interrelated pathways that are cell- and organelle-specific. These pathways not only generate energy but are also fundamental to the production of essential biomolecules required for neuronal function and survival. How these complex biochemical processes are distributed over the cortex is integral to understanding the structure and function of the brain. Here, using curated gene sets and whole-brain transcriptomics, we generate maps of five fundamental energy metabolic pathways: glycolysis, pentose phosphate pathway, tricarboxylic acid cycle, oxidative phosphorylation and lactate metabolism. We find consistent divergence between primarily energy-producing pathways and anabolic pathways, particularly in unimodal sensory cortices. We then explore the spatial alignment of these maps with multi-scale structural and functional attributes, including metabolic uptake, neurophysiological oscillations, cell type composition, laminar organization and macro-scale connectivity. Finally, we show that metabolic pathways exhibit unique developmental trajectories from the fetal stage to adulthood. The primary energy-producing pathways peak in late childhood, while the anabolic pentose phosphate pathway shows pronounced expression in the fetal stage and declines throughout life. Together, these results highlight the rich biochemical complexity of energy metabolism organization in the brain.",
        "posted": "March 17, 2025"
    },
    {
        "title": "StACKER, A TOOL FOR SYSTEMS LEVEL ANALYSIS OF BASE STACKING IN NUCLEOTIDE-RICH STRUCTURES",
        "authors": "Eric D. Sakkas, Daniel Krizanc, Kelly M. Thayer, Michael P. Weir",
        "doi": "https://doi.org/10.1101/2025.04.13.648419",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.04.13.648419v1.full.pdf",
        "abstract": "Nucleic acid macromolecules can undergo significant structural changes—often mediated by nucleotide modification or molecular interactions. These alterations can be critical to their function. An ongoing challenge is to develop useful tools to quantify system-wide changes in nucleic acid-rich structures. We introduce StACKER, a robust Python package for observing conformational changes in a nucleic acid structure through its pi-stacking of base rings. StACKER creates System Stacking Fingerprints (SSFs) which highlight the landscape of pi-stacking throughout a molecule and can be used to show widespread conformational adjustments. Additionally, StACKER’s Pairwise Stacking Fingerprint (PSF) can further characterize pi-stacking in a select residue pair, showing how the effects of localized residue changes spread through a nucleic acid system. We apply StACKER to molecular dynamics (MD) simulations of a subsystem of the ribosome to reveal that alternative codons at the ribosome A-site and 3’ adjacent +1 codon position induce allosteric structure changes in the decoding center neighborhood, leading to a toggle between two conformational states. Through previous analysis of ribosome profiling data, we link these states to an observed fast/slow translation phenotype (Sun et al. 2024). We benchmark StACKER alongside other lenses for observing allostery to demonstrate its use in assessing allosteric shifts and its relevance to future structure-to-function studies.",
        "posted": "April 18, 2025"
    },
    {
        "title": "Characterization and orthogonality assessment of two quorum sensing systems for synthetic biology applications",
        "authors": "De Baets Jasmine, De Paepe Brecht, De Mey Marjan",
        "doi": "https://doi.org/10.1101/2025.04.03.643276",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.04.03.643276v1.full.pdf",
        "abstract": "Quorum sensing systems have a broad range of applications within the field of synthetic biology. However, a bottleneck is the optimization and tuning of these systems due to the lack of standardization and complete characterization. In this research, two quorum sensing systems, namely the LasI/LasR and the EsaI/EsaR system, were fully characterized in the model host organism Escherichia coli. Furthermore, insight was gained in the interplay between the various parts of these systems. To further expand the range of possibilities with these quorum sensing systems, the orthogonality of the two systems was assessed to allow simultaneous use within the same cell without interfering crosstalk. This assessment was performed on three levels: promoter, signal and synthase crosstalk. It was demonstrated that LasR is able to interact with the promoter of the EsaI/EsaR system, albeit to a low extent. Additionally, LasR was able to respond to the autoinducers produced by EsaI. To solve the promoter crosstalk, a nucleotide change was introduced into the binding site of EsaR within the promoter region. Additionally, LasR mutants were created rationally and screened for decreased response to EsaI while retaining functionality. The best performing mutant, LasR(P117S), was further characterized. In conclusion, we have further unlocked the potential of quorum sensing systems for synthetic biology applications by obtaining two functional, characterized and orthogonal quorum sensing systems. – Characterization of two LuxR-type quorum sensing systems – Assessing the orthogonality of the EsaI/EsaR and LasI/LasR quorum sensing system – Eliminating the crosstalk between the EsaI/EsaR and LasI/LasR quorum sensing system",
        "posted": "April 03, 2025"
    },
    {
        "title": "A systems biology investigation to identify potential biomarkers in leprosy-affected host cells",
        "authors": "Shomeek Chowdhury, Afzal Ansari, Pranshi Verma, Anuj Mavlankar, Anjali Tripathi, Maria Pena, Rahul Sharma, John Caskey, Richard Truman, Pushpendra Singh",
        "doi": "https://doi.org/10.1101/2025.03.28.646010",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.28.646010v1.full.pdf",
        "abstract": "M. leprae adapts to the host cell environment and disrupts protein-protein interactions inside the host cell for its own survival and proliferation. This study is attempts to comprehend these host-pathogen interactions at the systems level. We utilised RNA-Seq data set of leprosy-resistant and leprosy-susceptible armadillos and investigated how five different human signaling pathways get hijacked by M. leprae. We also identified the corresponding human homolog proteins. By applying graph theory on these protein networks, we predicted 25 proteins which play important role in these pathways related to leprosy pathogenesis and/progression. The study is also supported by wet lab experiments identifying 69 proteins in armadillos upon leprosy progression after experimental infection which get differentially expressed. Our study found that 69.5% of these experimentally identified proteins are part of either M. leprae-affected signaling pathways or possibly contribute to leprosy pathogenesis based on their GO terms. This study identified three human proteins: LC3-II, PI3K and IDO1 which have been implicated in M. leprae pathogenesis in other studies also leprosy patients. Thus, upon further experimentally validation, such markers can be potentially useful to diagnose leprosy in patients at an early stage .",
        "posted": "April 02, 2025"
    },
    {
        "title": "Systems biology analysis of vasodynamics in mouse cerebral arterioles during resting state and functional hyperemia",
        "authors": "Hadi Esfandi, Mahshad Javidan, Eric R. McGregor, Rozalyn M. Anderson, Ramin Pashaie",
        "doi": "https://doi.org/10.1101/2025.05.06.652356",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.05.06.652356v1.full.pdf",
        "abstract": "Cerebral hemodynamics is tightly regulated by arteriolar vasodynamics. In this study, a systems biology approach was employed to investigate how the interplay between passive, myogenic, neurogenic, and astrocytic responses shapes arteriolar vasodynamics in small rodents. A model of neurovascular coupling is proposed in which neurons inhibit and dampen the myogenic response to promote vasodilation during activation, and facilitate the myogenic response to promote rapid vasoconstriction immediately post-activation. In this model, inhibition of the myogenic response is mediated by the hyperpolarization of smooth muscle and endothelial cells. Dampening and facilitation of the response are mediated by neuronal production of nitric oxide and release of neuropeptide Y, respectively. We also introduce a model for gliovascular coupling, in which astrocytes periodically inhibit the myogenic response upon detecting an increase in myogenic activity through interactions between their endfeet and arterioles. Our study revealed that in the resting state, the interplay between the delayed myogenic response and passive distension, acting as negative and positive feedbacks respectively, generates undamped oscillations in vessel diameter, known as vasomotion. In the active state, these oscillations are disrupted by the neurogenic and astrocytic responses. The biophysical model of arteriolar vasodynamics presented in this study lays the foundation for quantitative analysis of cerebral hemodynamics for cerebrovascular health diagnostics and hemodynamic neuroimaging. Author summary Cerebral hemodynamic imaging is widely used to investigate brain function in-vivo. These signals are primarily shaped by arteriolar vasodynamics, which result from a combination of physiological processes mediated by multiple interacting cell types. A biophysical model of this dynamics offers a valuable computational framework for achieving more accurate and quantitative interpretation of hemodynamic signals. In this study, I applied a computational biology approach to incorporate several well-established cellular signaling pathways into a unified model, which was used to investigate system-level arteriolar behavior and identify missing or less understood mechanisms involved in cerebral blood flow regulation. Our results show that arteriolar vasodynamics is not solely driven by neurogenic responses; astrocytic response and hemo-vascular interactions also play important roles in shaping the observed dynamics. The model also provided a means to explore how in-silico analysis of hemodynamic signals can reveal potential cellular-level impairments that manifest as system-level changes in cerebral hemodynamics. Incorporating our proposed biophysical model into cerebral hemodynamic analysis can improve the fidelity of hemodynamic imaging—enabling more accurate inference of regional neuronal and astrocytic activity from hemodynamic signals, and enhancing our ability to diagnose cerebrovascular pathologies.",
        "posted": "May 10, 2025"
    },
    {
        "title": "PyCycleBio: modelling non-sinusoidal-oscillator systems in temporal biology",
        "authors": "Alexander R. Bennett, George Birchenough, Daniel Bojar",
        "doi": "https://doi.org/10.1101/2025.04.30.651403",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.04.30.651403v1.full.pdf",
        "abstract": "Protein, mRNA, and metabolite abundances can exhibit rhythmic dynamics, such as during the day/night cycle. Leading bioinformatics platforms for identifying biological rhythms often utilise single-component models of the harmonic oscillator equation, or multi-component models based upon the Cosinor framework. These approaches offer distinct advantages: modelling either temporally-resolved regulatory behaviour via the extended harmonic oscillator equation, or complex rhythmic patterns in the case of Cosinor. Here, we have developed a new platform to combine the advantages of these two approaches. PyCycleBio utilises bounded-multi-component models and modulus operators alongside the harmonic oscillator equation, to model a diverse and interpretable array of rhythmic behaviours, including the regulation of temporal dynamics via amplitude coefficients. We demonstrate increased sensitivity and functionality of PyCycleBio compared to other analytical frameworks, and uncover new relationships between data modalities or sampling conditions with the qualities of rhythmic behaviours from biological datasets— including transcriptomics, proteomics, and metabolomics. We envision that this new approach for disentangling complicated temporal regulation of biomolecules will advance chronobiology and our understanding of physiology. PyCycleBio is available at: https://github.com/Glycocalex/PyCycleBio, and the Python package is available to install at: https://pypi.org/project/pycyclebio/. PyCycleBio can also be used at https://colab.research.google.com/github/Glycocalex/PyCycleBio/blob/main/PyCycleBio.ipynb with no installations necessary.",
        "posted": "May 05, 2025"
    },
    {
        "title": "A systems-level machine learning approach uncovers therapeutic targets in clear cell renal cell carcinoma",
        "authors": "Silas Ruhrberg Estévez, Greta Baltusyte, Gehad Youssef, Namshik Han",
        "doi": "https://doi.org/10.1101/2025.05.26.656158",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.05.26.656158v1.full.pdf",
        "abstract": "We present a generalisable, interpretable machine learning framework for therapeutic target discovery using single-cell transcriptomics, protein interaction networks, and drug proximity analysis. The pipeline integrates feature selection via gradient boosting classifiers, systems-level network inference, and in silico drug repurposing, enabling the identification of actionable targets with cellular specificity. As a proof of concept, we apply the method to clear cell renal cell carcinoma (ccRCC), an aggressive kidney cancer with limited treatment options. The model identifies 96 tumour-intrinsic genes, refines them to 16 targets through CRISPR screens and biological curation, and prioritises FDA-approved compounds via network-based proximity scoring. Several novel therapeutic mechanisms - including ABL1, CDK4/6, and JAK inhibition - emerge from this analysis, with predicted compounds showing superior efficacy to standard-of-care drugs across multiple ccRCC cell lines. Beyond ccRCC, this framework offers a scalable strategy for drug discovery across diverse diseases, combining machine learning interpretability with systems biology to accelerate therapeutic development.",
        "posted": "May 29, 2025"
    },
    {
        "title": "Data-driven identification of biomedical systems using multi-scale analysis",
        "authors": "Ismaila Muhammed, Dimitris M. Manias, Dimitris A. Goussis, Haralampos Hatzikirou",
        "doi": "https://doi.org/10.1101/2025.06.05.657989",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.06.05.657989v1.full.pdf",
        "abstract": "Biomedical systems inherently exhibit multi-scale dynamics, making accurate system identification particularly challenging due to the complexity of capturing a wide time scale spectrum. Traditional methods capable of addressing this issue rely on explicit equations, limiting their applicability in cases where only observational data are available. To overcome this limitation, we propose a data-driven framework that integrates the Sparse Identification of Nonlinear Dynamics (SINDy) method, the multi scale analysis algorithm Computational Singular Perturbation (CSP) and neural networks (NNs). This framework allows the partition of the available dataset in subsets characterized by similar dynamics, so that system identification can proceed within these subsets without facing a wide time scale spectrum. Accordingly, when the full dataset does not allow SINDy to identify the proper model, CSP is employed for the generation of subsets of similar dynamics, which are then fed into SINDy. CSP requires the availability of the gradient of the vector field, which is estimated by the NNs. The framework is tested on the Michaelis-Menten model, for which various reduced models in analytic form exist at different parts of the phase space. It is demonstrated that the CSP-based data subsets allow SINDy to identify the proper reduced model in cases where the full dataset does not. In addition, it is demonstrated that the framework succeeds even in the cases where the available data set originates from stochastic versions of the Michaelis-Menten model. This framework is algorithmic, so system identification is not hindered by the dimensions of the dataset. Author summary Biomedical systems often evolve across multiple time scales, posing major challenges for constructing accurate models directly from data. Traditional model reduction techniques require explicit equations and thus cannot be applied when only observational data are available. To address this, we developed a data-driven framework that combines Sparse Identification of Nonlinear Dynamics (SINDy), Computational Singular Perturbation (CSP) and neural networks (NNs). Our approach automatically partitions a dataset into subsets characterized by similar dynamics, allowing valid reduced models to be identified in each region. When SINDy fails to recover a global model from the full dataset, CSP -leveraging Jacobian estimates from NNs-successfully isolates dynamical regimes where SINDy can be applied locally. We validated this framework using the Michaelis-Menten biochemical model, which is known to admit multiple reduced models in different regions of the phase space. Our method consistently identified the appropriate reduced dynamics, even when the data originated from stochastic simulations. Because our approach is algorithmic and equation-free, it is scalable to high-dimensional systems and robust to noise, offering a promising solution for data-driven model discovery in complex biomedical systems.",
        "posted": "June 09, 2025"
    },
    {
        "title": "Amendable decisions in living systems",
        "authors": "Izaak Neri, Simone Pigolotti",
        "doi": "https://doi.org/10.1101/2025.06.03.657747",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.06.03.657747v1.full.pdf",
        "abstract": "A distinct feature of living systems is their capacity to take decisions based on uncertain environmental signals. Examples span from the microscopic scale of cells differentiating based on the concentration of a morphogene, to the macroscopic scale of decisions by animals or human beings. The current paradigm in decision theory is based on the assumption that decisions, once taken, cannot be revoked. However, living systems often amend their decisions if accumulated evidence favors an alternative hypothesis. In this paper, we develop a theory for amendable decision making in living systems. We find that, in contrast with irrevocable decisions, optimal amendable decisions can be taken in a finite average time at zero error probability. Our theory successfully predicts the outcome of a visual experiment involving human participants and the accuracy of cell-fate decisions in early development. These case studies demonstrate the broad applicability of the amendable decision paradigm in biology.",
        "posted": "June 06, 2025"
    },
    {
        "title": "A systems biology approach to evaluate potential probiotic candidates for women’s vaginal health",
        "authors": "Emma M. Glass, Glynis L. Kolling, Jason A. Papin",
        "doi": "https://doi.org/10.1101/2025.06.16.659967",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.06.16.659967v1.full.pdf",
        "abstract": "Probiotic supplements are marketed for diverse health benefits, yet species inclusion often lacks functional rationale. We surveyed 352 U.S. probiotic products and found 36 unique microbial species, with most supplements containing only one species and no clear link between species and intended health benefit. To evaluate probiotic function, we developed CoPaPro, a collection of 1,012 genome-scale metabolic models spanning commensal, pathogenic, and probiotic bacteria. Flux balance analysis revealed that current probiotic species fail to capture the metabolic diversity of native commensals. Focusing on vaginal health, we identified commensals with metabolic profiles overlapping Gardnerella vaginalis, a key pathobiont. In vitro spent media assays using 11 vaginal isolates showed variable inhibition of G. vaginalis, primarily driven by D-lactic acid production rather than metabolic similarity. Several non-Lactobacillus species produced inhibitory levels of D-lactate. These findings highlight the need for function-based probiotic design and demonstrate a scalable framework integrating metabolic modeling with experimental validation.",
        "posted": "June 21, 2025"
    },
    {
        "title": "Selecting Synthetic Data for Successful Simulation-Based Transfer Learning in Dynamical Biological Systems",
        "authors": "Simon Witzke, Julian Zabbarov, Maximilian Kleissl, Pascal Iversen, Bernhard Y. Renard, Katharina Baum",
        "doi": "https://doi.org/10.1101/2024.03.25.586390",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.25.586390v2.full.pdf",
        "abstract": "Background Accurate prediction of the temporal dynamics of biological systems is crucial for informing timely and effective interventions, e.g., in ecological or epidemiological contexts, or for treatment adjustments in therapy. While machine learning has proven its capabilities in generalizing the underlying non-linear dynamics of such systems, unlocking its predictive power is often restrained by the limited availability of large, curated datasets. To supplement real-world data, informing machine learning by transfer learning with synthetic data derived from simulations using ordinary differential equations has emerged as a promising solution. However, the success of this approach highly depends on the designed characteristics of the synthetic data. Results We suggest scrutinizing these characteristics, such as size, diversity, and noise, of ordinary differential equation-based synthetic time series datasets. Here, we demonstrate how to systematically evaluate the influence of such design choices on transfer learning performance. We conduct a proof-of-concept study on three simple, but widely used systems and four real-world datasets. We find a strong interdependency between synthetic dataset size and diversity effects. Good transfer learning settings heavily rely on real-world data characteristics as well as the data’s coherence with the dynamics of the model underlying the synthetic data. We achieve a performance improvement of up to 92% in mean absolute error for simulation-based transfer learning compared to non-informed deep learning. Conclusions Our work emphasizes the relevance of carefully selecting properties of synthetic data for leveraging the valuable domain knowledge contained in ordinary differential equation models for machine-learning based predictions. The code is available at https://github.com/DILiS-lab/opt-synthdata-4tl.",
        "posted": "July 09, 2025"
    },
    {
        "title": "Convergent neural dynamical systems for task control in artificial networks and human brains",
        "authors": "Harrison Ritz, Aditi Jha, Nathaniel D. Daw, Jonathan D. Cohen",
        "doi": "https://doi.org/10.1101/2024.09.29.615736",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.29.615736v5.full.pdf",
        "abstract": "The ability to switch between tasks is a core component of human intelligence, yet a mechanistic understanding of this capacity has remained elusive. Long-standing debates over how task switching is influenced by preparation for upcoming tasks or interference from previous tasks have been difficult to resolve without quantitative neural predictions. We advance this debate by using state-space modeling to directly compare the latent task dynamics in task-optimized recurrent neural networks and human electroencephalographic recordings. Over the inter-trial interval, both networks and brains converged into a neutral task state, a novel control strategy that reconciles the role of preparation and interference in task switching. These findings provide a quantitative account of cognitive flexibility and a promising paradigm for bridging artificial and biological neural networks.",
        "posted": "July 24, 2025"
    },
    {
        "title": "Cahn-Hilliard dynamical models for condensed biomolecular systems",
        "authors": "Sarah M. Groves, Min-Jhe Lu, Astrid Catalina Alvarez-Yela, Monserrat Gerardo-Ramírez, P. Todd Stukenberg, John S. Lowengrub, Kevin A. Janes",
        "doi": "https://doi.org/10.1101/2025.07.13.664571",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.07.13.664571v1.full.pdf",
        "abstract": "Biomolecular condensates create dynamic subcellular compartments that alter systems-level properties of the networks surrounding them. One model combining soluble and condensed states is the Cahn-Hilliard equation, which specifies a diffuse interface between the two phases. Customized approaches required to solve this equation are largely inaccessible. Using two complementary numerical strategies, we built stable, self-consistent Cahn-Hilliard solvers in Python, MATLAB, and Julia. The algorithms simulated the complete time evolution of condensed droplets as they dissolved or persisted, relating critical droplet size to a coefficient for the diffuse interface in the Cahn-Hilliard equation. We applied this universal relationship to the chromosomal passenger complex, a multi-protein assembly that reportedly condenses on mitotic chromosomes. The fully constrained Cahn-Hilliard simulations yielded dewetting and coarsening behaviors that closely mirrored experiments in different cell types. The Cahn-Hilliard equation tests whether condensate dynamics behave as a phase-separated liquid, and its numerical solutions advance generalized modeling of biomolecular systems.",
        "posted": "July 17, 2025"
    },
    {
        "title": "Taguchi–Machine Learning Hybrid Framework for Optimization of Particulate Drug Delivery Systems",
        "authors": "Doğukan Duymaz, Seda Kizilel",
        "doi": "https://doi.org/10.1101/2025.08.16.670654",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.08.16.670654v1.full.pdf",
        "abstract": "Optimizing particulate drug carrier systems requires balancing multiple formulation parameters to achieve target physicochemical properties while minimizing experimental burden. Here, we implement a hybrid optimization framework integrating a Taguchi orthogonal array (OA) design with statistical modeling and machine learning (ML)–based interpretability, using doxorubicin-loaded chitosan microspheres (DOX-CS MSs). Microspheres were synthesized via a water-in-oil emulsion crosslinking method and characterized by FTIR, XRD, and FESEM to confirm chemical structure, crystallinity, and spherical morphology. The optimization targeted a particle size of 5–7 µm and encapsulation efficiency (EE) >90%. An initial L₉ Taguchi OA design efficiently narrowed the formulation space by varying chitosan concentration (1–3% w/v), glutaraldehyde concentration (1.5–5% v/v), and crosslinking time (3–5 h), yielding nine core formulations. Pearson/Spearman correlation, second-order polynomial regression (Poly²), and Gradient Boosting Machine (GBM) models quantified parameter influences and predicted performance. SHapley Additive exPlanations (SHAP) identified chitosan concentration as the primary determinant of both size and EE, with glutaraldehyde content exerting secondary, synergistic effects. Poly² response-surface modeling achieved high predictive accuracy (R² = 0.983 for size; R² = 0.986 for EE) and yielded explicit regression equations for real-time formulation targeting. This hybrid Taguchi–ML approach enables rapid factor prioritization, reveals nonlinear interactions overlooked by conventional Taguchi analysis, and offers transparent ML interpretability. Beyond chitosan-based carriers, it provides a generalizable, scalable route to rational formulation design in complex particulate systems for targeted biomedical applications.",
        "posted": "August 21, 2025"
    },
    {
        "title": "Agentic AI Integrated with Scientific Knowledge: Laboratory Validation in Systems Biology",
        "authors": "Daniel Brunnsåker, Alexander H. Gower, Prajakta Naval, Erik Y. Bjurström, Filip Kronström, Ievgeniia A. Tiukova, Ross D. King",
        "doi": "https://doi.org/10.1101/2025.06.24.661378",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.06.24.661378v3.full.pdf",
        "abstract": "Automation is transforming scientific discovery by enabling systematic exploration of complex hypotheses. Large language models (LLMs) perform well across diverse tasks and promise to accelerate research, but often struggle to interact with logical structures. Here we present a framework integrating LLM-based agents with laboratory automation, guided by a logical scaffold incorporating symbolic relational learning, structured vocabularies, and experimental constraints. This integration reduces output incoherence and improves reliability in automated workflows. We couple this AI-driven approach to automated cell-culture and metabolomics platforms, enabling hypothesis validation and refinement, yielding a flexible system for scientific discovery. We validate the system in Saccharomyces cerevisiae, identifying novel interactions, including glutamate-induced synergistic growth inhibition in spermine-treated cells and aminoadipate’s partial rescue of formic-acid stress. All hypotheses, experiments, and data are captured in a graph database employing controlled vocabularies. Existing ontologies are extended, and a novel representation of scientific hypotheses is presented using description logics. This work enables a more reliable, machine-driven discovery process in systems biology.",
        "posted": "August 18, 2025"
    },
    {
        "title": "Generating Bounded Linear Temporal Logic in Systems Biology with Large Language Models",
        "authors": "Difei Tang, Natasa Miskov-Zivanov",
        "doi": "https://doi.org/10.1101/2025.08.06.668950",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.08.06.668950v1.full.pdf",
        "abstract": "In computational modeling, Bounded Linear Temporal Logic (BLTL) is a valuable formalism for describing and verifying the temporal behavior of biological systems. However, translating natural language (NL) descriptions of system behaviors into accurate BLTL properties remains a labor-intensive task, requiring deep expertise in both logic syntax and semantic translation. With the advent of large language models (LLMs), automating this translation has become a promising direction. In this work, we propose an accurate and flexible NL-BLTL transformation framework based on transfer learning. Our approach consists of three stages: 1) Synthetic data generation, where we construct a large-scale NL-BLTL dataset. 2) Pre-training, where we fine-tune LLMs on the synthetic dataset to enhance their ability to characterize logical structure and BLTL specifications. 3) Fine-tuning, where we adapt the pre-trained models to a naïve T-cell dataset with manual NL-BLTL annotations. We evaluate the fine-tuned models on the naïve T-cell test set and further assess their generalizability on an unseen NL-BLTL dataset in the context of the pancreatic cancer environment, using comprehensive metrics. Experimental results show that models pre-trained on the synthetic data and fine-tuned on real-world annotations outperform both out-of-the-box LLMs, such as GPT-4, and models trained directly on the naïve T-cell dataset without pre-training, demonstrating the effectiveness of our framework.",
        "posted": "August 09, 2025"
    },
    {
        "title": "Uncertainty Modeling Outperforms Machine Learning for Microbiome Data Analysis",
        "authors": "Maxwell A. Konnaris, Manan Saxena, Nicole Lazar, Justin D. Silverman",
        "doi": "https://doi.org/10.1101/2025.09.12.675956",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.09.12.675956v1.full.pdf",
        "abstract": "Microbiome sequencing measures relative rather than absolute abundances, providing no direct information about total microbial load. Normalization methods attempt to compensate, but rely on strong, often untestable assumptions that can bias inference. Experimental measurements of load (e.g., qPCR, flow cytometry) offer a solution, but remain costly and uncommon. A recent high-profile study proposed that machine learning could bypass this limitation by predicting microbial load from sequencing data alone. To evaluate this claim, we assembled mutt, the largest public database of paired sequencing and load measurements, spanning 35 studies and over 15,000 samples. Using mutt, we show that published machine learning models fail to generalize: on average they perform worse than a naive baseline that always predicted the training set mean. These failures stem from covariate shift–limited shared taxa between studies, differences in community composition, and differences in preprocessing pipelines–that silently derail model inputs. In contrast, Bayesian partially identified models do not attempt to impute microbial load, but instead propagate scale uncertainty through downstream analyses. Across 30 benchmark datasets, Bayesian partially identified models consistently outperformed normalization and machine learning approaches, providing a principled and reproducible foundation for microbiome inference.",
        "posted": "September 16, 2025"
    },
    {
        "title": "Differences between in vivo and ex vivo hematopoietic model systems modulate the outcomes of genetic perturbations",
        "authors": "Aarathy Ravi Sundar Jose Geetha, Wolfgang Esser-Skala, David Lara-Astiaso, Nikolaus Fortelny",
        "doi": "https://doi.org/10.1101/2025.09.02.673692",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.09.02.673692v1.full.pdf",
        "abstract": "Ex vivo cell cultures are reductionist models that enable cost effective, precisely controlled experiments with fewer ethical concerns than in vivo conditions. This results in their extensive use in diverse studies, especially large-scale genetic and drug perturbation screens. Although it is commonly accepted that ex vivo models do not fully recapitulate in vivo conditions, the molecular effects of model systems on cells in homeostasis and on cells undergoing drug or genetic perturbations are poorly understood. Using a CRISPR knockout (KO) screen with transcriptome read-out (Perturb-seq) of hematopoietic progenitor cells cultured ex vivo and grown in vivo, we analyzed the effects of ex vivo culture on unperturbed and perturbed cells. Unperturbed cells cultured ex vivo generally showed reduced basal interferon signatures and increased growth and metabolism signatures. These differences in unperturbed cells translated to differences between KO effects observed in vivo and ex vivo. We validated this impact of the model system on KO effects in an additional dataset of genetic KOs in bulk-sorted splenic immune cells, which confirmed our results. Interestingly, genes and molecular pathways with different KO effects were partly predicted by differences between unperturbed cells cultured in vivo and ex vivo. We therefore evaluated the performance of state-of-the-art models in predicting in vivo KO effects from ex vivo KO effects. This proved challenging, demonstrating the need for further developments. In summary, our study reveals differences in culture models, suggests approaches to improve culture models, and provides a test case for computational predictions of perturbation effects.",
        "posted": "September 07, 2025"
    },
    {
        "title": "SpaceExpress enables differential spatial transcriptomics with natural coordinate systems",
        "authors": "Yeojin Kim, Abhishek Ojha, Alex Schrader, Juyeon Lee, Zijun Wu, Ian M Traniello, Saumya Jain, Gene E Robinson, Hee Sun Han, Sihai D Zhao, Saurabh Sinha",
        "doi": "https://doi.org/10.1101/2024.12.19.628720",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.12.19.628720v2.full.pdf",
        "abstract": "Spatial transcriptomics (ST) technologies have enabled new explorations into the spatial organization of tissues and their functional implications. However, one of the most fundamental analyses – comparative analysis of spatial gene expression across phenotypes – remains a formidable challenge. We introduce SpaceExpress, a novel statistical tool for detecting phenotype-associated changes in spatial expression patterns. SpaceExpress employs a neural network to embed multiple ST samples in a common latent space, enabling robust cross-sample comparisons despite structural and technical variations. It then uses spline regression to test differential spatial expression of genes between conditions, identifying specific regions of the tissue where expression patterns diverge and quantifying the magnitude of those differences, with rigorous false discovery control and handling of multiple replicates per condition. It includes visualization tools to help interpret spatial pattern differences. We demonstrate the tool’s effectiveness on synthetic and real ST datasets, revealing mechanistic insights into behavior- and development-related neurogenomic changes in honey bees and mice. Our work extends the highly influential paradigm of differential gene expression analysis to spatial omics.",
        "posted": "September 14, 2025"
    },
    {
        "title": "Systems biology framework for rational design of operational conditions for in vitro / in vivo translation of microphysiological systems",
        "authors": "Jose L. Cadavid, Nikolaos Meimetis, Tyler Matsuzaki, Erin N. Tevonian, Linda G. Griffith, Douglas A. Lauffenburger",
        "doi": "https://doi.org/10.1101/2025.01.17.633624",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.17.633624v2.full.pdf",
        "abstract": "Preclinical models are used extensively to study diseases and potential therapeutic treatments. Complex in vitro platforms incorporating human cellular components, known as microphysiological systems (MPS), can model cellular and microenvironmental features of diseased tissues. However, determining experimental conditions -- particularly biomolecular cues such as growth factors, cytokines, and matrix proteins -- providing the most effective translatability of MPS-generated information to in vivo human subject contexts is a major challenge. Here, using metabolic dysfunction-associated fatty liver disease (MAFLD) studied using the CNBio PhysioMimix as a case study, we developed a machine learning framework called Latent In Vitro to In Vivo Translation (LIV2TRANS) to ascertain how MPS data map to in vivo data, first sharpening translation insights and consequently elucidating experimental conditions that can further enhance translation capability. Our findings in this case study highlight TGFβ as a crucial cue for MPS translatability and indicate that adding JAK-STAT pathway perturbations via interferon stimuli could increase the predictive performance of this MPS in MAFLD studies. Finally, we developed an optimization approach that identified androgen and EGFR signaling as key for maximizing the capacity of this MPS to capture in vivo human biological information germane to MAFLD. More broadly, this work establishes a mathematically principled approach for identifying experimental conditions most beneficially capturing in vivo human-relevant molecular pathways and processes, generalizable to preclinical studies for a wide range of diseases and potential treatments.",
        "posted": "October 01, 2025"
    },
    {
        "title": "Integrative Spatial Omics for Systems-Level Mapping of Pathological Niches",
        "authors": "Angela R.S. Kruse, Roy Lardenoije, Lukasz G. Migas, Claire F. Scott, Cody Marshall, Morad C. Malek, Adel Eskaros, Thai Pham, Kristie Aamodt, Madeline Colley, Lissa Ventura-Antunes, Melissa A. Farrow, Raf Van de Plas, Joana Goncalves, Matthew Schrag, Alvin C. Powers, Jeffrey M. Spraggins",
        "doi": "https://doi.org/10.1101/2025.09.12.675904",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.09.12.675904v2.full.pdf",
        "abstract": "Spatial ’omics technologies are a powerful tool for mapping the relationship between cellular organization and molecular distributions in healthy and diseased tissue microenvironments. Here, we describe a novel multimodal pipeline that represents experimental and computational advances for spatiomolecular analysis of tissue samples across molecular classes. This adaptable method integrates matrix-assisted laser desorption/ionization imaging mass spectrometry spatial lipidomics, spatial transcriptomics, protein imaging via multiplexed immunofluorescence microscopy, and histopathological staining to uncover spatiomolecular profiles associated with unique cellular niches and pathological features. We demonstrate the power of this approach using two different complex human disease systems: Alzheimer’s disease in human brain tissue and type 2 diabetes mellitus in the human pancreas. This work establishes and demonstrates a generalizable framework for multimodal spatial integration, enabling precise mapping of molecular mechanisms that underlie complex tissue pathologies.",
        "posted": "October 18, 2025"
    },
    {
        "title": "Benchmarking Free Energy Calculations: Analysis of Single and Double Mutations Across Two Simulation Software Platforms for Two Protein Systems",
        "authors": "Shivani Gupta, Qinfang Sun, Ronald M. Levy",
        "doi": "https://doi.org/10.1101/2025.10.19.683321",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.10.19.683321v1.full.pdf",
        "abstract": "Mutation analysis of single and double mutations of proteins including for the two widely studied proteins: Staphylococcus nuclease (S. nuclease) and T4 lysozyme, provide critical insights into their stability and fitness. Furthermore, such analysis facilitates a deeper understanding of the complex interplay between a protein’s sequence, structural conformation, and functional output. Free Energy Perturbation (FEP) is an alchemical, all-atom molecular dynamics based computational approach that determines the free energy change (ΔΔG) from wild type to mutant states. Two widely adopted software platforms used for this purpose are Schrödinger and GROMACS. We have compared the results of FEP simulations for mutations using these platforms, employing the OPLS4 force field implemented in Schrödinger, and the Amber99SB-ILDN force field implemented in GROMACS for this work. For the 38 single mutants of S. nuclease, the Pearson r between the experimental and the calculated free energy change (ΔΔG) was 0.86 using Schrödinger and 0.87 using GROMACS. The reliability of the FEP method using the two software platforms with the specified force fields was further demonstrated by its performance on 24 single mutants of T4 lysozyme, yielding strong correlation between predicted and experimental ΔΔG values, with Pearson r of 0.80 for Schrödinger and 0.85 for GROMACS. Additionally, the computed folding free energy changes for 45 double mutations in S. nuclease () using Schrödinger correlated well with both experimental measurements (Pearson r = 0.74) and previously reported GROMACS values (Pearson r = 0.71). Correspondingly, the nonadditivities() of the double mutations derived using Schrödinger for these 45 double mutants of S. nuclease were also found to be in good agreement with the experimental values (Pearson r = 0.79), as well as with the previously reported GROMACS results (Pearson r = 0.61). A good correlation was also observed between computed values from Schrödinger and GROMACS, with a Pearson r of 0.71 for double mutants and 0.61 for their nonadditivities. Collectively, these findings establish the efficiency, accuracy, and reliability of Schrödinger FEP+ and GROMACS in predicting mutation induced free energy changes in S. nuclease and T4 lysozyme. The integration of FEP based computational methodologies with experimental validation provides a framework for quantifying mutation induced changes in protein thermostability, which can be used as a tool for protein engineering and design.",
        "posted": "October 20, 2025"
    },
    {
        "title": "Neuronal subtype-specific metabolic changes in neurodegenerative and neuropsychiatric diseases predicted via a systems biology-based approach",
        "authors": "Boyu Jiang, Shuang Wang, Junkai Xie, Hyunjin Kim, Anke M. Tukker, Juexin Wang, Aaron B. Bowman, Chongli Yuan, Priyanka Baloni",
        "doi": "https://doi.org/10.1101/2025.11.03.686281",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.11.03.686281v1.full.pdf",
        "abstract": "Understanding how distinct neuronal subtypes contribute to Alzheimer’s disease (AD) pathology remains a major challenge. Patient-derived induced pluripotent stem cell (iPSC) studies have shown neuronal subtype-specific molecular and pathological signatures, yet the underlying metabolic shifts driving this selective vulnerability are not completely understood. Here we present iNeuron-GEM, the first manually curated, genome-scale metabolic network of human neurons that integrates transcriptomic and metabolic knowledge to resolve subtype-specific metabolic states. By coupling iNeuron-GEM with single nucleus RNA sequencing data from post-mortem human cohort studies, ROSMAP and SEA-AD, we capture neuronal subtype-specific metabolic features and fluxes and identify perturbations in lipid and energy metabolism across excitatory and inhibitory neurons. Integrative analysis with NPS-AD data shows overlapping metabolic disruptions in AD and schizophrenia (SCZ), suggesting shared molecular vulnerabilities between neurodegenerative and neuropsychiatric disorders. We also developed a computational pipeline to infer transcriptional regulation of metabolic pathways and identify NR6A1 and NR3C1 as important regulators of lipid dysregulation in AD neurons. Our study establishes iNeuron-GEM as a framework to identify neuronal subtype-specific metabolic vulnerabilities in complex brain disorders.",
        "posted": "November 04, 2025"
    },
    {
        "title": "An integrated platform for high-throughput phenospace learning of 3D multilineage organoid systems",
        "authors": "Ryo Okuda, Christoph Harmel, Quan Xu, Héloise Mary, Philip Schulz, Linda Steinacher, Elisa D’Arcangelo, Bruno Gjeta, Marina Signer, Irineja Cubela, Marc Bickle, Matthias P. Lutolf, Lauriane Cabon, Ilya Lukonin, J. Gray Camp",
        "doi": "https://doi.org/10.1101/2025.11.27.690952",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.11.27.690952v1.full.pdf",
        "abstract": "Complex multilineage organoid systems lack quantitative phenotyping methods preserving spatial architecture at high throughput. Current approaches compromise biological complexity, spatial resolution, or robust homogeneous multilineage assembly. We establish an integrated experimental-computational platform for high-throughput spatial phenotyping of multilineage organoids through developing a modular tumoroid culture system incorporating pancreatic ductal adenocarcinoma (PDAC) cells and cancer-associated fibroblasts (CAFs) in 384-well format with multiplexed whole-mount imaging. We developed Phenocoder, a machine learning framework combining conditional variational autoencoders with spatial graph analysis to extract multiscale organoid features. Rigorous validation demonstrates robust performance in PDAC tumoroids. The platform identifies pathway modulators that disrupt the fibrotic microenvironment and discovers stroma-dependent vulnerabilities, undetectable in monocultures. Extending to immuno-competent tumoroids, we assess fibrosis modulators in combination with T cell bispecific antibodies, identifying treatments that enhance immune cell proliferation and infiltration inducing cancer cell death, validated in patient-derived explants. This platform establishes a generalizable framework for multilineage organoid phenotyping.",
        "posted": "November 29, 2025"
    },
    {
        "title": "ECLIPSE: Exploration of Complex Ligand-Protein Interactions through Learning from Systems-level Heterogeneous Biomedical Knowledge Graphs",
        "authors": "Heval Atas Guvenilir, Tunca Doğan",
        "doi": "https://doi.org/10.1101/2025.11.05.686382",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.11.05.686382v1.full.pdf",
        "abstract": "Discovering new, efficacious molecules remains slow and costly; rigorous data science-driven systems-level approaches are therefore essential to prioritise hypotheses and de-risk drug development. In this study, we present ECLIPSE, a systems-level framework for compound/ligand–protein interaction (CPI) representation and prediction, combining heterogeneous knowledge graphs (KGs), which encode large-scale entity–relation structure, with graph neural networks that exploit relational inductive biases to perform inference on graph-structured data. ECLIPSE uses our comprehensive biomedical KG-based platform, CROssBAR, incorporating genes/proteins, drugs, compounds, pathways, diseases, and phenotypes, along with their multi-layered relationships. Each entity is assigned input features derived from language or graph representation learning models and projected via type-specific neural network layers. To process these featurized biomedical KGs for bioactivity prediction, we employed the heterogeneous graph transformer (HGT) architecture. In contrast to the majority of GNN algorithms, which are restricted to homogenous graphs, HGT can handle graph heterogeneity and maintain node-and edge-type dependent representations through its attention mechanism. ECLIPSE achieves strong performance on challenging, protein-family– specific CPI benchmarks compared with baseline and state-of-the-art methods; ablations confirm performance gains from modelling graph heterogeneity and all feature sources. Use-case analyses on a druggable kinase (PIM1) and a historically undruggable receptor (HER3) illustrate generalizability across target classes and activity ranges. By leveraging direct and indirect relationships embedded in biomedical KGs, ECLIPSE provides context-aware CPI inference that is scalable to real-world settings. Code, datasets, and trained models are released to support reproducibility and reuse.",
        "posted": "November 07, 2025"
    },
    {
        "title": "Stimulus sensitivity in noisy neural systems",
        "authors": "Carlo Paris, Steeve Laquitaine, Matthew Chalk, Ulisse Ferrari",
        "doi": "https://doi.org/10.64898/2025.12.24.696343",
        "pdf_link": "https://www.biorxiv.org/content/10.64898/2025.12.24.696343v1.full.pdf",
        "abstract": "Understanding how neural populations encode sensory information requires a precise definition of neuronal sensitivity to stimuli. While tuning curves and firing rates offer intuitive insights, theoretical frameworks based on signal-to-noise ratio and decoding efficiency identify Fisher information as the canonical measure of sensitivity, due to its relation with decoding performance. However, this relation holds only under restrictive conditions—when many neurons encode the same stimulus feature or when neural noise is weak. In realistic settings, such as when complex or high-dimensional stimuli are represented by a small ensemble of neurons, Fisher information becomes ill-defined or misleading. To overcome these limitations, we investigate two complementary information-theoretic quantities—the stimulus-specific information (ISSI) and the local information (Iloc)—and propose them as robust alternatives for quantifying sensitivity. We show that ISSI and Iloc converge with Fisher information when signal to noise is large, yet remain meaningful and interpretable beyond that regime. Importantly, these measures capture distinct aspects of sensitivity: ISSI quantifies how observing a response reduces stimulus uncertainty, whereas Iloc reflects how small stimulus perturbations reshape the system’s posterior beliefs. Together, they offer a unifying perspective linking information-theoretic and statistical notions of sensitivity, bridging theoretical analysis and experimental investigation of neural coding.",
        "posted": "December 25, 2025"
    },
    {
        "title": "Why motor learning involves multiple systems: an algorithmic perspective",
        "authors": "Francesca Greenstreet, Jesse P. Geerts, Juan A. Gallego, Claudia Clopath",
        "doi": "https://doi.org/10.64898/2025.12.19.695526",
        "pdf_link": "https://www.biorxiv.org/content/10.64898/2025.12.19.695526v1.full.pdf",
        "abstract": "The initial stage of learning motor skills involves exploring vast action spaces, making it impractical to learn the value of every possible action independently. This poses a challenge for standard reinforcement learning approaches, which excel in constrained domains but struggle when the space of possible actions is high-dimensional. Recent work in machine learning has sought to mitigate this problem by combining deep reinforcement learning with a supervised learning system that reduces the complexity of the control policy space by learning low-dimensional embeddings of an action space. Here, we propose that in the mammalian brain, the cortico-cerebellar network learns these low-dimensional action embeddings in a supervised way, while the basal ganglia learn value and policies in this action embedding space using reinforcement learning. We trained this model on reaching tasks and show that, contrary to traditional models of the basal ganglia, it recapitulates features of neural activity whereby similar reaching movements are associated with similar neural activity patterns in the basal ganglia. We also demonstrate a link between learning these low-dimensional action embeddings and both generalisation and the limits of multi-task adaptation in human behavioural studies. Through this framework, we propose a novel computational view of how key motor regions of the brain interact to efficiently learn a new skill.",
        "posted": "December 21, 2025"
    },
    {
        "title": "Capturing Multi-Scale Dynamics of Aortic Valve Calcification With a Coupled Fluid–Structure and Systems Biology Model",
        "authors": "Michael Quan, Tianyou Xie, Leonard A. Harris, Haoxiang Luo",
        "doi": "https://doi.org/10.64898/2025.11.28.691136",
        "pdf_link": "https://www.biorxiv.org/content/10.64898/2025.11.28.691136v1.full.pdf",
        "abstract": "Calcific aortic valve disease (CAVD) arises from coupled interactions between blood flow, tissue mechanics, and cellular signaling. Hemodynamic forces influence endothelial and interstitial cell behavior, while the resulting tissue remodeling alters valve motion and flow patterns. Capturing this two-way feedback requires models that integrate fluid–structure mechanics with biochemical regulation, yet such multiscale coupling remains technically challenging. Previous computational models have focused on isolated aspects of the disease: fluid–structure interaction (FSI) simulations reproduce valve deformation and flow, and systems biology (SB) models describe molecular signaling that drives fibrosis and calcification. However, without coupling, these approaches cannot predict how mechanical dysfunction initiates biochemical remodeling or how biochemical changes feed back on mechanics. Here, we present a multi-physics computational framework that couples three-dimensional FSI simulations of aortic valve dynamics with a mechanistic SB model of calcification signaling. The FSI module resolves pulsatile blood flow and leaflet deformation, yielding local wall shear stresses and tissue strains throughout the cardiac cycle. These mechanical quantities are used as inputs to the SB module, which represents key biochemical pathways governing inflammation, TGF-β/SMAD signaling, and nitric-oxide (NO)–mediated inhibition within valvular cells. Simulations predict long-term calcification trajectories for valves of varying thickness, showing that fibrosis-induced stiffening lowers shear stress, reduces NO synthesis, and enhances TGF-β activation, thereby accelerating calcification. The framework is modular and extensible, allowing future incorporation of additional pathways, as well as implementation of full two-way coupling between the FSI and SB models. By integrating physics-based hemodynamics with systems-level biochemistry, this study provides a proof-of-principle demonstration of a next-generation, multi-scale modeling platform for studying cardiovascular disease that unites blood flow dynamics and biochemical signaling.",
        "posted": "December 02, 2025"
    },
    {
        "title": "An adaptive multi-strategy metaheuristic for robust model calibration in large-scale systems biology",
        "authors": "Andrea Polo-Rodríguez, David R. Penas, Julio R. Banga",
        "doi": "https://doi.org/10.64898/2026.01.27.701977",
        "pdf_link": "https://www.biorxiv.org/content/10.64898/2026.01.27.701977v1.full.pdf",
        "abstract": "Parameter estimation is a central challenge in systems biology, particularly for large dynamic models described by nonlinear ordinary differential equations (ODEs). These global optimization problems exhibit landscapes which are topologically heterogeneous, often exhibiting a pathological mixture of stiff, smooth valleys and rugged, noisy plateaus, making single-strategy hybrids ineffective. While methods like enhanced Scatter Search (eSS) represent the current state-of-the-art, their rigid intensification strategies can limit performance in large-scale or ill-conditioned scenarios. In this work, we introduce eLSHADE+, a novel metaheuristic architecture designed to adapt to these topological challenges. The proposed algorithm augments a recent Differential Evolution variant (LSHADE) with a probabilistic multistrategy hybridization. Unlike standard memetic algorithms, eLSHADE+ uses three distinct operational modes: (i) gradient-based intensification for precision in differentiable regions, (ii) derivative-free search for robustness against numerical noise, and (iii) pure global exploration to conserve computational resources in complicated basins. Additionally, a logarithmic parameter space transformation is incorporated to facilitate search across multi-scale biological constants. We rigorously evaluated eLSHADE+ using the BioPreDyn benchmark suite, comprising challenging real-world problems. Comparative analysis demonstrates that this adaptive multi-strategy approach yields statistically superior convergence speed and solution accuracy compared to eSS and other competitive metaheuristics, establishing a new baseline for robust model calibration in computational biology. Code and data are available at https://doi.org/10.5281/zenodo.18379327.",
        "posted": "January 30, 2026"
    },
    {
        "title": "75 Years of Mathematical Oncology",
        "authors": "Franco Pradelli, Maximilian Strobl, Sadegh Marzban, François de Kermenguy, Ari Barnett, Katyayni Ganesan, Guillermo Lorenzo, David A. Hormuth II, Sara Hamis, Dhananjay Bhaskar, Alexander R. A. Anderson, Jeffrey West",
        "doi": "https://doi.org/10.64898/2026.01.13.699306",
        "pdf_link": "https://www.biorxiv.org/content/10.64898/2026.01.13.699306v1.full.pdf",
        "abstract": "Mathematics has long provided a quantitative framework to interpret cancer biology and treatment. Driven by richer biological and clinical data, the field has evolved into a multidisciplinary and translational endeavor - giving rise to Mathematical Oncology. Yet, the field’s strong interdisciplinarity obscures a comprehensive view of its evolution, as well as the boundaries between Mathematical Oncology and adjacent domains. Here, we address this gap through a comprehensive bibliometric analysis spanning 75 years of mathematical research in oncology. Using a manually curated corpus (∼1,500 papers) and a large query-based dataset (∼19,000 papers), we map the field’s conceptual and collaborative development over time. Independent analyses reveal sustained growth, high impact, and pronounced interdisciplinarity, together with a gradual shift from fundamental cancer biology toward therapeutic modeling. This reorientation underpins the emergence of Mathematical Oncology as a distinct field, separate from Systems Biology and Pharmacokinetics / Pharmacodynamics. We show how diverse concepts interlace within Mathematical Oncology, bridging applied mathematics, optimal control, evolutionary theory, and imaging. Collectively, we demonstrate that Mathematical Oncology is not merely the application of mathematics to cancer, but the use of interpretable models integrating clinical, biological, and physical knowledge to improve screening, understand disease evolution, guide therapy, and strengthen forecasting.",
        "posted": "January 14, 2026"
    },
    {
        "title": "Transmission Dynamics of Eastern Equine Encephalitis: Global Sensitivity Analysis and SHAP Parameter Importance in an Age-Structured Vector-Host Model",
        "authors": "Aurod Ounsinegad, Christopher Mitchell, Nicholas Komar",
        "doi": "https://doi.org/10.1101/2025.01.13.632694",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.13.632694v2.full.pdf",
        "abstract": "Eastern equine encephalitis virus (EEEV) is a deadly arboviral pathogen with 30% severe case fatality. EEEV exhibits pronounced 2–3 year cyclical outbreak patterns in the northeastern United States, linked to shifts in mosquito feeding preferences between hatch-year and adult avians. We developed an age-structured vector-host model incorporating differential feeding patterns of Culiseta melanura mosquitoes on European Starlings and American Robins. Global sensitivity analysis revealed mosquito biting rate (a) as the dominant driver in transmission, with avian infectivity (δ) and exposure (α) playing secondary roles. Pairing tree-based machine learning algorithms with SHAP analysis on 100,000 parameter sets identified parameter hierarchies that govern cyclic transmission. Adult avian mortality (µa) was identified as the key parameter underlying cyclic and stable transmission patterns. SHAP further revealed these patterns to be grounded on opposite sides of the same epidemiological mechanism. Stable endemics emerge from demographic stability paired with transmission optimization, while cyclic endemics emerge from demographic instability paired with minimal transmission optimization. Numerical simulations illustrated critical threshold dynamics at 0.2 ≤ α ≤ 0.4, where heightened hatch-year exposure triggers demographic instability responsible for observed 2–3 year cycles, while balanced exposure (α ≈ 0.5) leads to stable endemics. These mechanisms provide a foundation for targeted surveillance and control interventions.",
        "posted": "January 16, 2026"
    }
]