[
    {
        "title": "Data-driven identification of biomedical systems using multi-scale analysis",
        "authors": "Ismaila Muhammed, Dimitris M. Manias, Dimitris A. Goussis, Haralampos Hatzikirou",
        "doi": "https://doi.org/10.1101/2025.06.05.657989",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.06.05.657989v1.full.pdf",
        "abstract": "Biomedical systems inherently exhibit multi-scale dynamics, making accurate system identification particularly challenging due to the complexity of capturing a wide time scale spectrum. Traditional methods capable of addressing this issue rely on explicit equations, limiting their applicability in cases where only observational data are available. To overcome this limitation, we propose a data-driven framework that integrates the Sparse Identification of Nonlinear Dynamics (SINDy) method, the multi scale analysis algorithm Computational Singular Perturbation (CSP) and neural networks (NNs). This framework allows the partition of the available dataset in subsets characterized by similar dynamics, so that system identification can proceed within these subsets without facing a wide time scale spectrum. Accordingly, when the full dataset does not allow SINDy to identify the proper model, CSP is employed for the generation of subsets of similar dynamics, which are then fed into SINDy. CSP requires the availability of the gradient of the vector field, which is estimated by the NNs. The framework is tested on the Michaelis-Menten model, for which various reduced models in analytic form exist at different parts of the phase space. It is demonstrated that the CSP-based data subsets allow SINDy to identify the proper reduced model in cases where the full dataset does not. In addition, it is demonstrated that the framework succeeds even in the cases where the available data set originates from stochastic versions of the Michaelis-Menten model. This framework is algorithmic, so system identification is not hindered by the dimensions of the dataset. Author summary Biomedical systems often evolve across multiple time scales, posing major challenges for constructing accurate models directly from data. Traditional model reduction techniques require explicit equations and thus cannot be applied when only observational data are available. To address this, we developed a data-driven framework that combines Sparse Identification of Nonlinear Dynamics (SINDy), Computational Singular Perturbation (CSP) and neural networks (NNs). Our approach automatically partitions a dataset into subsets characterized by similar dynamics, allowing valid reduced models to be identified in each region. When SINDy fails to recover a global model from the full dataset, CSP -leveraging Jacobian estimates from NNs-successfully isolates dynamical regimes where SINDy can be applied locally. We validated this framework using the Michaelis-Menten biochemical model, which is known to admit multiple reduced models in different regions of the phase space. Our method consistently identified the appropriate reduced dynamics, even when the data originated from stochastic simulations. Because our approach is algorithmic and equation-free, it is scalable to high-dimensional systems and robust to noise, offering a promising solution for data-driven model discovery in complex biomedical systems.",
        "posted": "June 09, 2025"
    },
    {
        "title": "Amendable decisions in living systems",
        "authors": "Izaak Neri, Simone Pigolotti",
        "doi": "https://doi.org/10.1101/2025.06.03.657747",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.06.03.657747v1.full.pdf",
        "abstract": "A distinct feature of living systems is their capacity to take decisions based on uncertain environmental signals. Examples span from the microscopic scale of cells differentiating based on the concentration of a morphogene, to the macroscopic scale of decisions by animals or human beings. The current paradigm in decision theory is based on the assumption that decisions, once taken, cannot be revoked. However, living systems often amend their decisions if accumulated evidence favors an alternative hypothesis. In this paper, we develop a theory for amendable decision making in living systems. We find that, in contrast with irrevocable decisions, optimal amendable decisions can be taken in a finite average time at zero error probability. Our theory successfully predicts the outcome of a visual experiment involving human participants and the accuracy of cell-fate decisions in early development. These case studies demonstrate the broad applicability of the amendable decision paradigm in biology.",
        "posted": "June 06, 2025"
    },
    {
        "title": "A systems biology approach to evaluate potential probiotic candidates for women’s vaginal health",
        "authors": "Emma M. Glass, Glynis L. Kolling, Jason A. Papin",
        "doi": "https://doi.org/10.1101/2025.06.16.659967",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.06.16.659967v1.full.pdf",
        "abstract": "Probiotic supplements are marketed for diverse health benefits, yet species inclusion often lacks functional rationale. We surveyed 352 U.S. probiotic products and found 36 unique microbial species, with most supplements containing only one species and no clear link between species and intended health benefit. To evaluate probiotic function, we developed CoPaPro, a collection of 1,012 genome-scale metabolic models spanning commensal, pathogenic, and probiotic bacteria. Flux balance analysis revealed that current probiotic species fail to capture the metabolic diversity of native commensals. Focusing on vaginal health, we identified commensals with metabolic profiles overlapping Gardnerella vaginalis, a key pathobiont. In vitro spent media assays using 11 vaginal isolates showed variable inhibition of G. vaginalis, primarily driven by D-lactic acid production rather than metabolic similarity. Several non-Lactobacillus species produced inhibitory levels of D-lactate. These findings highlight the need for function-based probiotic design and demonstrate a scalable framework integrating metabolic modeling with experimental validation.",
        "posted": "June 21, 2025"
    },
    {
        "title": "Selecting Synthetic Data for Successful Simulation-Based Transfer Learning in Dynamical Biological Systems",
        "authors": "Simon Witzke, Julian Zabbarov, Maximilian Kleissl, Pascal Iversen, Bernhard Y. Renard, Katharina Baum",
        "doi": "https://doi.org/10.1101/2024.03.25.586390",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.25.586390v2.full.pdf",
        "abstract": "Background Accurate prediction of the temporal dynamics of biological systems is crucial for informing timely and effective interventions, e.g., in ecological or epidemiological contexts, or for treatment adjustments in therapy. While machine learning has proven its capabilities in generalizing the underlying non-linear dynamics of such systems, unlocking its predictive power is often restrained by the limited availability of large, curated datasets. To supplement real-world data, informing machine learning by transfer learning with synthetic data derived from simulations using ordinary differential equations has emerged as a promising solution. However, the success of this approach highly depends on the designed characteristics of the synthetic data. Results We suggest scrutinizing these characteristics, such as size, diversity, and noise, of ordinary differential equation-based synthetic time series datasets. Here, we demonstrate how to systematically evaluate the influence of such design choices on transfer learning performance. We conduct a proof-of-concept study on three simple, but widely used systems and four real-world datasets. We find a strong interdependency between synthetic dataset size and diversity effects. Good transfer learning settings heavily rely on real-world data characteristics as well as the data’s coherence with the dynamics of the model underlying the synthetic data. We achieve a performance improvement of up to 92% in mean absolute error for simulation-based transfer learning compared to non-informed deep learning. Conclusions Our work emphasizes the relevance of carefully selecting properties of synthetic data for leveraging the valuable domain knowledge contained in ordinary differential equation models for machine-learning based predictions. The code is available at https://github.com/DILiS-lab/opt-synthdata-4tl.",
        "posted": "July 09, 2025"
    },
    {
        "title": "Convergent neural dynamical systems for task control in artificial networks and human brains",
        "authors": "Harrison Ritz, Aditi Jha, Nathaniel D. Daw, Jonathan D. Cohen",
        "doi": "https://doi.org/10.1101/2024.09.29.615736",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.29.615736v5.full.pdf",
        "abstract": "The ability to switch between tasks is a core component of human intelligence, yet a mechanistic understanding of this capacity has remained elusive. Long-standing debates over how task switching is influenced by preparation for upcoming tasks or interference from previous tasks have been difficult to resolve without quantitative neural predictions. We advance this debate by using state-space modeling to directly compare the latent task dynamics in task-optimized recurrent neural networks and human electroencephalographic recordings. Over the inter-trial interval, both networks and brains converged into a neutral task state, a novel control strategy that reconciles the role of preparation and interference in task switching. These findings provide a quantitative account of cognitive flexibility and a promising paradigm for bridging artificial and biological neural networks.",
        "posted": "July 24, 2025"
    },
    {
        "title": "Cahn-Hilliard dynamical models for condensed biomolecular systems",
        "authors": "Sarah M. Groves, Min-Jhe Lu, Astrid Catalina Alvarez-Yela, Monserrat Gerardo-Ramírez, P. Todd Stukenberg, John S. Lowengrub, Kevin A. Janes",
        "doi": "https://doi.org/10.1101/2025.07.13.664571",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.07.13.664571v1.full.pdf",
        "abstract": "Biomolecular condensates create dynamic subcellular compartments that alter systems-level properties of the networks surrounding them. One model combining soluble and condensed states is the Cahn-Hilliard equation, which specifies a diffuse interface between the two phases. Customized approaches required to solve this equation are largely inaccessible. Using two complementary numerical strategies, we built stable, self-consistent Cahn-Hilliard solvers in Python, MATLAB, and Julia. The algorithms simulated the complete time evolution of condensed droplets as they dissolved or persisted, relating critical droplet size to a coefficient for the diffuse interface in the Cahn-Hilliard equation. We applied this universal relationship to the chromosomal passenger complex, a multi-protein assembly that reportedly condenses on mitotic chromosomes. The fully constrained Cahn-Hilliard simulations yielded dewetting and coarsening behaviors that closely mirrored experiments in different cell types. The Cahn-Hilliard equation tests whether condensate dynamics behave as a phase-separated liquid, and its numerical solutions advance generalized modeling of biomolecular systems.",
        "posted": "July 17, 2025"
    }
]