[
    {
        "title": "Optimizing ODE-derived Synthetic Data for Transfer Learning in Dynamical Biological Systems",
        "authors": "Julian Zabbarov, Simon Witzke, Maximilian Kleissl, Pascal Iversen, Bernhard Y. Renard, Katharina Baum",
        "doi": "https://doi.org/10.1101/2024.03.25.586390",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.25.586390v1.full.pdf",
        "abstract": "Motivation Successfully predicting the development of biological systems can lead to advances in various research fields, such as cellular biology and epidemiology. While machine learning has proven its capabilities in generalizing the underlying non-linear dynamics of such systems, unlocking its predictive power is often restrained by the limited availability of large, curated datasets. To supplement real-world data, informing machine learning by transfer learning with data simulated from ordinary differential equations has emerged as a promising solution. However, the success of this approach highly depends on the designed characteristics of the synthetic data. Results We optimize dataset characteristics such as size, diversity, and noise of ordinary differential equation-based synthetic time series datasets in three relevant and representative biological systems. To achieve this, we here, for the first time, present a framework to systematically evaluate the influence of such design choices on transfer learning performance in one place. We achieve a performance improvement of up to 92% in mean absolute error for our optimized simulation-based transfer learning compared to non-informed deep learning. We find a strong interdependency between dataset size and diversity effects. The optimal transfer learning setting heavily relies on real-world data characteristics as well as its coherence with the synthetic data’s dynamics, emphasizing the relevance of such a framework. Availability and Implementation The code is available at https://github.com/DILiS-lab/opt-synthdata-4tl.",
        "posted": "March 29, 2024"
    },
    {
        "title": "A Systems Biology Analysis of Chronic Lymphocytic Leukemia",
        "authors": "Giulia Pozzati, Jinrui Zhou, Hananel Hazan, Giannoula Lakka Klement, Hava T. Siegelmann, Edward A. Rietman, Jack A. Tuszynski",
        "doi": "https://doi.org/10.1101/2024.03.26.586690",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.26.586690v1.full.pdf",
        "abstract": "Whole-genome sequencing has revealed that TP53, NOTCH1, ATM, SF3B1, BIRC3, ABL, NXF1, BCR, ZAP70 are often mutated in CLL, but not consistently across all CLL patients. This paper employs a statistical thermo-dynamics approach in combination with the systems biology of the CLL protein-protein interaction networks to identify the most significant participant proteins in the cancerous transformation. Betti number (a topology of complexity) estimates highlight a protein hierarchy, primarily in the Wnt pathway known for aberrant CLL activation. These individually identified proteins suggest a network-targeted strategy over single-target drug development. The findings advocate for a multi-target inhibition approach, limited to several key proteins to minimize side effects, thereby providing a foundation for designing therapies. This study emphasizes a shift towards a comprehensive, multi-scale analysis to enhance personalized treatment strategies for CLL, which could be experimentally validated using siRNA or small molecule inhibitors. The result is not just the identification of these proteins but their rank-order, offering a potent signal amplification in the context of the 20,000 proteins produced by the human body, thus providing a strategic basis for therapeutic intervention in CLL, underscoring the necessity for a more holistic, cellular, chromosomal, and genome-wide study to develop tailored treatments for CLL patients. Author Summary Chronic Lymphocytic Leukemia (CLL) is a unique and slowly progressing cancer affecting white blood cells, and research on CLL has highlighted the inconsistency of gene mutations across patients. Using a novel approach that merges statistical thermodynamics and systems biology, this research examines the CLL protein-protein interaction networks to pinpoint proteins integral to the onset of the disease. Betti number (a topology of complexity) estimates, which measure the importance of individual proteins when removed from the network, helped identify numerous potential therapeutic targets, notably within the Wnt signaling pathway, a pathway implicated in various cellular processes and known for its defective expression in CLL. The finding advocates for a multi-target inhibition approach, focusing on several key proteins to minimize side effects, thereby laying a foundation for designing more effective therapies for CLL. This paper emphasizes the potential benefits of a comprehensive study, spanning cellular to genome-wide scales, to design personalized treatments for CLL patients.",
        "posted": "March 28, 2024"
    },
    {
        "title": "Histology-guided mathematical model of tumor oxygenation: sensitivity analysis of physical and computational parameters",
        "authors": "Awino Maureiq E. Ojwang’, Sarah Bazargan, Joseph O. Johnson, Shari Pilon-Thomas, Katarzyna A. Rejniak",
        "doi": "https://doi.org/10.1101/2024.03.05.583363",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.05.583363v1.full.pdf",
        "abstract": "A hybrid off-lattice agent-based model has been developed to reconstruct the tumor tissue oxygenation landscape based on histology images and simulated interactions between vasculature and cells with microenvironment metabolites. Here, we performed a robustness sensitivity analysis of that model’s physical and computational parameters. We found that changes in the domain boundary conditions, the initial conditions, and the Michaelis constant are negligible and, thus, do not affect the model outputs. The model is also not sensitive to small perturbations of the vascular influx or the maximum consumption rate of oxygen. However, the model is sensitive to large perturbations of these parameters and changes in the tissue boundary condition, emphasizing an imperative aim to measure these parameters experimentally.",
        "posted": "March 10, 2024"
    },
    {
        "title": "Spectral methods for prediction uncertainty quantification in Systems Biology",
        "authors": "Anna Deneer, Jaap Molenaar, Christian Fleck",
        "doi": "https://doi.org/10.1101/2023.02.14.528500",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2023.02.14.528500v2.full.pdf",
        "abstract": "Uncertainty is ubiquitous in biological systems. These uncertainties can be the result of lack of knowledge or due to a lack of appropriate data. Additionally, the natural variability of biological systems caused by intrinsic noise, e.g. in stochastic gene expression, leads to uncertainties. With the help of numerical simulations the impact of these uncertainties on the model predictions can be assessed, i.e. the impact of the propagation of uncertainty in model parameters on the model response can be quantified. Taking this into account is crucial when the models are used for experimental design, optimisation, or decision-making, as model uncertainty can have a significant effect on the accuracy of model predictions. We focus here on spectral methods to quantify prediction uncertainty based on a probabilistic framework. Such methods have a basis in, e.g., computational mathematics, engineering, physics, and fluid dynamics, and, to a lesser extent, systems biology. In this chapter, we highlight the advantages these methods can have for modelling purposes in systems biology and do so by providing a novel and intuitive scheme. By applying the scheme to an array of examples we show its power, especially in challenging situations where slow converge due to high-dimensionality, bifurcations, and spatial discontinuities play a role.",
        "posted": "April 03, 2024"
    },
    {
        "title": "RBC-GEM: a Knowledge Base for Systems Biology of Human Red Blood Cell Metabolism",
        "authors": "Zachary B. Haiman, Angelo D’Alessandro, Bernhard O. Palsson",
        "doi": "https://doi.org/10.1101/2024.04.26.591249",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.04.26.591249v1.full.pdf",
        "abstract": "Advancements with cost-effective, high-throughput omics technologies have had a transformative effect on both fundamental and translational research in the medical sciences. These advancements have facilitated a departure from the traditional view of human red blood cells (RBCs) as mere carriers of hemoglobin, devoid of significant biological complexity. Over the past decade, proteomic analyses have identified a growing number of different proteins present within RBCs, enabling systems biology analysis of their physiological functions. Here, we introduce RBC-GEM, the most extensive and meticulously curated metabolic reconstruction of a specific human cell type to-date. It was developed through meta-analysis of proteomic data from 28 studies published over the past two decades resulting in a RBC proteome composed of more than 4,600 distinct proteins. Through workflow-guided manual curation, we have compiled the metabolic reactions carried out by this proteome. RBC-GEM is hosted on a version-controlled GitHub repository, ensuring adherence to the standardized protocols for metabolic reconstruction quality control and data stewardship principles. This reconstruction of the RBC metabolic network is a knowledge base consisting of 718 genes encoding proteins acting on 1,590 unique metabolites through 2,554 biochemical reactions: a 700% size expansion over its predecessor. This reconstruction as an up-to-date curated knowledge base can be used for contextualization of data and for the construction of a computational whole-cell model of a human RBC. Author Summary Human red blood cells (RBCs) have been studied for decades because of their unique physiology, essential oxygen delivery functions, and general accessibility. RBCs are the simplest yet most numerous of human cell types due to the loss of cellular organelles during their development process. This process has evolved to maximize hemoglobin content per cell to facilitate RBCs’ main function in gas transport. RBCs are integral to a variety of medical applications, such as blood storage for transfusion. Recent advancements in high-throughput data collection have greatly expanded our understanding of RBC metabolism, highlighting important roles and functions for RBCs in maintaining homeostasis in the organism in addition to oxygen transport. Here we provide a knowledge base for the human RBC as a genome-scale metabolic reconstruction. Our results highlight the complexity of RBC metabolism, supported by recent advancements in high-throughput data collection methods for detecting low-abundance proteins in RBCs. We make knowledge about the RBC findable, accessible, interoperable, and reusable (FAIR). As RBC research is likely to see many translational medical advancements, a knowledge base for the contextualization of RBC data will serve as an essential resource for further research and medical application development.",
        "posted": "April 28, 2024"
    },
    {
        "title": "Biology System Description Language (BiSDL): a modeling language for the design of multicellular synthetic biological systems",
        "authors": "Leonardo Giannantoni, Roberta Bardini, Alessandro Savino, Stefano Di Carlo",
        "doi": "https://doi.org/10.1101/2024.01.13.575499",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.01.13.575499v2.full.pdf",
        "abstract": "Background The Biology System Description Language (BiSDL) is an accessible, easy-to-use computational language for multicellular synthetic biology. It allows synthetic biologists to represent spatiality and multi-level cellular dynamics inherent to multicellular designs, filling a gap in the state of the art. Developed for designing and simulating spatial, multicellular synthetic biological systems, BiSDL integrates high-level conceptual design with detailed low-level modeling, fostering collaboration in the Design-Build-Test-Learn cycle. BiSDL descriptions directly compile into Nets-Within-Nets (NWNs) models, offering a unique approach to spatial and hierarchical modeling in biological systems. Results BiSDL’s effectiveness is showcased through three case studies on complex multicellular systems: a bacterial consortium, a synthetic morphogen system and a conjugative plasmid transfer process. These studies highlight the BiSDL proficiency in representing spatial interactions and multi-level cellular dynamics. The language facilitates the compilation of conceptual designs into detailed, simulatable models, leveraging the NWNs formalism. This enables intuitive modeling of complex biological systems, making advanced computational tools more accessible to a broader range of researchers. Conclusions BiSDL represents a significant step forward in computational languages for synthetic biology, providing a sophisticated yet user-friendly tool for designing and simulating complex biological systems with an emphasis on spatiality and cellular dynamics. Its introduction has the potential to transform research and development in synthetic biology, allowing for deeper insights and novel applications in understanding and manipulating multicellular systems.",
        "posted": "April 05, 2024"
    },
    {
        "title": "Systems Age: A single blood methylation test to quantify aging heterogeneity across 11 physiological systems",
        "authors": "Raghav Sehgal, Yaroslav Markov, Chenxi Qin, Margarita Meer, Courtney Hadley, Aladdin H. Shadyab, Ramon Casanova, JoAnn E. Manson, Parveen Bhatti, Eileen M. Crimmins, Sara Hagg, Themistocles L. Assimes, Eric A. Whitsel, Albert T. Higgins-Chen, Morgan Levine",
        "doi": "https://doi.org/10.1101/2023.07.13.548904",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2023.07.13.548904v2.full.pdf",
        "abstract": "Individuals, organs, tissues, and cells age in diverse ways throughout the lifespan. Epigenetic clocks attempt to quantify differential aging between individuals, but they typically summarize aging as a single measure, ignoring within-person heterogeneity. Our aim was to develop novel systems-based methylation clocks that, when assessed in blood, capture aging in distinct physiological systems. We combined supervised and unsupervised machine learning methods to link DNA methylation, system-specific clinical chemistry and functional measures, and mortality risk. This yielded a panel of 11 system-specific scores– Heart, Lung, Kidney, Liver, Brain, Immune, Inflammatory, Blood, Musculoskeletal, Hormone, and Metabolic. Each system score predicted a wide variety of outcomes, aging phenotypes, and conditions specific to the respective system. We also combined the system scores into a composite Systems Age clock that is predictive of aging across physiological systems in an unbiased manner. Finally, we showed that the system scores clustered individuals into unique aging subtypes that had different patterns of age-related disease and decline. Overall, our biological systems based epigenetic framework captures aging in multiple physiological systems using a single blood draw and assay and may inform the development of more personalized clinical approaches for improving age-related quality of life.",
        "posted": "May 28, 2024"
    },
    {
        "title": "Deep proteomic analysis of microglia reveals fundamental biological differences between model systems",
        "authors": "Amy F Lloyd, Anna Martinez-Muriana, Emma Davis, Michael JD Daniels, Pengfei Hou, Renzo Mancuso, Alejandro J Brenes, Ivana Geric, An Snellinx, Katleen Craessaerts, Tom Theys, Mark Fiers, Bart De Strooper, Andrew JM Howden",
        "doi": "https://doi.org/10.1101/2022.07.07.498804",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2022.07.07.498804v2.full.pdf",
        "abstract": "Using high resolution quantitative mass spectrometry, we have generated the most comprehensive human and mouse microglia proteomic datasets to date, consisting of over 11,000 proteins across all six microglia groups. Microglia from different sources share a core protein signature of over 5600 proteins, yet fundamental differences are observed between species and culture conditions, indicating limitations for human disease modelling in mouse or in in vitro cultures of microglia. Mouse ex vivo microglia show important differences at the proteome level such as differential expression of inflammation and Alzheimer’s Disease associated proteins. We identify a tenfold difference in the protein content of ex vivo and in vitro cells and significant proteome differences associated with protein synthesis, metabolism, microglia marker expression and environmental sensors. Culturing microglia induces rapidly increased growth, protein content and inflammatory protein expression. These changes can be restored by engrafting in vitro cells into the brain, with xenografted hESC-derived microglia closely resembling microglia from human brain. This data provides an important resource for the field and highlights important considerations needed when using model systems to study human physiology and pathology of microglia.",
        "posted": "May 16, 2024"
    },
    {
        "title": "Use of machine learning for quantification of retinal pigment epithelium tight junctions improves assay sensitivity",
        "authors": "Yan Gao, Mark-Anthony Bray, Michael Twarog, YongYao Xu, Natasha Buchanan, Yiyun Zhang, Quintus Medley, Magali Saint-Geniez, Ganesh Prasanna, Qin Zhang",
        "doi": "https://doi.org/10.1101/2024.05.24.595580",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.24.595580v1.full.pdf",
        "abstract": "The retinal pigment epithelium (RPE) is critical for maintaining outer retinal barrier homeostasis. In age-related macular degeneration (AMD), the RPE can undergo a dedifferentiation process that includes tight junction (TJ) loss and displacement of zonula occludens-1 (ZO-1), which may impair structural and functional integrity of the RPE barrier and contribute to disease pathogenesis. Our objective was to develop an automated and sensitive quantification method for TJ aberrations in an RPE immunofluorescence imaging assay, following treatment with TNFα or TGFβ2. However, quantifying ZO-1 morphological changes in the RPE using standard image analysis methods did not provide a satisfactory assay window. To address this challenge, we developed an imaging assay to quantify ZO-1 changes using a machine learning approach, enabling enhanced phenotypic characterization of the ZO-1 changes in RPE cells and improved assay sensitivity. We were also able to capture and quantify the reversal of these changes using etanercept, an TNFα inhibitor, with this imaging assay. Our findings indicated that this machine learning ZO-1 quantification assay could serve as a potential phenotypic readout for RPE dedifferentiation and enabling large-scale mechanistic studies.",
        "posted": "May 30, 2024"
    },
    {
        "title": "Increasing certainty in systems biology models using Bayesian multimodel inference",
        "authors": "Nathaniel Linden-Santangeli, Jin Zhang, Boris Kramer, Padmini Rangamani",
        "doi": "https://doi.org/10.1101/2024.06.16.599231",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.06.16.599231v1.full.pdf",
        "abstract": "Mathematical models are indispensable to the system biology toolkit for studying the structure and behavior of intracellular signaling networks. A common approach to modeling is to develop a system of equations that encode the known biology using approximations and simplifying assumptions. As a result, the same signaling pathway can be represented by multiple models, each with its set of underlying assumptions, which opens up challenges for model selection and decreases certainty in model predictions. Here, we use Bayesian multimodel inference to develop a framework to increase certainty in systems biology models. Using models of the extracellular regulated kinase (ERK) pathway, we first show that multimodel inference increases predictive certainty and yields predictors that are robust to changes in the set of available models. We then show that predictions made with multi-model inference are robust to data uncertainties introduced by decreasing the measurement duration and reducing the sample size. Finally, we use multimodel inference to identify a new model to explain experimentally measured sub-cellular location-specific ERK activity dynamics. In summary, our framework highlights multimodel inference as a disciplined approach to increasing the certainty of intracellular signaling activity predictions.",
        "posted": "June 17, 2024"
    },
    {
        "title": "Decomposed Linear Dynamical Systems (dLDS) models reveal context-dependent dynamic connectivity in C. elegans",
        "authors": "Eva Yezerets, Noga Mudrik, Adam S. Charles",
        "doi": "https://doi.org/10.1101/2024.05.31.596903",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.31.596903v1.full.pdf",
        "abstract": "Despite innumerable efforts to characterize C. elegans neural activity and behavior, the roles of each individual neuron and the compositional mechanisms of all their interactions are still not completely known. In particular, there is evidence that C. elegans neurons perform changing roles over time, in different behavioral contexts, etc.; however, existing stationary anatomical and functional connectivity can average across time and obfuscate the nonstationary nature of the neural dynamics. We contribute to these efforts by leveraging recent advances in decomposed linear dynamical systems (dLDS) models. dLDS models neural dynamics in a latent space with a set of linear operators that can be recombined and reused over time, enabling the discovery of multiple parallel neural processes on different timescales. We leverage the ability to identify reused patterns of dynamical neural interactions, which we call “dynamical connectivity,” to 1) identify contextually dependent roles of neurons; 2) discover the underlying variability of neural representations even under discrete behaviors; 3) quantify differences between anatomical, functional, and dynamical connectivity; and 4) learn a single aligned latent space underlying multiple individual worms’ activity. These results highlight the importance of defining a neuron’s functions not solely by its internal activity or place in a time-averaged network, but by its evolving interactions across context-dependent circuits.",
        "posted": "June 01, 2024"
    },
    {
        "title": "Functional Control of Network Dynamical Systems: An Information Theoretic Approach",
        "authors": "Moirangthem Sailash Singh, Ramkrishna Pasumarthy, Umesh Vaidya, Steffen Leonhardt",
        "doi": "https://doi.org/10.1101/2024.06.17.599263",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.06.17.599263v1.full.pdf",
        "abstract": "In neurological networks, the emergence of various causal interactions and information flows among nodes is governed by the structural connectivity in conjunction with the node dynamics. The information flow describes the direction and the magnitude of an excitatory neuron’s influence to the neighbouring neurons. However, the intricate relationship between network dynamics and information flows is not well understood. Here, we address this challenge by first identifying a generic mechanism that defines the evolution of various information routing patterns in response to modifications in the underlying network dynamics. Moreover, with emerging techniques in brain stimulation, designing optimal stimulation directed towards a target region with an acceptable magnitude remains an ongoing and significant challenge. In this work, we also introduce techniques for computing optimal inputs that follow a desired stimulation routing path towards the target brain region. This optimization problem can be efficiently resolved using non-linear programming tools and permits the simultaneous assignment of multiple desired patterns at different instances. We establish the algebraic and graph-theoretic conditions necessary to ensure the feasibility and stability of information routing patterns (IRPs). We illustrate the routing mechanisms and control methods for attaining desired patterns in biological oscillatory dynamics. Author Summary A complex network is described by collection of subsystems or nodes, often exchanging information among themselves via fixed interconnection pattern or structure of the network. This combination of nodes, interconnection structure and the information exchange enables the overall network system to function. These information exchange patterns change over time and switch patterns whenever a node or set of nodes are subject to external perturbations or stimulations. In many cases one would want to drive the system to desired information patterns, resulting in desired network system behaviour, by appropriately designing the perturbating signals. We present mathematical framework to design perturbation signals that drive the system to the desired behaviour. We demonstrate the applicability of our framework in the context of brain stimulation and in modifying causal interactions in gene regulatory networks.",
        "posted": "June 17, 2024"
    },
    {
        "title": "Multivalent binding model quantifies antibody species from systems serology",
        "authors": "Armaan A. Abraham, Zhixin Cyrillus Tan, Priyanka Shrestha, Emily R. Bozich, Aaron S. Meyer",
        "doi": "https://doi.org/10.1101/2024.07.05.602296",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.07.05.602296v1.full.pdf",
        "abstract": "Systems serology aims to broadly profile the antigen binding, Fc biophysical features, immune receptor engagement, and effector functions of antibodies. This experimental approach excels at identifying antibody functional features that are relevant to a particular disease. However, a crucial limitation of this approach is its incomplete description of what structural features of the antibodies are responsible for the observed immune receptor engagement and effector functions. Knowing these antibody features is important for both understanding how effector responses are naturally controlled through antibody Fc structure and designing antibody therapies with specific effector profiles. Here, we address this limitation by modeling the molecular interactions occurring in these assays and using this model to infer quantities of specific antibody species among the antibodies being profiled. We used several validation strategies to show that the model accurately infers antibody properties. We then applied the model to infer previously unavailable antibody fucosylation information from existing systems serology data. Using this capability, we find that COVID-19 vaccine efficacy is associated with the induction of afucosylated spike protein-targeting IgG. Our results also question an existing assumption that controllers of HIV exhibit gp120-targeting IgG that are less fucosylated than those of progressors. Additionally, we confirm that afucosylated IgG is associated with membrane-associated antigens for COVID-19 and HIV, and present new evidence indicating that this relationship is specific to the host cell membrane. Finally, we use the model to identify redundant assay measurements and subsets of information-rich measurements from which they can be inferred. In total, our modeling approach provides a quantitative framework for the reasoning typically applied in these studies, improving the ability to draw mechanistic conclusions from these data. Author summary Antibodies play an important role in our immune response by binding to pathogens and engaging other immune cells to eliminate threats. Mounting evidence points toward the importance of which immune cells are being engaged by antibodies in determining the effectiveness of an immune response. While sophisticated experimental methods such as systems serology have been developed to broadly profile the engagement activities of antibodies, determining the presence of antibody structural features relevant to immune engagement remains challenging. Our study addresses this gap by developing a computational model that interprets data from systems serology, allowing us to infer detailed, engagement-relevant structural information about antibodies that are difficult to measure directly. We applied our approach to existing data from COVID-19 and HIV studies, revealing new insights into how antibody structure relates to vaccine efficacy and disease progression. For instance, we found that COVID-19 vaccine effectiveness is linked to the production of certain antibodies lacking a sugar residue called fucose. Our model also helps identify which measurements in systems serology are most informative, potentially streamlining future studies. This work enhances our ability to understand antibody function in disease and may guide the development of more effective antibody-based therapies.",
        "posted": "July 10, 2024"
    },
    {
        "title": "Bridging model and experiment in systems neuroscience with Cleo: the Closed-Loop, Electrophysiology, and Optophysiology simulation testbed",
        "authors": "Kyle A. Johnsen, Nathanael A. Cruzado, Zachary C. Menard, Adam A. Willats, Adam S. Charles, Jeffrey E. Markowitz, Christopher J. Rozell",
        "doi": "https://doi.org/10.1101/2023.01.27.525963",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2023.01.27.525963v2.full.pdf",
        "abstract": "Systems neuroscience has experienced an explosion of new tools for reading and writing neural activity, enabling exciting new experiments such as all-optical or closed-loop control that effect powerful causal interventions. At the same time, improved computational models are capable of reproducing behavior and neural activity with increasing fidelity. Unfortunately, these advances have drastically increased the complexity of integrating different lines of research, resulting in the missed opportunities and untapped potential of suboptimal experiments. Experiment simulation can help bridge this gap, allowing model and experiment to better inform each other by providing a low-cost testbed for experiment design, model validation, and methods engineering. Specifically, this can be achieved by incorporating the simulation of the experimental interface into our models, but no existing tool integrates optogenetics, two-photon calcium imaging, electrode recording, and flexible closed-loop processing with neural population simulations. To address this need, we have developed Cleo: the Closed-Loop, Electrophysiology, and Optophysiology experiment simulation testbed. Cleo is a Python package enabling injection of recording and stimulation devices as well as closed-loop control with realistic latency into a Brian spiking neural network model. It is the only publicly available tool currently supporting two-photon and multi-opsin/wavelength optogenetics. To facilitate adoption and extension by the community, Cleo is open-source, modular, tested, and documented, and can export results to various data formats. Here we describe the design and features of Cleo, validate output of individual components and integrated experiments, and demonstrate its utility for advancing optogenetic techniques in prospective experiments using previously published systems neuroscience models.",
        "posted": "July 09, 2024"
    },
    {
        "title": "BayesianSSA: a Bayesian statistical model based on structural sensitivity analysis for predicting responses to enzyme perturbations in metabolic networks",
        "authors": "Shion Hosoda, Hisashi Iwata, Takuya Miura, Maiko Tanabe, Takashi Okada, Atsushi Mochizuki, Miwa Sato",
        "doi": "https://doi.org/10.1101/2024.03.14.585120",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.14.585120v3.full.pdf",
        "abstract": "Background Chemical bioproduction has attracted attention as a key technology in a decarbonized society. In computational design for chemical bioproduction, it is necessary to predict changes in metabolic fluxes when up-/down-regulating enzymatic reactions, that is, responses of the system to enzyme perturbations. Structural sensitivity analysis (SSA) was previously developed as a method to predict qualitative responses to enzyme perturbations on the basis of the structural information of the reaction network. However, the network structural information can sometimes be insufficient to predict qualitative responses unambiguously, which is a practical issue in bioproduction applications. To address this, in this study, we propose BayesianSSA, a Bayesian statistical model based on SSA. BayesianSSA extracts environmental information from perturbation datasets collected in environments of interest and integrates it into SSA predictions. Results We applied BayesianSSA to synthetic and real datasets of the central metabolic pathway of Escherichia coli. Our result demonstrates that BayesianSSA can successfully integrate environmental information extracted from perturbation data into SSA predictions. In addition, the posterior distribution estimated by BayesianSSA can be associated with the known pathway reported to enhance succinate export flux in previous studies. Conclusions We believe that BayesianSSA will accelerate the chemical bioproduction process and contribute to advancements in the field.",
        "posted": "July 24, 2024"
    },
    {
        "title": "Combining systems and synthetic biology for in vivo enzymology",
        "authors": "Sara Castaño-Cerezo, Alexandre Chamas, Hanna Kulyk, Christian Treitz, Floriant Bellvert, Andreas Tholey, Virginie Galéote, Carole Camarasa, Stéphanie Heux, Luis F. Garcia-Alles, Pierre Millard, Gilles Truan",
        "doi": "https://doi.org/10.1101/2024.02.02.578620",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.02.02.578620v4.full.pdf",
        "abstract": "Enzymatic parameters are classically determined in vitro, under conditions that are far from those encountered in cells, casting doubt on their physiological relevance. We developed a generic approach combining tools from synthetic and systems biology to measure enzymatic parameters in vivo. In the context of a synthetic carotenoid pathway in Saccharomyces cerevisiae, we focused on a phytoene synthase and three phytoene desaturases, which are difficult to study in vitro. We designed, built, and analyzed a collection of yeast strains mimicking substantial variations in substrate concentration by strategically manipulating the expression of geranyl-geranyl pyrophosphate (GGPP) synthase. We successfully determined in vivo Michaelis-Menten parameters (KM, Vmax and kcat) for GGPP-converting phytoene synthase from absolute metabolomics, fluxomics and proteomics data, highlighting differences between in vivo and in vitro parameters. Leveraging the versatility of the same set of strains, we then extracted enzymatic parameters for two of the three phytoene desaturases. Our approach demonstrates the feasibility of assessing enzymatic parameters directly in vivo, providing a novel perspective on the kinetic characteristics of enzymes in real cellular conditions.",
        "posted": "August 01, 2024"
    },
    {
        "title": "Kinetic Diagram Analysis: A Python Library for Calculating Steady-State Observables of Biochemical Systems Analytically",
        "authors": "Nikolaus Carl Awtrey, Oliver Beckstein",
        "doi": "https://doi.org/10.1101/2024.05.27.596119",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.27.596119v2.full.pdf",
        "abstract": "Kinetic diagrams are commonly used to represent biochemical systems in order to study phenomena such as free energy transduction and ion selectivity. While numerical methods are commonly used to analyze such kinetic networks, the diagram method by King, Altman and Hill makes it possible to construct exact algebraic expressions for steady-state observables in terms of the rate constants of the kinetic diagram. However, manually obtaining these expressions becomes infeasible for models of even modest complexity as the number of the required intermediate diagrams grows with the factorial of the number of states in the diagram. We developed Kinetic Diagram Analysis (KDA), a Python library that programmatically generates the relevant diagrams and expressions from a user-defined kinetic diagram. KDA outputs symbolic expressions for state probabilities and cycle fluxes at steady-state that can be symbolically manipulated and evaluated to quantify macroscopic system observables. We demonstrate the KDA approach for examples drawn from the biophysics of active secondary transmembrane transporters. For a generic 6-state antiporter model, we show how the introduction of a single leakage transition reduces transport efficiency by quantifying substrate turnover. We apply KDA to a real-world example, the 8-state free exchange model of the small multidrug resistance transporter EmrE of Hussey et al (J General Physiology 152 (2020), e201912437), where a change in transporter phenotype is achieved by biasing two different subsets of kinetic rates: alternating access and substrate unbinding rates. KDA is made available as open source software under the GNU General Public License version 3.",
        "posted": "August 04, 2024"
    },
    {
        "title": "Targeting Norepinephrine Neurons of the Locus Coeruleus: A Comparison of Model Systems and Strategies",
        "authors": "Chantal Wissing, Lena S. Eschholz, Maxime Maheu, Kathrin Sauter, Fabio Morellini, Simon Wiegert, Alexander Dieter",
        "doi": "https://doi.org/10.1101/2022.01.22.477348",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2022.01.22.477348v2.full.pdf",
        "abstract": "The locus coeruleus (LC) norepinephrine (NE) system is involved in a variety of physiological and pathophysiological processes. Refining our understanding of LC function largely relies on selective transgene expression in molecularly defined cells, allowing targeted manipulation and readout of noradrenergic neurons. Here, we performed a side-by-side comparison of the most commonly used strategies to genetically target the LC, including different cre driver lines and promoter-mediated transgene expression. We report differences between these strategies in terms of transgene expression efficacy and molecular specificity. Notably, we found no behavioral alterations in cre-expressing mice of any mouse line compared to wild-type littermates. Finally, to further facilitate the investigation of LC-NE function, we have created a suite of constructs, including reporter proteins and calcium indicators in two different spectra, whose expression is mediated by the previously described PRS×8 promoter. These constructs allow identification and monitoring of LC-NE activity either in wild-type mice, or in combination with tissue-specific manipulations of different cre driver lines. The results of our study are crucial for the interpretation of previous experiments using the respective targeting strategies, as well as for the design of future studies. Highlights – Heterogeneous expression patterns with different targeting strategies for LC-NE neurons – Substantial ectopic transgene expression observed in some approaches – No behavioral alterations in heterozygous cre mice as compared to wild-types – PRS×8-driven reporter proteins and calcium indicators as a resource to investigate LC function",
        "posted": "August 30, 2024"
    },
    {
        "title": "Discovering Governing Equations of Biological Systems through Representation Learning and Sparse Model Discovery",
        "authors": "Mehrshad Sadria, Vasu Swaroop",
        "doi": "https://doi.org/10.1101/2024.09.19.613953",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.19.613953v1.full.pdf",
        "abstract": "Understanding the governing rules of complex biological systems remains a significant challenge due to the nonlinear, high-dimensional nature of biological data. In this study, we present CLERA, a novel end-to-end computational framework designed to uncover parsimonious dynamical models and identify active gene programs from single-cell RNA sequencing data. By integrating a supervised autoencoder architecture with Sparse Identification of Nonlinear Dynamics, CLERA leverages prior knowledge to simultaneously extract related low-dimensional embeddings and uncovers the underlying dynamical systems that drive the processes. Through the analysis of both synthetic and biological datasets, CLERA demonstrates robust performance in reconstructing gene expression dynamics, identifying key regulatory genes, and capturing temporal patterns across distinct cell types. CLERA’s ability to generate dynamic interaction networks, combined with network rewiring using Personalized PageRank to highlight central genes and active gene programs, offers new insights into the complex regulatory mechanisms underlying cellular processes.",
        "posted": "September 23, 2024"
    },
    {
        "title": "Parasitic and Commensal interactions among Mimiviruses, Sputnik-like virophages, and Transpovirons: A theoretical and dynamical systems approach",
        "authors": "Emmanuel Ortega-Atehortúa, Nicole Rivera Parra, Boris A. Rodríguez, Gloria Machado-Rodríguez, Juan Camilo Arboleda Rivera",
        "doi": "https://doi.org/10.1101/2024.09.13.610890",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.13.610890v1.full.pdf",
        "abstract": "Giant viruses have been in the scope of virologists since 2003 when they were isolated from Acanthamoeba spp. Giant viruses, in turn, get infected by another virus named virophage and a third biological entity that corresponds to a transpoviron which can be found in the capsids of giant and virophage viruses. So far, transpovirons seem to behave as commensal entities while some virophages exhibit commensal behavior under laboratory conditions. To study the system’s behavior, we used a theoretical approximation and developed an ordinary differential equation model. The dynamical analysis showed that the system exhibits an oscillatory robust behavior leading to a hyperparasitic Lotka-Volterra dynamic. But the biological mechanism that underlines the transpoviron persistence over time remains unclear and its status as a commensal entity needs further assessment. Also, the ecological interaction that leads to the overall coexistence of the three viral entities needs to be further studied.",
        "posted": "September 14, 2024"
    },
    {
        "title": "Human Neural Organoid Microphysiological Systems Show the Building Blocks Necessary for Basic Learning and Memory",
        "authors": "Dowlette-Mary Alam El Din, Leah Moenkemoeller, Alon Loeffler, Forough Habibollahi, Jack Schenkman, Amitav Mitra, Tjitse van der Molen, Lixuan Ding, Jason Laird, Maren Schenke, Erik C. Johnson, Brett J. Kagan, Thomas Hartung, Lena Smirnova",
        "doi": "https://doi.org/10.1101/2024.09.17.613333",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.17.613333v1.full.pdf",
        "abstract": "Brain Microphysiological Systems including neural organoids derived from human induced pluripotent stem cells offer a unique lens to study the intricate workings of the human brain. This paper investigates the foundational elements of learning and memory in neural organoids, also known as Organoid Intelligence by quantifying immediate early gene expression, synaptic plasticity, neuronal network dynamics, and criticality to demonstrate the utility of these organoids in basic science research. Neural organoids showed synapse formation, glutamatergic and GABAergic receptor expression, immediate early gene expression basally and evoked, functional connectivity, criticality, and synaptic plasticity in response to theta-burst stimulation. In addition, pharmacological interventions on GABAergic and glutamatergic receptors, and input specific theta-burst stimulation further shed light on the capacity of neural organoids to mirror synaptic modulation and short-term potentiation, demonstrating their potential as tools for studying neurophysiological and neurological processes and informing therapeutic strategies for diseases. Graphical AbstractOverview of the main components of the experiments conducted. Figure created using BioRender.com.",
        "posted": "September 19, 2024"
    },
    {
        "title": "Data-driven model discovery and model selection for noisy biological systems",
        "authors": "Xiaojun Wu, MeiLu McDermott, Adam L. MacLean",
        "doi": "https://doi.org/10.1101/2024.10.03.616508",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.03.616508v1.full.pdf",
        "abstract": "Biological systems exhibit complex dynamics that differential equations can often adeptly represent. Ordinary differential equation models are widespread; until recently their construction has required extensive prior knowledge of the system. Machine learning methods offer alternative means of model construction: differential equation models can be learnt from data via model discovery using sparse identification of nonlinear dynamics (SINDy). However, SINDy struggles with realistic levels of biological noise and does not incorporate prior knowledge of the system. We propose a data-driven framework for model discovery and model selection using hybrid dynamical systems: partial models containing missing terms. Neural networks are used to approximate the unknown dynamics of a system, enabling the denoising the data while simultaneously learning the latent dynamics. Simulations from the fitted neural network are then used to infer models using SINDy. We show, via model selection, that model discovery in SINDy with hybrid dynamical systems outperforms alternative approaches. We find it possible to infer models correctly up to high levels of biological noise of different types. We demonstrate the potential to learn models from sparse, noisy data in application to a canonical cell state transition using data derived from single-cell transcriptomics. Overall, this approach provides a practical framework for model discovery in biology in cases where data are noisy and sparse, of particular utility when the underlying biological mechanisms are partially but incompletely known.",
        "posted": "October 04, 2024"
    },
    {
        "title": "Multifunctional Systems in Synthetic Biology: Single-Stranded DNA Signaling for Precise Control of Gene Activation",
        "authors": "Brian Ng, Yuying Ding, Matthew Cornall, Ravinash Krishna Kumar, Yujia Qing, Hagan Bayley",
        "doi": "https://doi.org/10.1101/2024.10.20.619289",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.20.619289v1.full.pdf",
        "abstract": "Controllable gene circuits that respond to defined inputs are essential tools in synthetic biology. By leveraging regulatory mechanisms at either transcriptional or translational levels, synthetic responsive systems have been engineered to recognize diverse signals, such as small molecules (e.g., tetracycline) or physical stimuli (e.g., light). However, these approaches have limitations: small-molecule signals often require high concentrations to be effective, and sophisticated engineering is needed to generate responsive effectors. Here, we establish a simple, versatile gene activation system in which short single-stranded DNAs trigger RNA or protein production by complementing defective single-stranded promoters upstream of target genes. We demonstrate selective gene activation with orthogonal promoters, and logic-gate operations with signal pairs. The signaling system operates in compartmentalized nanoliter droplets scaffolded by bilayers. Signal delivery is controlled by selectively disrupting bilayers or applying transmembrane potential to move signals through protein pores, thereby activating genes within the receiver compartments. This work expands the toolset for engineering multifunctional, responsive materials to meet biotechnological and medical needs, enabling gene activation in response to specific cues.",
        "posted": "October 21, 2024"
    },
    {
        "title": "An integrative systems-biology approach defines mechanisms of Alzheimer’s disease neurodegeneration",
        "authors": "Matthew J Leventhal, Camila A Zanella, Byunguk Kang, Jiajie Peng, David Gritsch, Zhixiang Liao, Hassan Bukhari, Tao Wang, Ping-Chieh Pao, Serwah Danquah, Joseph Benetatos, Ralda Nehme, Samouil Farhi, Li-Huei Tsai, Xianjun Dong, Clemens R Scherzer, Mel B Feany, Ernest Fraenkel",
        "doi": "https://doi.org/10.1101/2024.03.17.585262",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.17.585262v2.full.pdf",
        "abstract": "Despite years of intense investigation, the mechanisms underlying neuronal death in Alzheimer’s disease, the most common neurodegenerative disorder, remain incompletely understood. To define relevant pathways, we integrated the results of an unbiased, genome-scale forward genetic screen for age-associated neurodegeneration in Drosophila with human and Drosophila Alzheimer’s disease-associated multi-omics. We measured proteomics, phosphoproteomics, and metabolomics in Drosophila models of Alzheimer’s disease and identified Alzheimer’s disease human genetic variants that modify expression in disease-vulnerable neurons. We used a network optimization approach to integrate these data with previously published Alzheimer’s disease multi-omic data. We computationally predicted and experimentally demonstrated how HNRNPA2B1 and MEPCE enhance tau-mediated neurotoxicity. Furthermore, we demonstrated that the screen hits CSNK2A1 and NOTCH1 regulate DNA damage in Drosophila and human iPSC-derived neural progenitor cells. Our work identifies candidate pathways that could be targeted to ameliorate neurodegeneration in Alzheimer’s disease.",
        "posted": "October 09, 2024"
    },
    {
        "title": "Disentangling the Roles of Distinct Cell Classes with Cell-Type Dynamical Systems",
        "authors": "Aditi Jha, Diksha Gupta, Carlos D. Brody, Jonathan W. Pillow",
        "doi": "https://doi.org/10.1101/2024.07.08.602520",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.07.08.602520v2.full.pdf",
        "abstract": "Latent dynamical systems have been widely used to characterize the dynamics of neural population activity in the brain. However, these models typically ignore the fact that the brain contains multiple cell types. This limits their ability to capture the functional roles of distinct cell classes, and to predict the effects of cell-specific perturbations on neural activity or behavior. To overcome these limitations, we introduce the “cell-type dynamical systems” (CTDS) model. This model extends latent linear dynamical systems to contain distinct latent variables for each cell class, with biologically inspired constraints on both dynamics and emissions. To illustrate our approach, we consider neural recordings with distinct excitatory (E) and inhibitory (I) populations. The CTDS model defines separate latents for both cell types, and constrains the dynamics so that E (I) latents have a strictly positive (negative) effects on other latents. We applied CTDS to recordings from rat frontal orienting fields (FOF) and anterior dorsal striatum (ADS) during an auditory decision-making task. The model achieved higher accuracy than a standard linear dynamical system (LDS), and revealed that the animal’s choice can be decoded from both E and I latents and thus is not restricted to a single cell-class. We also performed in-silico optogenetic perturbation experiments in the FOF and ADS, and found that CTDS was able to replicate the experimentally observed effects of different perturbations on behavior, whereas a standard LDS model—which does not differentiate between cell types—did not. Crucially, our model allowed us to understand the effects of these perturbations by revealing the dynamics of different cell-specific latents. Finally, CTDS can also be used to identify cell types for neurons whose class labels are unknown in electrophysiological recordings. These results illustrate the power of the CTDS model to provide more accurate and more biologically interpretable descriptions of neural population dynamics and their relationship to behavior.",
        "posted": "November 05, 2024"
    },
    {
        "title": "A Machine Learning Model of Perturb-Seq Data for Use in Space Flight Gene Expression Profile Analysis",
        "authors": "Liam Johnson, James Casaletto, Sylvain Costes, Caitlin Proctor, Lauren Sanders",
        "doi": "https://doi.org/10.1101/2024.11.28.625741",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.28.625741v1.full.pdf",
        "abstract": "The genetic perturbations caused by spaceflight on biological systems tend to have a system-wide effect which is often difficult to deconvolute into individual signals with specific points of origin. Single cell multi-omic data can provide a profile of the perturbational effects but does not necessarily indicate the initial point of interference within a network. The objective of this project is to take advantage of large scale and genome-wide perturbational or Perturb-Seq datasets by using them to pre-train a generalist machine learning model that is capable of predicting the effects of unseen perturbations in new data. Perturb-Seq datasets are large libraries of single cell RNA sequencing data collected from CRISPR knock out screens in cell culture. The advent of generative machine learning algorithms, particularly transformers, make it an ideal time to re-assess large scale data libraries in order to grasp cell and even organism-wide genomic expression motifs. By tailoring an algorithm to learn the downstream effects of the genetic perturbations, we present a pre-trained generalist model capable of predicting the effects of multiple perturbations in combination, locating points of origin for perturbation in new datasets, predicting the effects of known perturbations in new datasets, and annotation of large-scale network motifs. We demonstrate the utility of this model by identifying key perturbational signatures in RNA sequencing data from spaceflown biological samples from the NASA Open Science Data Repository.",
        "posted": "November 29, 2024"
    },
    {
        "title": "Annotating CryoET Volumes: A Machine Learning Challenge",
        "authors": "Ariana Peck, Yue Yu, Jonathan Schwartz, Anchi Cheng, Utz Heinrich Ermel, Saugat Kandel, Dari Kimanius, Elizabeth Montabana, Daniel Serwas, Hannah Siems, Feng Wang, Zhuowen Zhao, Shawn Zheng, Matthias Haury, David Agard, Clinton Potter, Bridget Carragher, Kyle Harrington, Mohammadreza Paraan",
        "doi": "https://doi.org/10.1101/2024.11.04.621686",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.04.621686v2.full.pdf",
        "abstract": "Cryo-electron tomography (cryoET) has emerged as a powerful structural biology tool for understanding protein complexes in their native cellular environments. Presently, 3D volumes of cellular environments can be acquired in the thousands in a few days where each volume provides a rich and complex cellular landscape. Despite numerous innovations, localizing and identifying the vast majority of protein species in these volumes remains prohibitively difficult. Machine learning based methods provide an opportunity to automate the process of labeling and annotating cryoET volumes. Due to current bottlenecks in the annotation process, and a lack of large standardized datasets, training datasets for machine learning algorithms have been scarce. Here, we present a defined “phantom” sample, along with “ground truth” annotations, that will be the basis of a machine learning challenge to bring cryoET and ML experts together and spur creativity to address this annotation problem. We have also set up a cryoET data portal that provides additional diverse sets of annotated 3D volumes from cryoET experts across the world for the machine learning challenge.",
        "posted": "November 21, 2024"
    },
    {
        "title": "Universal differential equations for systems biology: Current state and open problems",
        "authors": "Maren Philipps, Nina Schmid, Jan Hasenauer",
        "doi": "https://doi.org/10.1101/2024.11.29.626122",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.29.626122v2.full.pdf",
        "abstract": "Universal Differential Equations (UDEs) combine mechanistic differential equations with data-driven artificial neural networks, forming a flexible framework for modelling complex biological systems. This hybrid approach leverages prior knowledge and data to uncover unknown processes and deliver accurate predictions. However, UDEs face challenges in efficient and reliable training due to stiff dynamics and noisy, sparse data common in biology, and in ensuring the interpretability of the parameters of the mechanistic model. We investigate these challenges and evaluate UDE performance on realistic biological scenarios, providing a systematic training pipeline. Our results demonstrate the versatility of UDEs in systems biology and reveal that noise and limited data significantly degrade performance, but regularisation can improve accuracy and interpretability. By addressing key challenges and offering practical solutions, this work advances UDE methodology and underscores its potential in tackling complex problems in systems biology.",
        "posted": "December 17, 2024"
    },
    {
        "title": "Bayesian Occam’s Razor to Optimize Metamodeling for Complex Biological Systems",
        "authors": "Chenxi Wang, Jihui Zhao, Jingjing Zheng, Barak Raveh, Xuming He, Liping Sun",
        "doi": "https://doi.org/10.1101/2024.05.28.594654",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.28.594654v2.full.pdf",
        "abstract": "Modeling complex biological systems necessitates the integration of vast and multifaceted information spanning various aspects of these systems, and is expected to yield more insights into the system than any of the inputs. Metamodeling, a specialized form of integrative modeling, addresses this by integrating existing models. Developing and optimizing metamodels pose challenges due to the complexities introduced by diverse input models and their inherent uncertainties. In this study, we employ Bayesian formalism to rigorously analyze the propagation of probability throughout the metamodeling process and propose quantitative assessments for it. Building on this, we introduce a method for optimizing metamodeling that adheres to the Bayesian Occam’s razor rationale, by (i) minimizing model uncertainty; (ii) maximizing model consistency; and (iii) reducing model complexity. To illustrate the benefits of this method, we apply it to the dynamic system of glucose-stimulated insulin secretion in pancreatic β-cells. The optimized metamodel delivers more accurate estimates of impaired β-cell dynamics and function in T2D subjects compared to the non-optimized one, underscoring the critical role of optimization in enhancing both model reliability and applicability. This method is implemented through the Integrative Modeling Platform (IMP), facilitating the development of accurate, precise, and sufficiently simple models for a variety of complex systems.",
        "posted": "December 02, 2024"
    },
    {
        "title": "A Mathematical Framework for the Quantitative Analysis of Genetic Buffering",
        "authors": "Jim Karagiannis",
        "doi": "https://doi.org/10.1101/2024.12.09.627635",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.12.09.627635v1.full.pdf",
        "abstract": "Genetic buffering plays a pivotal role in orchestrating the relationship between genotype and phenotype in outbred populations. While high-throughput screens have identified many instances of genetic buffering – through the detection of “synthetic lethality” or “synthetic sickness” – a formal and general method for its quantitative analysis across systems is lacking. In this report, an axiomatic mathematical framework that can be used to classify, quantify, and compare buffering relationships between genes is described. Importantly, this methodology employs a ratio scale as its basis, thereby permitting the definition of a novel neutrality model for gene interaction that is referred to as the “parallel” model. This model does not contradict, and instead complements, the commonly used “product” model (more aptly referred to herein as the “serial” neutrality model). Moreover, simple extensions of this newly developed framework permit the unambiguous definition and classification of gene interactions in a formal, general, and mathematical way. Consequently, the concept of genetic buffering as first conceived by Leland Hartwell becomes a specific case within a comprehensive model of gene interaction.",
        "posted": "December 13, 2024"
    },
    {
        "title": "Systems biology framework for rational design of operational conditions for in vitro / in vivo translation of microphysiological systems",
        "authors": "Jose L. Cadavid, Nikolaos Meimetis, Linda G. Griffith, Douglas A. Lauffenburger",
        "doi": "https://doi.org/10.1101/2025.01.17.633624",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.17.633624v1.full.pdf",
        "abstract": "Preclinical models are used extensively to study diseases and potential therapeutic treatments. Complex in vitro platforms incorporating human cellular components, known as microphysiological systems (MPS), can model cellular and microenvironmental features of diseased tissues. However, determining experimental conditions -- particularly biomolecular cues such as growth factors, cytokines, and matrix proteins -- providing most effective translatability of MPS-generated information to in vivo human subject contexts is a major challenge. Here, using metabolic dysfunction-associated fatty liver disease (MAFLD) studied using the CNBio PhysioMimix as a case study, we developed a machine learning framework called Latent In Vitro to In Vivo Translation (LIV2TRANS) to ascertain how MPS data map to in vivo data, first sharpening translation insights and consequently elucidating experimental conditions that can further enhance translation capability. Our findings in this case study highlight TGFβ as a crucial cue for MPS translatability and indicate that adding JAK-STAT pathway perturbations via interferon stimuli could increase the predictive performance of this MPS in MAFLD studies. Finally, we developed an optimization approach that identified androgen and EGFR signaling as key for maximizing the capacity of this MPS to capture in vivo human biological information germane to MAFLD. More broadly, this work establishes a mathematically principled approach for identifying experimental conditions most beneficially capturing in vivo human-relevant molecular pathways and processes, generalizable to preclinical studies for a wide range of diseases and potential treatments.",
        "posted": "January 22, 2025"
    },
    {
        "title": "Comprehensive analysis of 37 composts: microbial indicators for soilborne disease suppression in three plant-pathogen systems",
        "authors": "Anja Logo, Benedikt Boppré, Jacques Fuchs, Monika Maurhofer, Thomas Oberhänsli, Barbara Thürig, Franco Widmer, Pascale Flury, Johanna Mayerhofer",
        "doi": "https://doi.org/10.1101/2025.01.17.633646",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.17.633646v1.full.pdf",
        "abstract": "Soilborne diseases pose a significant threat to crop production and their control remains a major challenge. Compost is a valuable soil amendment when it comes to suppressing soilborne pathogens, but the effectiveness of different composts varies and cannot yet be predicted. Microbial communities in compost play a key role in disease suppression, and therefore microbial taxa may serve as indicators for suppressive composts. In this study, we investigated 37 composts from seven commercial compost producers to analyze the association of their bacterial and fungal communities with disease-suppressive activity across three plant-pathogen systems: cress-Globisporanigum ultimum, cucumber-Globisporanigum ultimum and cucumber-Rhizoctonia solani. Our results underscore that compost suppressiveness is primarily pathogen-specific and, to a smaller extent, hostplant-specific. Suppressiveness was not found to be correlated to physicochemical properties or microbial activity, alpha- and beta-diversity of the composts. However, specific bacterial and a few fungal taxa were identified as potential indicators of suppression for each plant-pathogen system. Notably, for G. ultimum-suppression, bacteria from the genera Luteimonas, Sphingopyxis, and Algoriphagus emerged as promising candidates. These findings provide a foundation for targeted microbial isolation, aiming to elucidate the role of microorganisms in compost-mediated disease suppression, and to predict and optimize suppressive activity.",
        "posted": "January 18, 2025"
    },
    {
        "title": "Hybrid Generative Model: Bridging Machine Learning and Biophysics to Expand RNA Functional Diversity",
        "authors": "Vaitea Opuu",
        "doi": "https://doi.org/10.1101/2025.01.20.633900",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.20.633900v1.full.pdf",
        "abstract": "The RNA world hypothesis suggests that RNA once catalyzed reactions now performed by proteins. Rediscovering these functions requires exploring sequence spaces beyond natural RNAs. While machine learning (ML)-based RNA design shows promise, it struggles to extrapolate beyond training data. In contrast, biophysics-based approaches leveraging RNA secondary (2D) structure operate independently of training data but are not tailored for functional discovery. We present a hybrid generative model that combines a Potts model with the thermodynamic folding model of RNA 2D structure. This approach disentangles folding contributions from functional signals, such as binding, enabling the data-driven component to focus on tertiary interactions and improving contact predictions. This disentanglement introduces structural imprinting—a novel strategy that uses structural variability to guide mutations, which showed great promise in uncovering hidden natural diversity. By bridging ML and biophysics, this model tackles the longstanding challenge of expanding diversity beyond the mere reproduction of the training data.",
        "posted": "January 22, 2025"
    },
    {
        "title": "Dual process impairments in reinforcement learning and working memory systems underlie learning deficits in physiological anxiety",
        "authors": "Jennifer Senta, Sonia Bishop, Anne GE Collins",
        "doi": "https://doi.org/10.1101/2025.02.14.638024",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.14.638024v1.full.pdf",
        "abstract": "Anxiety has been robustly linked to deficits in frontal executive function including working memory (WM) and attentional control processes. However, although anxiety has also been associated with impaired performance on learning tasks, computational investigations of reinforcement learning (RL) impairment in anxiety have yielded mixed results. WM processes are known to contribute to learning behavior in parallel to RL processes and to modulate the effective learning rate as a function of load. However, WM processes have typically not been modeled in investigations of anxiety and RL. In the current study, we leveraged an experimental paradigm (RLWM) which manipulates the relative contributions of WM and RL processes in a reinforcement learning and retention task using multiple stimulus set sizes. Using a computational model of interactive RL and WM processes, we investigated whether individual differences in physiological or cognitive anxiety impacted task performance via deficits in RL or WM. Elevated physiological, but not cognitive, anxiety scores were strongly associated with worse performance during learning and retention testing across all set sizes. Computationally, higher physiological anxiety scores were significantly related to reduced learning rate and increased rate of WM decay. To highlight the importance of modeling WM contributions to learning, we considered the effect of fitting RL models without WM modules to the data. Here we found that reduced learning performance for higher physiological anxiety was at least partially misattributed to stochastic decision noise in 9 out of 10 RL-only models considered. These findings reveal a dual-process impairment in learning in anxiety that is linked to a more physiological than cognitive anxiety phenotype. More broadly, this work also points to the importance of accounting for the contribution of WM to RL when investigating psychopathology-related deficits in learning.",
        "posted": "February 14, 2025"
    },
    {
        "title": "Sleep Resolves Competition Between Explicit and Implicit Memory Systems",
        "authors": "Katja Kleespies, Philipp C. Paulus, Hao Zhu, Florian Pargent, Marie Jakob, Jana Werle, Michael Czisch, Joschka Boedecker, Steffen Gais, Monika Schönauer",
        "doi": "https://doi.org/10.1101/2025.02.21.639581",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.21.639581v1.full.pdf",
        "abstract": "Sleep supports stabilization of explicit, declarative memory and benefits implicit, procedural memory. In addition, sleep may change the quality of memory representations. Explicit and implicit learning systems, usually linked to the hippocampus and striatum, can compete during learning, but whether they continue to interact during offline periods remains unclear. Here, we investigate for feedback-driven classification learning, whether sleep integrates explicit and implicit aspects of memory. The negative relationship between implicit and explicit memory components was resolved over sleep, but not wakefulness. Additionally, sleep benefitted performance on a task that allows the cooperative use of explicit and implicit memory, and participants who slept showed superior performance in generalizing their knowledge to unseen exemplars. A reinforcement learning model relates this to better transfer of the learned exemplar value representation after sleep. This suggests that sleep integrates information learned by different routes and helps us respond optimally to everyday life contingencies.",
        "posted": "February 25, 2025"
    },
    {
        "title": "Thermodynamic uncertainty relation constraints information transmission through cell signaling systems",
        "authors": "Shreyansh Verma, Vishva Saravanan R, Bhaswar Ghosh",
        "doi": "https://doi.org/10.1101/2025.01.04.631284",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.04.631284v2.full.pdf",
        "abstract": "Biological systems in general operates out of equilibrium which demands the requirement for constant supply of energy due to non-equilibrium entropy production. The thermodynamic uncertainty relation (TUR) essentially imposes a bound on minimum current fluctuation the system can have given a entropy production rate. The fluctuation eventually impacts the signal to noise ratio imposing an upper bound on information transmission accuracy. In this study, we explored the role of TUR on the information transmission capacity of a set of cellular signaling systems using a coupled mathematical and machine learning approaches to experimental data in yeast under several stress conditions. Cell signaling systems are involved in sensing the changes in environment by activating a set of transcription factors which typically diffuse inside the nucleus to trigger transcription of the required genes. However, the inherent stochasticity of the biochemical pathways associated with signaling processes severely limits the accuracy of estimating the environmental input by the transcription factors. Application of TUR reveals a general picture about the working principle of the transcription factors. We found that the the activation followed by biased diffusion of transcription factors (TF) towards the nucleus triggers entropy production which amplifies magnitude of the overall TF currents towards the nucleus as well as reduces the fluctuations. These outcomes significantly improve the accuracy of information transmission carried out by the transcription factors following the bound imposed by TUR. Thus, experimental observations coupled with TUR based theoretical models demonstrate the role of thermodynamic fluctuation and entropy production on cellular information processing.",
        "posted": "February 16, 2025"
    }
]