[
    {
        "title": "Spectral methods for prediction uncertainty quantification in Systems Biology",
        "authors": "Anna Deneer, Jaap Molenaar, Christian Fleck",
        "doi": "https://doi.org/10.1101/2023.02.14.528500",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2023.02.14.528500v2.full.pdf",
        "abstract": "Uncertainty is ubiquitous in biological systems. These uncertainties can be the result of lack of knowledge or due to a lack of appropriate data. Additionally, the natural variability of biological systems caused by intrinsic noise, e.g. in stochastic gene expression, leads to uncertainties. With the help of numerical simulations the impact of these uncertainties on the model predictions can be assessed, i.e. the impact of the propagation of uncertainty in model parameters on the model response can be quantified. Taking this into account is crucial when the models are used for experimental design, optimisation, or decision-making, as model uncertainty can have a significant effect on the accuracy of model predictions. We focus here on spectral methods to quantify prediction uncertainty based on a probabilistic framework. Such methods have a basis in, e.g., computational mathematics, engineering, physics, and fluid dynamics, and, to a lesser extent, systems biology. In this chapter, we highlight the advantages these methods can have for modelling purposes in systems biology and do so by providing a novel and intuitive scheme. By applying the scheme to an array of examples we show its power, especially in challenging situations where slow converge due to high-dimensionality, bifurcations, and spatial discontinuities play a role.",
        "posted": "April 03, 2024"
    },
    {
        "title": "RBC-GEM: a Knowledge Base for Systems Biology of Human Red Blood Cell Metabolism",
        "authors": "Zachary B. Haiman, Angelo D’Alessandro, Bernhard O. Palsson",
        "doi": "https://doi.org/10.1101/2024.04.26.591249",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.04.26.591249v1.full.pdf",
        "abstract": "Advancements with cost-effective, high-throughput omics technologies have had a transformative effect on both fundamental and translational research in the medical sciences. These advancements have facilitated a departure from the traditional view of human red blood cells (RBCs) as mere carriers of hemoglobin, devoid of significant biological complexity. Over the past decade, proteomic analyses have identified a growing number of different proteins present within RBCs, enabling systems biology analysis of their physiological functions. Here, we introduce RBC-GEM, the most extensive and meticulously curated metabolic reconstruction of a specific human cell type to-date. It was developed through meta-analysis of proteomic data from 28 studies published over the past two decades resulting in a RBC proteome composed of more than 4,600 distinct proteins. Through workflow-guided manual curation, we have compiled the metabolic reactions carried out by this proteome. RBC-GEM is hosted on a version-controlled GitHub repository, ensuring adherence to the standardized protocols for metabolic reconstruction quality control and data stewardship principles. This reconstruction of the RBC metabolic network is a knowledge base consisting of 718 genes encoding proteins acting on 1,590 unique metabolites through 2,554 biochemical reactions: a 700% size expansion over its predecessor. This reconstruction as an up-to-date curated knowledge base can be used for contextualization of data and for the construction of a computational whole-cell model of a human RBC. Author Summary Human red blood cells (RBCs) have been studied for decades because of their unique physiology, essential oxygen delivery functions, and general accessibility. RBCs are the simplest yet most numerous of human cell types due to the loss of cellular organelles during their development process. This process has evolved to maximize hemoglobin content per cell to facilitate RBCs’ main function in gas transport. RBCs are integral to a variety of medical applications, such as blood storage for transfusion. Recent advancements in high-throughput data collection have greatly expanded our understanding of RBC metabolism, highlighting important roles and functions for RBCs in maintaining homeostasis in the organism in addition to oxygen transport. Here we provide a knowledge base for the human RBC as a genome-scale metabolic reconstruction. Our results highlight the complexity of RBC metabolism, supported by recent advancements in high-throughput data collection methods for detecting low-abundance proteins in RBCs. We make knowledge about the RBC findable, accessible, interoperable, and reusable (FAIR). As RBC research is likely to see many translational medical advancements, a knowledge base for the contextualization of RBC data will serve as an essential resource for further research and medical application development.",
        "posted": "April 28, 2024"
    },
    {
        "title": "Biology System Description Language (BiSDL): a modeling language for the design of multicellular synthetic biological systems",
        "authors": "Leonardo Giannantoni, Roberta Bardini, Alessandro Savino, Stefano Di Carlo",
        "doi": "https://doi.org/10.1101/2024.01.13.575499",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.01.13.575499v2.full.pdf",
        "abstract": "Background The Biology System Description Language (BiSDL) is an accessible, easy-to-use computational language for multicellular synthetic biology. It allows synthetic biologists to represent spatiality and multi-level cellular dynamics inherent to multicellular designs, filling a gap in the state of the art. Developed for designing and simulating spatial, multicellular synthetic biological systems, BiSDL integrates high-level conceptual design with detailed low-level modeling, fostering collaboration in the Design-Build-Test-Learn cycle. BiSDL descriptions directly compile into Nets-Within-Nets (NWNs) models, offering a unique approach to spatial and hierarchical modeling in biological systems. Results BiSDL’s effectiveness is showcased through three case studies on complex multicellular systems: a bacterial consortium, a synthetic morphogen system and a conjugative plasmid transfer process. These studies highlight the BiSDL proficiency in representing spatial interactions and multi-level cellular dynamics. The language facilitates the compilation of conceptual designs into detailed, simulatable models, leveraging the NWNs formalism. This enables intuitive modeling of complex biological systems, making advanced computational tools more accessible to a broader range of researchers. Conclusions BiSDL represents a significant step forward in computational languages for synthetic biology, providing a sophisticated yet user-friendly tool for designing and simulating complex biological systems with an emphasis on spatiality and cellular dynamics. Its introduction has the potential to transform research and development in synthetic biology, allowing for deeper insights and novel applications in understanding and manipulating multicellular systems.",
        "posted": "April 05, 2024"
    },
    {
        "title": "Systems Age: A single blood methylation test to quantify aging heterogeneity across 11 physiological systems",
        "authors": "Raghav Sehgal, Yaroslav Markov, Chenxi Qin, Margarita Meer, Courtney Hadley, Aladdin H. Shadyab, Ramon Casanova, JoAnn E. Manson, Parveen Bhatti, Eileen M. Crimmins, Sara Hagg, Themistocles L. Assimes, Eric A. Whitsel, Albert T. Higgins-Chen, Morgan Levine",
        "doi": "https://doi.org/10.1101/2023.07.13.548904",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2023.07.13.548904v2.full.pdf",
        "abstract": "Individuals, organs, tissues, and cells age in diverse ways throughout the lifespan. Epigenetic clocks attempt to quantify differential aging between individuals, but they typically summarize aging as a single measure, ignoring within-person heterogeneity. Our aim was to develop novel systems-based methylation clocks that, when assessed in blood, capture aging in distinct physiological systems. We combined supervised and unsupervised machine learning methods to link DNA methylation, system-specific clinical chemistry and functional measures, and mortality risk. This yielded a panel of 11 system-specific scores– Heart, Lung, Kidney, Liver, Brain, Immune, Inflammatory, Blood, Musculoskeletal, Hormone, and Metabolic. Each system score predicted a wide variety of outcomes, aging phenotypes, and conditions specific to the respective system. We also combined the system scores into a composite Systems Age clock that is predictive of aging across physiological systems in an unbiased manner. Finally, we showed that the system scores clustered individuals into unique aging subtypes that had different patterns of age-related disease and decline. Overall, our biological systems based epigenetic framework captures aging in multiple physiological systems using a single blood draw and assay and may inform the development of more personalized clinical approaches for improving age-related quality of life.",
        "posted": "May 28, 2024"
    },
    {
        "title": "Deep proteomic analysis of microglia reveals fundamental biological differences between model systems",
        "authors": "Amy F Lloyd, Anna Martinez-Muriana, Emma Davis, Michael JD Daniels, Pengfei Hou, Renzo Mancuso, Alejandro J Brenes, Ivana Geric, An Snellinx, Katleen Craessaerts, Tom Theys, Mark Fiers, Bart De Strooper, Andrew JM Howden",
        "doi": "https://doi.org/10.1101/2022.07.07.498804",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2022.07.07.498804v2.full.pdf",
        "abstract": "Using high resolution quantitative mass spectrometry, we have generated the most comprehensive human and mouse microglia proteomic datasets to date, consisting of over 11,000 proteins across all six microglia groups. Microglia from different sources share a core protein signature of over 5600 proteins, yet fundamental differences are observed between species and culture conditions, indicating limitations for human disease modelling in mouse or in in vitro cultures of microglia. Mouse ex vivo microglia show important differences at the proteome level such as differential expression of inflammation and Alzheimer’s Disease associated proteins. We identify a tenfold difference in the protein content of ex vivo and in vitro cells and significant proteome differences associated with protein synthesis, metabolism, microglia marker expression and environmental sensors. Culturing microglia induces rapidly increased growth, protein content and inflammatory protein expression. These changes can be restored by engrafting in vitro cells into the brain, with xenografted hESC-derived microglia closely resembling microglia from human brain. This data provides an important resource for the field and highlights important considerations needed when using model systems to study human physiology and pathology of microglia.",
        "posted": "May 16, 2024"
    },
    {
        "title": "Use of machine learning for quantification of retinal pigment epithelium tight junctions improves assay sensitivity",
        "authors": "Yan Gao, Mark-Anthony Bray, Michael Twarog, YongYao Xu, Natasha Buchanan, Yiyun Zhang, Quintus Medley, Magali Saint-Geniez, Ganesh Prasanna, Qin Zhang",
        "doi": "https://doi.org/10.1101/2024.05.24.595580",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.24.595580v1.full.pdf",
        "abstract": "The retinal pigment epithelium (RPE) is critical for maintaining outer retinal barrier homeostasis. In age-related macular degeneration (AMD), the RPE can undergo a dedifferentiation process that includes tight junction (TJ) loss and displacement of zonula occludens-1 (ZO-1), which may impair structural and functional integrity of the RPE barrier and contribute to disease pathogenesis. Our objective was to develop an automated and sensitive quantification method for TJ aberrations in an RPE immunofluorescence imaging assay, following treatment with TNFα or TGFβ2. However, quantifying ZO-1 morphological changes in the RPE using standard image analysis methods did not provide a satisfactory assay window. To address this challenge, we developed an imaging assay to quantify ZO-1 changes using a machine learning approach, enabling enhanced phenotypic characterization of the ZO-1 changes in RPE cells and improved assay sensitivity. We were also able to capture and quantify the reversal of these changes using etanercept, an TNFα inhibitor, with this imaging assay. Our findings indicated that this machine learning ZO-1 quantification assay could serve as a potential phenotypic readout for RPE dedifferentiation and enabling large-scale mechanistic studies.",
        "posted": "May 30, 2024"
    },
    {
        "title": "Combining systems and synthetic biology for in vivo enzymology",
        "authors": "Sara Castaño-Cerezo, Alexandre Chamas, Hanna Kulyk, Christian Treitz, Floriant Bellvert, Andreas Tholey, Virginie Galéote, Carole Camarasa, Stéphanie Heux, Luis F. Garcia-Alles, Pierre Millard, Gilles Truan",
        "doi": "https://doi.org/10.1101/2024.02.02.578620",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.02.02.578620v4.full.pdf",
        "abstract": "Enzymatic parameters are classically determined in vitro, under conditions that are far from those encountered in cells, casting doubt on their physiological relevance. We developed a generic approach combining tools from synthetic and systems biology to measure enzymatic parameters in vivo. In the context of a synthetic carotenoid pathway in Saccharomyces cerevisiae, we focused on a phytoene synthase and three phytoene desaturases, which are difficult to study in vitro. We designed, built, and analyzed a collection of yeast strains mimicking substantial variations in substrate concentration by strategically manipulating the expression of geranyl-geranyl pyrophosphate (GGPP) synthase. We successfully determined in vivo Michaelis-Menten parameters (KM, Vmax and kcat) for GGPP-converting phytoene synthase from absolute metabolomics, fluxomics and proteomics data, highlighting differences between in vivo and in vitro parameters. Leveraging the versatility of the same set of strains, we then extracted enzymatic parameters for two of the three phytoene desaturases. Our approach demonstrates the feasibility of assessing enzymatic parameters directly in vivo, providing a novel perspective on the kinetic characteristics of enzymes in real cellular conditions.",
        "posted": "August 01, 2024"
    },
    {
        "title": "Kinetic Diagram Analysis: A Python Library for Calculating Steady-State Observables of Biochemical Systems Analytically",
        "authors": "Nikolaus Carl Awtrey, Oliver Beckstein",
        "doi": "https://doi.org/10.1101/2024.05.27.596119",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.27.596119v2.full.pdf",
        "abstract": "Kinetic diagrams are commonly used to represent biochemical systems in order to study phenomena such as free energy transduction and ion selectivity. While numerical methods are commonly used to analyze such kinetic networks, the diagram method by King, Altman and Hill makes it possible to construct exact algebraic expressions for steady-state observables in terms of the rate constants of the kinetic diagram. However, manually obtaining these expressions becomes infeasible for models of even modest complexity as the number of the required intermediate diagrams grows with the factorial of the number of states in the diagram. We developed Kinetic Diagram Analysis (KDA), a Python library that programmatically generates the relevant diagrams and expressions from a user-defined kinetic diagram. KDA outputs symbolic expressions for state probabilities and cycle fluxes at steady-state that can be symbolically manipulated and evaluated to quantify macroscopic system observables. We demonstrate the KDA approach for examples drawn from the biophysics of active secondary transmembrane transporters. For a generic 6-state antiporter model, we show how the introduction of a single leakage transition reduces transport efficiency by quantifying substrate turnover. We apply KDA to a real-world example, the 8-state free exchange model of the small multidrug resistance transporter EmrE of Hussey et al (J General Physiology 152 (2020), e201912437), where a change in transporter phenotype is achieved by biasing two different subsets of kinetic rates: alternating access and substrate unbinding rates. KDA is made available as open source software under the GNU General Public License version 3.",
        "posted": "August 04, 2024"
    },
    {
        "title": "Targeting Norepinephrine Neurons of the Locus Coeruleus: A Comparison of Model Systems and Strategies",
        "authors": "Chantal Wissing, Lena S. Eschholz, Maxime Maheu, Kathrin Sauter, Fabio Morellini, Simon Wiegert, Alexander Dieter",
        "doi": "https://doi.org/10.1101/2022.01.22.477348",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2022.01.22.477348v2.full.pdf",
        "abstract": "The locus coeruleus (LC) norepinephrine (NE) system is involved in a variety of physiological and pathophysiological processes. Refining our understanding of LC function largely relies on selective transgene expression in molecularly defined cells, allowing targeted manipulation and readout of noradrenergic neurons. Here, we performed a side-by-side comparison of the most commonly used strategies to genetically target the LC, including different cre driver lines and promoter-mediated transgene expression. We report differences between these strategies in terms of transgene expression efficacy and molecular specificity. Notably, we found no behavioral alterations in cre-expressing mice of any mouse line compared to wild-type littermates. Finally, to further facilitate the investigation of LC-NE function, we have created a suite of constructs, including reporter proteins and calcium indicators in two different spectra, whose expression is mediated by the previously described PRS×8 promoter. These constructs allow identification and monitoring of LC-NE activity either in wild-type mice, or in combination with tissue-specific manipulations of different cre driver lines. The results of our study are crucial for the interpretation of previous experiments using the respective targeting strategies, as well as for the design of future studies. Highlights – Heterogeneous expression patterns with different targeting strategies for LC-NE neurons – Substantial ectopic transgene expression observed in some approaches – No behavioral alterations in heterozygous cre mice as compared to wild-types – PRS×8-driven reporter proteins and calcium indicators as a resource to investigate LC function",
        "posted": "August 30, 2024"
    },
    {
        "title": "Discovering Governing Equations of Biological Systems through Representation Learning and Sparse Model Discovery",
        "authors": "Mehrshad Sadria, Vasu Swaroop",
        "doi": "https://doi.org/10.1101/2024.09.19.613953",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.19.613953v1.full.pdf",
        "abstract": "Understanding the governing rules of complex biological systems remains a significant challenge due to the nonlinear, high-dimensional nature of biological data. In this study, we present CLERA, a novel end-to-end computational framework designed to uncover parsimonious dynamical models and identify active gene programs from single-cell RNA sequencing data. By integrating a supervised autoencoder architecture with Sparse Identification of Nonlinear Dynamics, CLERA leverages prior knowledge to simultaneously extract related low-dimensional embeddings and uncovers the underlying dynamical systems that drive the processes. Through the analysis of both synthetic and biological datasets, CLERA demonstrates robust performance in reconstructing gene expression dynamics, identifying key regulatory genes, and capturing temporal patterns across distinct cell types. CLERA’s ability to generate dynamic interaction networks, combined with network rewiring using Personalized PageRank to highlight central genes and active gene programs, offers new insights into the complex regulatory mechanisms underlying cellular processes.",
        "posted": "September 23, 2024"
    },
    {
        "title": "Parasitic and Commensal interactions among Mimiviruses, Sputnik-like virophages, and Transpovirons: A theoretical and dynamical systems approach",
        "authors": "Emmanuel Ortega-Atehortúa, Nicole Rivera Parra, Boris A. Rodríguez, Gloria Machado-Rodríguez, Juan Camilo Arboleda Rivera",
        "doi": "https://doi.org/10.1101/2024.09.13.610890",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.13.610890v1.full.pdf",
        "abstract": "Giant viruses have been in the scope of virologists since 2003 when they were isolated from Acanthamoeba spp. Giant viruses, in turn, get infected by another virus named virophage and a third biological entity that corresponds to a transpoviron which can be found in the capsids of giant and virophage viruses. So far, transpovirons seem to behave as commensal entities while some virophages exhibit commensal behavior under laboratory conditions. To study the system’s behavior, we used a theoretical approximation and developed an ordinary differential equation model. The dynamical analysis showed that the system exhibits an oscillatory robust behavior leading to a hyperparasitic Lotka-Volterra dynamic. But the biological mechanism that underlines the transpoviron persistence over time remains unclear and its status as a commensal entity needs further assessment. Also, the ecological interaction that leads to the overall coexistence of the three viral entities needs to be further studied.",
        "posted": "September 14, 2024"
    },
    {
        "title": "Human Neural Organoid Microphysiological Systems Show the Building Blocks Necessary for Basic Learning and Memory",
        "authors": "Dowlette-Mary Alam El Din, Leah Moenkemoeller, Alon Loeffler, Forough Habibollahi, Jack Schenkman, Amitav Mitra, Tjitse van der Molen, Lixuan Ding, Jason Laird, Maren Schenke, Erik C. Johnson, Brett J. Kagan, Thomas Hartung, Lena Smirnova",
        "doi": "https://doi.org/10.1101/2024.09.17.613333",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.17.613333v1.full.pdf",
        "abstract": "Brain Microphysiological Systems including neural organoids derived from human induced pluripotent stem cells offer a unique lens to study the intricate workings of the human brain. This paper investigates the foundational elements of learning and memory in neural organoids, also known as Organoid Intelligence by quantifying immediate early gene expression, synaptic plasticity, neuronal network dynamics, and criticality to demonstrate the utility of these organoids in basic science research. Neural organoids showed synapse formation, glutamatergic and GABAergic receptor expression, immediate early gene expression basally and evoked, functional connectivity, criticality, and synaptic plasticity in response to theta-burst stimulation. In addition, pharmacological interventions on GABAergic and glutamatergic receptors, and input specific theta-burst stimulation further shed light on the capacity of neural organoids to mirror synaptic modulation and short-term potentiation, demonstrating their potential as tools for studying neurophysiological and neurological processes and informing therapeutic strategies for diseases. Graphical AbstractOverview of the main components of the experiments conducted. Figure created using BioRender.com.",
        "posted": "September 19, 2024"
    },
    {
        "title": "Data-driven model discovery and model selection for noisy biological systems",
        "authors": "Xiaojun Wu, MeiLu McDermott, Adam L. MacLean",
        "doi": "https://doi.org/10.1101/2024.10.03.616508",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.03.616508v1.full.pdf",
        "abstract": "Biological systems exhibit complex dynamics that differential equations can often adeptly represent. Ordinary differential equation models are widespread; until recently their construction has required extensive prior knowledge of the system. Machine learning methods offer alternative means of model construction: differential equation models can be learnt from data via model discovery using sparse identification of nonlinear dynamics (SINDy). However, SINDy struggles with realistic levels of biological noise and does not incorporate prior knowledge of the system. We propose a data-driven framework for model discovery and model selection using hybrid dynamical systems: partial models containing missing terms. Neural networks are used to approximate the unknown dynamics of a system, enabling the denoising the data while simultaneously learning the latent dynamics. Simulations from the fitted neural network are then used to infer models using SINDy. We show, via model selection, that model discovery in SINDy with hybrid dynamical systems outperforms alternative approaches. We find it possible to infer models correctly up to high levels of biological noise of different types. We demonstrate the potential to learn models from sparse, noisy data in application to a canonical cell state transition using data derived from single-cell transcriptomics. Overall, this approach provides a practical framework for model discovery in biology in cases where data are noisy and sparse, of particular utility when the underlying biological mechanisms are partially but incompletely known.",
        "posted": "October 04, 2024"
    },
    {
        "title": "Multifunctional Systems in Synthetic Biology: Single-Stranded DNA Signaling for Precise Control of Gene Activation",
        "authors": "Brian Ng, Yuying Ding, Matthew Cornall, Ravinash Krishna Kumar, Yujia Qing, Hagan Bayley",
        "doi": "https://doi.org/10.1101/2024.10.20.619289",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.20.619289v1.full.pdf",
        "abstract": "Controllable gene circuits that respond to defined inputs are essential tools in synthetic biology. By leveraging regulatory mechanisms at either transcriptional or translational levels, synthetic responsive systems have been engineered to recognize diverse signals, such as small molecules (e.g., tetracycline) or physical stimuli (e.g., light). However, these approaches have limitations: small-molecule signals often require high concentrations to be effective, and sophisticated engineering is needed to generate responsive effectors. Here, we establish a simple, versatile gene activation system in which short single-stranded DNAs trigger RNA or protein production by complementing defective single-stranded promoters upstream of target genes. We demonstrate selective gene activation with orthogonal promoters, and logic-gate operations with signal pairs. The signaling system operates in compartmentalized nanoliter droplets scaffolded by bilayers. Signal delivery is controlled by selectively disrupting bilayers or applying transmembrane potential to move signals through protein pores, thereby activating genes within the receiver compartments. This work expands the toolset for engineering multifunctional, responsive materials to meet biotechnological and medical needs, enabling gene activation in response to specific cues.",
        "posted": "October 21, 2024"
    },
    {
        "title": "An integrative systems-biology approach defines mechanisms of Alzheimer’s disease neurodegeneration",
        "authors": "Matthew J Leventhal, Camila A Zanella, Byunguk Kang, Jiajie Peng, David Gritsch, Zhixiang Liao, Hassan Bukhari, Tao Wang, Ping-Chieh Pao, Serwah Danquah, Joseph Benetatos, Ralda Nehme, Samouil Farhi, Li-Huei Tsai, Xianjun Dong, Clemens R Scherzer, Mel B Feany, Ernest Fraenkel",
        "doi": "https://doi.org/10.1101/2024.03.17.585262",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.17.585262v2.full.pdf",
        "abstract": "Despite years of intense investigation, the mechanisms underlying neuronal death in Alzheimer’s disease, the most common neurodegenerative disorder, remain incompletely understood. To define relevant pathways, we integrated the results of an unbiased, genome-scale forward genetic screen for age-associated neurodegeneration in Drosophila with human and Drosophila Alzheimer’s disease-associated multi-omics. We measured proteomics, phosphoproteomics, and metabolomics in Drosophila models of Alzheimer’s disease and identified Alzheimer’s disease human genetic variants that modify expression in disease-vulnerable neurons. We used a network optimization approach to integrate these data with previously published Alzheimer’s disease multi-omic data. We computationally predicted and experimentally demonstrated how HNRNPA2B1 and MEPCE enhance tau-mediated neurotoxicity. Furthermore, we demonstrated that the screen hits CSNK2A1 and NOTCH1 regulate DNA damage in Drosophila and human iPSC-derived neural progenitor cells. Our work identifies candidate pathways that could be targeted to ameliorate neurodegeneration in Alzheimer’s disease.",
        "posted": "October 09, 2024"
    },
    {
        "title": "Universal differential equations for systems biology: Current state and open problems",
        "authors": "Maren Philipps, Nina Schmid, Jan Hasenauer",
        "doi": "https://doi.org/10.1101/2024.11.29.626122",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.29.626122v2.full.pdf",
        "abstract": "Universal Differential Equations (UDEs) combine mechanistic differential equations with data-driven artificial neural networks, forming a flexible framework for modelling complex biological systems. This hybrid approach leverages prior knowledge and data to uncover unknown processes and deliver accurate predictions. However, UDEs face challenges in efficient and reliable training due to stiff dynamics and noisy, sparse data common in biology, and in ensuring the interpretability of the parameters of the mechanistic model. We investigate these challenges and evaluate UDE performance on realistic biological scenarios, providing a systematic training pipeline. Our results demonstrate the versatility of UDEs in systems biology and reveal that noise and limited data significantly degrade performance, but regularisation can improve accuracy and interpretability. By addressing key challenges and offering practical solutions, this work advances UDE methodology and underscores its potential in tackling complex problems in systems biology.",
        "posted": "December 17, 2024"
    },
    {
        "title": "Bayesian Occam’s Razor to Optimize Metamodeling for Complex Biological Systems",
        "authors": "Chenxi Wang, Jihui Zhao, Jingjing Zheng, Barak Raveh, Xuming He, Liping Sun",
        "doi": "https://doi.org/10.1101/2024.05.28.594654",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.28.594654v2.full.pdf",
        "abstract": "Modeling complex biological systems necessitates the integration of vast and multifaceted information spanning various aspects of these systems, and is expected to yield more insights into the system than any of the inputs. Metamodeling, a specialized form of integrative modeling, addresses this by integrating existing models. Developing and optimizing metamodels pose challenges due to the complexities introduced by diverse input models and their inherent uncertainties. In this study, we employ Bayesian formalism to rigorously analyze the propagation of probability throughout the metamodeling process and propose quantitative assessments for it. Building on this, we introduce a method for optimizing metamodeling that adheres to the Bayesian Occam’s razor rationale, by (i) minimizing model uncertainty; (ii) maximizing model consistency; and (iii) reducing model complexity. To illustrate the benefits of this method, we apply it to the dynamic system of glucose-stimulated insulin secretion in pancreatic β-cells. The optimized metamodel delivers more accurate estimates of impaired β-cell dynamics and function in T2D subjects compared to the non-optimized one, underscoring the critical role of optimization in enhancing both model reliability and applicability. This method is implemented through the Integrative Modeling Platform (IMP), facilitating the development of accurate, precise, and sufficiently simple models for a variety of complex systems.",
        "posted": "December 02, 2024"
    },
    {
        "title": "A Mathematical Framework for the Quantitative Analysis of Genetic Buffering",
        "authors": "Jim Karagiannis",
        "doi": "https://doi.org/10.1101/2024.12.09.627635",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.12.09.627635v1.full.pdf",
        "abstract": "Genetic buffering plays a pivotal role in orchestrating the relationship between genotype and phenotype in outbred populations. While high-throughput screens have identified many instances of genetic buffering – through the detection of “synthetic lethality” or “synthetic sickness” – a formal and general method for its quantitative analysis across systems is lacking. In this report, an axiomatic mathematical framework that can be used to classify, quantify, and compare buffering relationships between genes is described. Importantly, this methodology employs a ratio scale as its basis, thereby permitting the definition of a novel neutrality model for gene interaction that is referred to as the “parallel” model. This model does not contradict, and instead complements, the commonly used “product” model (more aptly referred to herein as the “serial” neutrality model). Moreover, simple extensions of this newly developed framework permit the unambiguous definition and classification of gene interactions in a formal, general, and mathematical way. Consequently, the concept of genetic buffering as first conceived by Leland Hartwell becomes a specific case within a comprehensive model of gene interaction.",
        "posted": "December 13, 2024"
    },
    {
        "title": "Dual process impairments in reinforcement learning and working memory systems underlie learning deficits in physiological anxiety",
        "authors": "Jennifer Senta, Sonia Bishop, Anne GE Collins",
        "doi": "https://doi.org/10.1101/2025.02.14.638024",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.14.638024v1.full.pdf",
        "abstract": "Anxiety has been robustly linked to deficits in frontal executive function including working memory (WM) and attentional control processes. However, although anxiety has also been associated with impaired performance on learning tasks, computational investigations of reinforcement learning (RL) impairment in anxiety have yielded mixed results. WM processes are known to contribute to learning behavior in parallel to RL processes and to modulate the effective learning rate as a function of load. However, WM processes have typically not been modeled in investigations of anxiety and RL. In the current study, we leveraged an experimental paradigm (RLWM) which manipulates the relative contributions of WM and RL processes in a reinforcement learning and retention task using multiple stimulus set sizes. Using a computational model of interactive RL and WM processes, we investigated whether individual differences in physiological or cognitive anxiety impacted task performance via deficits in RL or WM. Elevated physiological, but not cognitive, anxiety scores were strongly associated with worse performance during learning and retention testing across all set sizes. Computationally, higher physiological anxiety scores were significantly related to reduced learning rate and increased rate of WM decay. To highlight the importance of modeling WM contributions to learning, we considered the effect of fitting RL models without WM modules to the data. Here we found that reduced learning performance for higher physiological anxiety was at least partially misattributed to stochastic decision noise in 9 out of 10 RL-only models considered. These findings reveal a dual-process impairment in learning in anxiety that is linked to a more physiological than cognitive anxiety phenotype. More broadly, this work also points to the importance of accounting for the contribution of WM to RL when investigating psychopathology-related deficits in learning.",
        "posted": "February 14, 2025"
    },
    {
        "title": "Sleep Resolves Competition Between Explicit and Implicit Memory Systems",
        "authors": "Katja Kleespies, Philipp C. Paulus, Hao Zhu, Florian Pargent, Marie Jakob, Jana Werle, Michael Czisch, Joschka Boedecker, Steffen Gais, Monika Schönauer",
        "doi": "https://doi.org/10.1101/2025.02.21.639581",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.21.639581v1.full.pdf",
        "abstract": "Sleep supports stabilization of explicit, declarative memory and benefits implicit, procedural memory. In addition, sleep may change the quality of memory representations. Explicit and implicit learning systems, usually linked to the hippocampus and striatum, can compete during learning, but whether they continue to interact during offline periods remains unclear. Here, we investigate for feedback-driven classification learning, whether sleep integrates explicit and implicit aspects of memory. The negative relationship between implicit and explicit memory components was resolved over sleep, but not wakefulness. Additionally, sleep benefitted performance on a task that allows the cooperative use of explicit and implicit memory, and participants who slept showed superior performance in generalizing their knowledge to unseen exemplars. A reinforcement learning model relates this to better transfer of the learned exemplar value representation after sleep. This suggests that sleep integrates information learned by different routes and helps us respond optimally to everyday life contingencies.",
        "posted": "February 25, 2025"
    },
    {
        "title": "Thermodynamic uncertainty relation constraints information transmission through cell signaling systems",
        "authors": "Shreyansh Verma, Vishva Saravanan R, Bhaswar Ghosh",
        "doi": "https://doi.org/10.1101/2025.01.04.631284",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.04.631284v2.full.pdf",
        "abstract": "Biological systems in general operates out of equilibrium which demands the requirement for constant supply of energy due to non-equilibrium entropy production. The thermodynamic uncertainty relation (TUR) essentially imposes a bound on minimum current fluctuation the system can have given a entropy production rate. The fluctuation eventually impacts the signal to noise ratio imposing an upper bound on information transmission accuracy. In this study, we explored the role of TUR on the information transmission capacity of a set of cellular signaling systems using a coupled mathematical and machine learning approaches to experimental data in yeast under several stress conditions. Cell signaling systems are involved in sensing the changes in environment by activating a set of transcription factors which typically diffuse inside the nucleus to trigger transcription of the required genes. However, the inherent stochasticity of the biochemical pathways associated with signaling processes severely limits the accuracy of estimating the environmental input by the transcription factors. Application of TUR reveals a general picture about the working principle of the transcription factors. We found that the the activation followed by biased diffusion of transcription factors (TF) towards the nucleus triggers entropy production which amplifies magnitude of the overall TF currents towards the nucleus as well as reduces the fluctuations. These outcomes significantly improve the accuracy of information transmission carried out by the transcription factors following the bound imposed by TUR. Thus, experimental observations coupled with TUR based theoretical models demonstrate the role of thermodynamic fluctuation and entropy production on cellular information processing.",
        "posted": "February 16, 2025"
    },
    {
        "title": "Integrating Interpretable Machine Learning and Multi-omics Systems Biology for Personalized Biomarker Discovery and Drug Repurposing in Alzheimer’s Disease",
        "authors": "Mohammadsadeq Mottaqi, Pengyue Zhang, Lei Xie",
        "doi": "https://doi.org/10.1101/2025.03.24.644676",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.24.644676v1.full.pdf",
        "abstract": "Background Alzheimer’s disease (AD) is a complex neurodegenerative disorder with substantial molecular variability across different brain regions and individuals, hindering therapeutic development. This study introduces PRISM-ML, an interpretable machine learning (ML) framework integrating multiomics data to uncover patient-specific biomarkers, subtissue-level pathology, and drug repurposing opportunities. Methods We harmonized transcriptomic and genomic data of three independent brain studies containing 2105 post-mortem brain samples (1363 AD, 742 controls) across nine tissues. A Random Forest classifier with SHapley Additive exPlanations (SHAP) identified patient-level biomarkers. Clustering further delineated each tissue into subtissues, and network analysis revealed critical “bottleneck” (hub) genes. Finally, a knowledge graph-based screening identified multi-target drug candidates, and a real-world pharmacoepidemiologic study evaluated their clinical relevance. Results We uncovered 36 molecularly distinct subtissues, each defined by a set of associated unique biomarkers and genetic drivers. Through network analysis of gene-gene interactions networks, we highlighted 262 bottleneck genes enriched in synaptic, cytoskeletal, and membrane-associated processes. Knowledge graph queries identified six FDA-approved drugs predicted to target multiple bottleneck genes and AD-relevant pathways simultaneously. One candidate, promethazine, demonstrated an association with reduced AD incidence in a large healthcare dataset of over 364000 individuals (hazard ratios ≤ 0.43; p < 0.001). These findings underscore the potential for multi-target approaches, reveal connections between AD and cardiovascular pathways, and offer novel insights into the heterogeneous biology of AD. Conclusions PRISM-ML bridges interpretable ML with multi-omics and systems biology to decode AD heterogeneity, revealing region-specific mechanisms and repurposable therapeutics. The validation of promethazine in real-world data underscores the clinical relevance of multi-target strategies, paving the way for more personalized treatments in AD and other complex disorders.",
        "posted": "March 28, 2025"
    },
    {
        "title": "Sensitivity based model agnostic scalable explanations of deep learning",
        "authors": "Manu Aggarwal, NG Cogan, Vipul Periwal",
        "doi": "https://doi.org/10.1101/2025.02.21.639516",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.21.639516v2.full.pdf",
        "abstract": "Deep neural networks (DNNs) are powerful tools for data-driven predictive machine learning, but their complex architecture obscures mechanistic relations that they have learned from data. This information is critical to the scientific method of hypotheses development, experiment design, and model validation, especially when DNNs are used for biological and clinical predictions that affect human health. We design SensX, a model agnostic explainable AI (XAI) framework that outperformed current state-of-the-art XAI in accuracy (up to 52% higher) and computation time (up to 158 times faster), with higher consistency in all cases. It also determines an optimal subset of important input features, reducing dimensionality of further analyses. SensX scaled to explain vision transformer (ViT) models with more than 150, 000 features, which is computationally infeasible for current state-of-the-art XAI. SensX validated that ViT models learned justifiable features as important for different facial attributes of different human faces. SensX revealed biases inherent to the ViT architecture, an observation possible only when importance of each feature is explained. We trained DNNs to annotate biological cell types using single-cell RNA-seq data and SensX determined the sets of genes that the DNNs learned to be important to different cell types.",
        "posted": "March 07, 2025"
    },
    {
        "title": "Aerobicity stimulon in Escherichia coli revealed using multi-scale computational systems biology of adapted respiratory variants",
        "authors": "Arjun Patel, Neha Banwani, Raegan Mink, Divya M. Prabhakaran, Snehal V. Khairnar, Adam M. Feist, Bernhard O. Palsson, Amitesh Anand",
        "doi": "https://doi.org/10.1101/2025.03.13.642450",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.13.642450v1.full.pdf",
        "abstract": "Energy homeostasis facilitated by the interplay of substrate-level and oxidative phosphorylation is crucial for bacterial adaptation to diverse substrates and environments. To investigate how bioenergetic systems optimize under restrictive conditions, we evolved ETS variants with distinct proton-pumping efficiencies (1, 2, 3, or 4 proton(s) per electron) on succinate and glycerol. These substrates impose unique metabolic constraints: succinate requires complete gluconeogenesis, while glycerol supports mixed glycolytic and gluconeogenic fluxes. Multi-scale computational analysis of the strains revealed (a) Growth optimization across carbon substrates for multiple ETS variants, (b) A conserved aerobicity stimulon comprising seven independently regulated gene groups that are co-regulated with increasing aerobic capacities, (c) Proteome reallocation linked to aerobicity, validated using genome-scale metabolism and expression modeling, and (d) Carbon source-specific compensatory mutations in succinate transporters and regulatory elements. These findings define the aerobicity stimulon and establish a unifying framework for understanding bacterial respiratory flexibility, demonstrating how transcriptional networks and metabolic systems integrate to achieve energy homeostasis and bioenergetic resilience.",
        "posted": "March 15, 2025"
    }
]