[
    {
        "title": "Increasing certainty in systems biology models using Bayesian multimodel inference",
        "authors": "Nathaniel Linden-Santangeli, Jin Zhang, Boris Kramer, Padmini Rangamani",
        "doi": "https://doi.org/10.1101/2024.06.16.599231",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.06.16.599231v1.full.pdf",
        "abstract": "Mathematical models are indispensable to the system biology toolkit for studying the structure and behavior of intracellular signaling networks. A common approach to modeling is to develop a system of equations that encode the known biology using approximations and simplifying assumptions. As a result, the same signaling pathway can be represented by multiple models, each with its set of underlying assumptions, which opens up challenges for model selection and decreases certainty in model predictions. Here, we use Bayesian multimodel inference to develop a framework to increase certainty in systems biology models. Using models of the extracellular regulated kinase (ERK) pathway, we first show that multimodel inference increases predictive certainty and yields predictors that are robust to changes in the set of available models. We then show that predictions made with multi-model inference are robust to data uncertainties introduced by decreasing the measurement duration and reducing the sample size. Finally, we use multimodel inference to identify a new model to explain experimentally measured sub-cellular location-specific ERK activity dynamics. In summary, our framework highlights multimodel inference as a disciplined approach to increasing the certainty of intracellular signaling activity predictions.",
        "posted": "June 17, 2024"
    },
    {
        "title": "Functional Control of Network Dynamical Systems: An Information Theoretic Approach",
        "authors": "Moirangthem Sailash Singh, Ramkrishna Pasumarthy, Umesh Vaidya, Steffen Leonhardt",
        "doi": "https://doi.org/10.1101/2024.06.17.599263",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.06.17.599263v1.full.pdf",
        "abstract": "In neurological networks, the emergence of various causal interactions and information flows among nodes is governed by the structural connectivity in conjunction with the node dynamics. The information flow describes the direction and the magnitude of an excitatory neuron’s influence to the neighbouring neurons. However, the intricate relationship between network dynamics and information flows is not well understood. Here, we address this challenge by first identifying a generic mechanism that defines the evolution of various information routing patterns in response to modifications in the underlying network dynamics. Moreover, with emerging techniques in brain stimulation, designing optimal stimulation directed towards a target region with an acceptable magnitude remains an ongoing and significant challenge. In this work, we also introduce techniques for computing optimal inputs that follow a desired stimulation routing path towards the target brain region. This optimization problem can be efficiently resolved using non-linear programming tools and permits the simultaneous assignment of multiple desired patterns at different instances. We establish the algebraic and graph-theoretic conditions necessary to ensure the feasibility and stability of information routing patterns (IRPs). We illustrate the routing mechanisms and control methods for attaining desired patterns in biological oscillatory dynamics. Author Summary A complex network is described by collection of subsystems or nodes, often exchanging information among themselves via fixed interconnection pattern or structure of the network. This combination of nodes, interconnection structure and the information exchange enables the overall network system to function. These information exchange patterns change over time and switch patterns whenever a node or set of nodes are subject to external perturbations or stimulations. In many cases one would want to drive the system to desired information patterns, resulting in desired network system behaviour, by appropriately designing the perturbating signals. We present mathematical framework to design perturbation signals that drive the system to the desired behaviour. We demonstrate the applicability of our framework in the context of brain stimulation and in modifying causal interactions in gene regulatory networks.",
        "posted": "June 17, 2024"
    },
    {
        "title": "Circumventing glioblastoma resistance to temozolomide through optimal drug combinations designed by quantitative systems pharmacology and machine learning",
        "authors": "Sergio Corridore, Maïté Verreault, Hugo Martin, Thibault Delobel, Cécile Carrère, Ahmed Idbaih, Annabelle Ballesta",
        "doi": "https://doi.org/10.1101/2024.05.31.596811",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.31.596811v1.full.pdf",
        "abstract": "Glioblastoma is currently associated to a dismal prognosis despite intensive treatment involving maximal-safe surgery, radiotherapy and temozolomide (TMZ)-based chemotherapy. Disease progression or relapse is often due to initial or acquired resistance to temozolomide, which may be mediated by the over-expression of the repair enzyme MGMT. To design TMZ-based drug combinations circumventing the initial resistance of MGMT-overexpressing cells, a quantitative systems pharmacology (QSP) model representing TMZ cellular pharmacokinetics-pharmacodynamics and their connection to the most altered pathways in GBM was developed. This digital network representation of TMZ cellular pharmacology successfully integrates, in a mechanistic fashion, multi-type time- and dose-resolved datasets, available in control or MGMT-overexpressing cells. In silico target inhibition screening identified an optimal antitumor strategy consisting in priming cancer cells with inhibitors of the base excision repair and of the homologous recombination pathway prior to TMZ exposure. This drug combination was validated in dedicated experiments, thus allowing to re-sensitize cells which were initially resistant to TMZ. Using machine learning, functional signatures of response to such optimal multiagent therapy were derived to assist decision making about administering it to other cancer cell lines or patients. The developed framework can be extended to account for additional patientspecific altered pathways and may be translated towards the clinics by representing the tumor micro-environment and drug whole-body pharmacokinetics. Overall, we successfully demonstrated the relevance of combined QSP and machine learning to design multi-agent pharmacotherapies circumventing initial tumor resistance. One Sentence Summary An integrated in vitro-in silico approach allowed to design optimal drug combinations re-sensitizing temozolomide-resistant glioblastoma cells.",
        "posted": "June 03, 2024"
    },
    {
        "title": "Multivalent binding model quantifies antibody species from systems serology",
        "authors": "Armaan A. Abraham, Zhixin Cyrillus Tan, Priyanka Shrestha, Emily R. Bozich, Aaron S. Meyer",
        "doi": "https://doi.org/10.1101/2024.07.05.602296",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.07.05.602296v1.full.pdf",
        "abstract": "Systems serology aims to broadly profile the antigen binding, Fc biophysical features, immune receptor engagement, and effector functions of antibodies. This experimental approach excels at identifying antibody functional features that are relevant to a particular disease. However, a crucial limitation of this approach is its incomplete description of what structural features of the antibodies are responsible for the observed immune receptor engagement and effector functions. Knowing these antibody features is important for both understanding how effector responses are naturally controlled through antibody Fc structure and designing antibody therapies with specific effector profiles. Here, we address this limitation by modeling the molecular interactions occurring in these assays and using this model to infer quantities of specific antibody species among the antibodies being profiled. We used several validation strategies to show that the model accurately infers antibody properties. We then applied the model to infer previously unavailable antibody fucosylation information from existing systems serology data. Using this capability, we find that COVID-19 vaccine efficacy is associated with the induction of afucosylated spike protein-targeting IgG. Our results also question an existing assumption that controllers of HIV exhibit gp120-targeting IgG that are less fucosylated than those of progressors. Additionally, we confirm that afucosylated IgG is associated with membrane-associated antigens for COVID-19 and HIV, and present new evidence indicating that this relationship is specific to the host cell membrane. Finally, we use the model to identify redundant assay measurements and subsets of information-rich measurements from which they can be inferred. In total, our modeling approach provides a quantitative framework for the reasoning typically applied in these studies, improving the ability to draw mechanistic conclusions from these data. Author summary Antibodies play an important role in our immune response by binding to pathogens and engaging other immune cells to eliminate threats. Mounting evidence points toward the importance of which immune cells are being engaged by antibodies in determining the effectiveness of an immune response. While sophisticated experimental methods such as systems serology have been developed to broadly profile the engagement activities of antibodies, determining the presence of antibody structural features relevant to immune engagement remains challenging. Our study addresses this gap by developing a computational model that interprets data from systems serology, allowing us to infer detailed, engagement-relevant structural information about antibodies that are difficult to measure directly. We applied our approach to existing data from COVID-19 and HIV studies, revealing new insights into how antibody structure relates to vaccine efficacy and disease progression. For instance, we found that COVID-19 vaccine effectiveness is linked to the production of certain antibodies lacking a sugar residue called fucose. Our model also helps identify which measurements in systems serology are most informative, potentially streamlining future studies. This work enhances our ability to understand antibody function in disease and may guide the development of more effective antibody-based therapies.",
        "posted": "July 10, 2024"
    },
    {
        "title": "Bridging model and experiment in systems neuroscience with Cleo: the Closed-Loop, Electrophysiology, and Optophysiology simulation testbed",
        "authors": "Kyle A. Johnsen, Nathanael A. Cruzado, Zachary C. Menard, Adam A. Willats, Adam S. Charles, Jeffrey E. Markowitz, Christopher J. Rozell",
        "doi": "https://doi.org/10.1101/2023.01.27.525963",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2023.01.27.525963v2.full.pdf",
        "abstract": "Systems neuroscience has experienced an explosion of new tools for reading and writing neural activity, enabling exciting new experiments such as all-optical or closed-loop control that effect powerful causal interventions. At the same time, improved computational models are capable of reproducing behavior and neural activity with increasing fidelity. Unfortunately, these advances have drastically increased the complexity of integrating different lines of research, resulting in the missed opportunities and untapped potential of suboptimal experiments. Experiment simulation can help bridge this gap, allowing model and experiment to better inform each other by providing a low-cost testbed for experiment design, model validation, and methods engineering. Specifically, this can be achieved by incorporating the simulation of the experimental interface into our models, but no existing tool integrates optogenetics, two-photon calcium imaging, electrode recording, and flexible closed-loop processing with neural population simulations. To address this need, we have developed Cleo: the Closed-Loop, Electrophysiology, and Optophysiology experiment simulation testbed. Cleo is a Python package enabling injection of recording and stimulation devices as well as closed-loop control with realistic latency into a Brian spiking neural network model. It is the only publicly available tool currently supporting two-photon and multi-opsin/wavelength optogenetics. To facilitate adoption and extension by the community, Cleo is open-source, modular, tested, and documented, and can export results to various data formats. Here we describe the design and features of Cleo, validate output of individual components and integrated experiments, and demonstrate its utility for advancing optogenetic techniques in prospective experiments using previously published systems neuroscience models.",
        "posted": "July 09, 2024"
    },
    {
        "title": "BayesianSSA: a Bayesian statistical model based on structural sensitivity analysis for predicting responses to enzyme perturbations in metabolic networks",
        "authors": "Shion Hosoda, Hisashi Iwata, Takuya Miura, Maiko Tanabe, Takashi Okada, Atsushi Mochizuki, Miwa Sato",
        "doi": "https://doi.org/10.1101/2024.03.14.585120",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.14.585120v3.full.pdf",
        "abstract": "Background Chemical bioproduction has attracted attention as a key technology in a decarbonized society. In computational design for chemical bioproduction, it is necessary to predict changes in metabolic fluxes when up-/down-regulating enzymatic reactions, that is, responses of the system to enzyme perturbations. Structural sensitivity analysis (SSA) was previously developed as a method to predict qualitative responses to enzyme perturbations on the basis of the structural information of the reaction network. However, the network structural information can sometimes be insufficient to predict qualitative responses unambiguously, which is a practical issue in bioproduction applications. To address this, in this study, we propose BayesianSSA, a Bayesian statistical model based on SSA. BayesianSSA extracts environmental information from perturbation datasets collected in environments of interest and integrates it into SSA predictions. Results We applied BayesianSSA to synthetic and real datasets of the central metabolic pathway of Escherichia coli. Our result demonstrates that BayesianSSA can successfully integrate environmental information extracted from perturbation data into SSA predictions. In addition, the posterior distribution estimated by BayesianSSA can be associated with the known pathway reported to enhance succinate export flux in previous studies. Conclusions We believe that BayesianSSA will accelerate the chemical bioproduction process and contribute to advancements in the field.",
        "posted": "July 24, 2024"
    },
    {
        "title": "Combining systems and synthetic biology for in vivo enzymology",
        "authors": "Sara Castaño-Cerezo, Alexandre Chamas, Hanna Kulyk, Christian Treitz, Floriant Bellvert, Andreas Tholey, Virginie Galéote, Carole Camarasa, Stéphanie Heux, Luis F. Garcia-Alles, Pierre Millard, Gilles Truan",
        "doi": "https://doi.org/10.1101/2024.02.02.578620",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.02.02.578620v4.full.pdf",
        "abstract": "Enzymatic parameters are classically determined in vitro, under conditions that are far from those encountered in cells, casting doubt on their physiological relevance. We developed a generic approach combining tools from synthetic and systems biology to measure enzymatic parameters in vivo. In the context of a synthetic carotenoid pathway in Saccharomyces cerevisiae, we focused on a phytoene synthase and three phytoene desaturases, which are difficult to study in vitro. We designed, built, and analyzed a collection of yeast strains mimicking substantial variations in substrate concentration by strategically manipulating the expression of geranyl-geranyl pyrophosphate (GGPP) synthase. We successfully determined in vivo Michaelis-Menten parameters (KM, Vmax and kcat) for GGPP-converting phytoene synthase from absolute metabolomics, fluxomics and proteomics data, highlighting differences between in vivo and in vitro parameters. Leveraging the versatility of the same set of strains, we then extracted enzymatic parameters for two of the three phytoene desaturases. Our approach demonstrates the feasibility of assessing enzymatic parameters directly in vivo, providing a novel perspective on the kinetic characteristics of enzymes in real cellular conditions.",
        "posted": "August 01, 2024"
    },
    {
        "title": "Kinetic Diagram Analysis: A Python Library for Calculating Steady-State Observables of Biochemical Systems Analytically",
        "authors": "Nikolaus Carl Awtrey, Oliver Beckstein",
        "doi": "https://doi.org/10.1101/2024.05.27.596119",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.27.596119v2.full.pdf",
        "abstract": "N/A",
        "posted": "N/A"
    },
    {
        "title": "Mechanosensory Systems and Sensory Integration Mediate C. elegans Negative Gravitaxis",
        "authors": "Caroline Ackley, Lindsey Washiashi, Neda Ziaei Kajbaf, Ruchira Krishnamurthy, Zhenxuan Sun, Vivian Duong, Kaylin Choe, Elijah Lane, Cricket Wood, Eleanor Smith, Giulia Pellegrini, Mark Sherwin, Pradeep Joshi, Joel H. Rothman",
        "doi": "https://doi.org/10.1101/2022.03.03.482913",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2022.03.03.482913v3.full.pdf",
        "abstract": "The ability to sense Earth’s gravitational pull is essential for orientation, navigation, and proprioception in many organisms. We report here that C. elegans exhibits pronounced negative gravitaxis, or movement away from the Earth’s center, independent of orientation of the geomagnetic field. This behavior is antagonized by light and electromagnetic fields, suggesting that it is integrated with other sensory inputs. We found that MEC-5/7/12, and TRPA-1, but not MEC-4/10 DEG/ENaC channels or other proteins involved in gentle touch transduction, are essential for negative gravitaxis, suggesting that the sensory system for detecting and responding to gravity is separable from touch sensation. We also found that the PVD neurons but not touch receptor neurons (TRNs) are required for this behavior. These findings implicate an interconnected mechanism for gravity sensation involving an ion channel that is also present in the mammalian vestibular system, suggesting possible homology in gravity sensing across animal phylogeny.",
        "posted": "August 31, 2024"
    },
    {
        "title": "Discovering Governing Equations of Biological Systems through Representation Learning and Sparse Model Discovery",
        "authors": "Mehrshad Sadria, Vasu Swaroop",
        "doi": "https://doi.org/10.1101/2024.09.19.613953",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.19.613953v1.full.pdf",
        "abstract": "Understanding the governing rules of complex biological systems remains a significant challenge due to the nonlinear, high-dimensional nature of biological data. In this study, we present CLERA, a novel end-to-end computational framework designed to uncover parsimonious dynamical models and identify active gene programs from single-cell RNA sequencing data. By integrating a supervised autoencoder architecture with Sparse Identification of Nonlinear Dynamics, CLERA leverages prior knowledge to simultaneously extract related low-dimensional embeddings and uncovers the underlying dynamical systems that drive the processes. Through the analysis of both synthetic and biological datasets, CLERA demonstrates robust performance in reconstructing gene expression dynamics, identifying key regulatory genes, and capturing temporal patterns across distinct cell types. CLERA’s ability to generate dynamic interaction networks, combined with network rewiring using Personalized PageRank to highlight central genes and active gene programs, offers new insights into the complex regulatory mechanisms underlying cellular processes.",
        "posted": "September 23, 2024"
    },
    {
        "title": "Parasitic and Commensal interactions among Mimiviruses, Sputnik-like virophages, and Transpovirons: A theoretical and dynamical systems approach",
        "authors": "Emmanuel Ortega-Atehortúa, Nicole Rivera Parra, Boris A. Rodríguez, Gloria Machado-Rodríguez, Juan Camilo Arboleda Rivera",
        "doi": "https://doi.org/10.1101/2024.09.13.610890",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.13.610890v1.full.pdf",
        "abstract": "Giant viruses have been in the scope of virologists since 2003 when they were isolated from Acanthamoeba spp. Giant viruses, in turn, get infected by another virus named virophage and a third biological entity that corresponds to a transpoviron which can be found in the capsids of giant and virophage viruses. So far, transpovirons seem to behave as commensal entities while some virophages exhibit commensal behavior under laboratory conditions. To study the system’s behavior, we used a theoretical approximation and developed an ordinary differential equation model. The dynamical analysis showed that the system exhibits an oscillatory robust behavior leading to a hyperparasitic Lotka-Volterra dynamic. But the biological mechanism that underlines the transpoviron persistence over time remains unclear and its status as a commensal entity needs further assessment. Also, the ecological interaction that leads to the overall coexistence of the three viral entities needs to be further studied.",
        "posted": "September 14, 2024"
    },
    {
        "title": "Human Neural Organoid Microphysiological Systems Show the Building Blocks Necessary for Basic Learning and Memory",
        "authors": "Dowlette-Mary Alam El Din, Leah Moenkemoeller, Alon Loeffler, Forough Habibollahi, Jack Schenkman, Amitav Mitra, Tjitse van der Molen, Lixuan Ding, Jason Laird, Maren Schenke, Erik C. Johnson, Brett J. Kagan, Thomas Hartung, Lena Smirnova",
        "doi": "https://doi.org/10.1101/2024.09.17.613333",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.09.17.613333v1.full.pdf",
        "abstract": "Brain Microphysiological Systems including neural organoids derived from human induced pluripotent stem cells offer a unique lens to study the intricate workings of the human brain. This paper investigates the foundational elements of learning and memory in neural organoids, also known as Organoid Intelligence by quantifying immediate early gene expression, synaptic plasticity, neuronal network dynamics, and criticality to demonstrate the utility of these organoids in basic science research. Neural organoids showed synapse formation, glutamatergic and GABAergic receptor expression, immediate early gene expression basally and evoked, functional connectivity, criticality, and synaptic plasticity in response to theta-burst stimulation. In addition, pharmacological interventions on GABAergic and glutamatergic receptors, and input specific theta-burst stimulation further shed light on the capacity of neural organoids to mirror synaptic modulation and short-term potentiation, demonstrating their potential as tools for studying neurophysiological and neurological processes and informing therapeutic strategies for diseases. Graphical AbstractOverview of the main components of the experiments conducted. Figure created using BioRender.com.",
        "posted": "September 19, 2024"
    },
    {
        "title": "Data-driven model discovery and model selection for noisy biological systems",
        "authors": "Xiaojun Wu, MeiLu McDermott, Adam L. MacLean",
        "doi": "https://doi.org/10.1101/2024.10.03.616508",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.03.616508v1.full.pdf",
        "abstract": "Biological systems exhibit complex dynamics that differential equations can often adeptly represent. Ordinary differential equation models are widespread; until recently their construction has required extensive prior knowledge of the system. Machine learning methods offer alternative means of model construction: differential equation models can be learnt from data via model discovery using sparse identification of nonlinear dynamics (SINDy). However, SINDy struggles with realistic levels of biological noise and does not incorporate prior knowledge of the system. We propose a data-driven framework for model discovery and model selection using hybrid dynamical systems: partial models containing missing terms. Neural networks are used to approximate the unknown dynamics of a system, enabling the denoising the data while simultaneously learning the latent dynamics. Simulations from the fitted neural network are then used to infer models using SINDy. We show, via model selection, that model discovery in SINDy with hybrid dynamical systems outperforms alternative approaches. We find it possible to infer models correctly up to high levels of biological noise of different types. We demonstrate the potential to learn models from sparse, noisy data in application to a canonical cell state transition using data derived from single-cell transcriptomics. Overall, this approach provides a practical framework for model discovery in biology in cases where data are noisy and sparse, of particular utility when the underlying biological mechanisms are partially but incompletely known.",
        "posted": "October 04, 2024"
    },
    {
        "title": "Multifunctional Systems in Synthetic Biology: Single-Stranded DNA Signaling for Precise Control of Gene Activation",
        "authors": "Brian Ng, Yuying Ding, Matthew Cornall, Ravinash Krishna Kumar, Yujia Qing, Hagan Bayley",
        "doi": "https://doi.org/10.1101/2024.10.20.619289",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.10.20.619289v1.full.pdf",
        "abstract": "Controllable gene circuits that respond to defined inputs are essential tools in synthetic biology. By leveraging regulatory mechanisms at either transcriptional or translational levels, synthetic responsive systems have been engineered to recognize diverse signals, such as small molecules (e.g., tetracycline) or physical stimuli (e.g., light). However, these approaches have limitations: small-molecule signals often require high concentrations to be effective, and sophisticated engineering is needed to generate responsive effectors. Here, we establish a simple, versatile gene activation system in which short single-stranded DNAs trigger RNA or protein production by complementing defective single-stranded promoters upstream of target genes. We demonstrate selective gene activation with orthogonal promoters, and logic-gate operations with signal pairs. The signaling system operates in compartmentalized nanoliter droplets scaffolded by bilayers. Signal delivery is controlled by selectively disrupting bilayers or applying transmembrane potential to move signals through protein pores, thereby activating genes within the receiver compartments. This work expands the toolset for engineering multifunctional, responsive materials to meet biotechnological and medical needs, enabling gene activation in response to specific cues.",
        "posted": "October 21, 2024"
    },
    {
        "title": "An integrative systems-biology approach defines mechanisms of Alzheimer’s disease neurodegeneration",
        "authors": "Matthew J Leventhal, Camila A Zanella, Byunguk Kang, Jiajie Peng, David Gritsch, Zhixiang Liao, Hassan Bukhari, Tao Wang, Ping-Chieh Pao, Serwah Danquah, Joseph Benetatos, Ralda Nehme, Samouil Farhi, Li-Huei Tsai, Xianjun Dong, Clemens R Scherzer, Mel B Feany, Ernest Fraenkel",
        "doi": "https://doi.org/10.1101/2024.03.17.585262",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.03.17.585262v2.full.pdf",
        "abstract": "Despite years of intense investigation, the mechanisms underlying neuronal death in Alzheimer’s disease, the most common neurodegenerative disorder, remain incompletely understood. To define relevant pathways, we integrated the results of an unbiased, genome-scale forward genetic screen for age-associated neurodegeneration in Drosophila with human and Drosophila Alzheimer’s disease-associated multi-omics. We measured proteomics, phosphoproteomics, and metabolomics in Drosophila models of Alzheimer’s disease and identified Alzheimer’s disease human genetic variants that modify expression in disease-vulnerable neurons. We used a network optimization approach to integrate these data with previously published Alzheimer’s disease multi-omic data. We computationally predicted and experimentally demonstrated how HNRNPA2B1 and MEPCE enhance tau-mediated neurotoxicity. Furthermore, we demonstrated that the screen hits CSNK2A1 and NOTCH1 regulate DNA damage in Drosophila and human iPSC-derived neural progenitor cells. Our work identifies candidate pathways that could be targeted to ameliorate neurodegeneration in Alzheimer’s disease.",
        "posted": "October 09, 2024"
    },
    {
        "title": "Disentangling the Roles of Distinct Cell Classes with Cell-Type Dynamical Systems",
        "authors": "Aditi Jha, Diksha Gupta, Carlos D. Brody, Jonathan W. Pillow",
        "doi": "https://doi.org/10.1101/2024.07.08.602520",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.07.08.602520v2.full.pdf",
        "abstract": "Latent dynamical systems have been widely used to characterize the dynamics of neural population activity in the brain. However, these models typically ignore the fact that the brain contains multiple cell types. This limits their ability to capture the functional roles of distinct cell classes, and to predict the effects of cell-specific perturbations on neural activity or behavior. To overcome these limitations, we introduce the “cell-type dynamical systems” (CTDS) model. This model extends latent linear dynamical systems to contain distinct latent variables for each cell class, with biologically inspired constraints on both dynamics and emissions. To illustrate our approach, we consider neural recordings with distinct excitatory (E) and inhibitory (I) populations. The CTDS model defines separate latents for both cell types, and constrains the dynamics so that E (I) latents have a strictly positive (negative) effects on other latents. We applied CTDS to recordings from rat frontal orienting fields (FOF) and anterior dorsal striatum (ADS) during an auditory decision-making task. The model achieved higher accuracy than a standard linear dynamical system (LDS), and revealed that the animal’s choice can be decoded from both E and I latents and thus is not restricted to a single cell-class. We also performed in-silico optogenetic perturbation experiments in the FOF and ADS, and found that CTDS was able to replicate the experimentally observed effects of different perturbations on behavior, whereas a standard LDS model—which does not differentiate between cell types—did not. Crucially, our model allowed us to understand the effects of these perturbations by revealing the dynamics of different cell-specific latents. Finally, CTDS can also be used to identify cell types for neurons whose class labels are unknown in electrophysiological recordings. These results illustrate the power of the CTDS model to provide more accurate and more biologically interpretable descriptions of neural population dynamics and their relationship to behavior.",
        "posted": "November 05, 2024"
    },
    {
        "title": "A Machine Learning Model of Perturb-Seq Data for Use in Space Flight Gene Expression Profile Analysis",
        "authors": "Liam Johnson, James Casaletto, Sylvain Costes, Caitlin Proctor, Lauren Sanders",
        "doi": "https://doi.org/10.1101/2024.11.28.625741",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.28.625741v1.full.pdf",
        "abstract": "The genetic perturbations caused by spaceflight on biological systems tend to have a system-wide effect which is often difficult to deconvolute into individual signals with specific points of origin. Single cell multi-omic data can provide a profile of the perturbational effects but does not necessarily indicate the initial point of interference within a network. The objective of this project is to take advantage of large scale and genome-wide perturbational or Perturb-Seq datasets by using them to pre-train a generalist machine learning model that is capable of predicting the effects of unseen perturbations in new data. Perturb-Seq datasets are large libraries of single cell RNA sequencing data collected from CRISPR knock out screens in cell culture. The advent of generative machine learning algorithms, particularly transformers, make it an ideal time to re-assess large scale data libraries in order to grasp cell and even organism-wide genomic expression motifs. By tailoring an algorithm to learn the downstream effects of the genetic perturbations, we present a pre-trained generalist model capable of predicting the effects of multiple perturbations in combination, locating points of origin for perturbation in new datasets, predicting the effects of known perturbations in new datasets, and annotation of large-scale network motifs. We demonstrate the utility of this model by identifying key perturbational signatures in RNA sequencing data from spaceflown biological samples from the NASA Open Science Data Repository.",
        "posted": "November 29, 2024"
    },
    {
        "title": "Annotating CryoET Volumes: A Machine Learning Challenge",
        "authors": "Ariana Peck, Yue Yu, Jonathan Schwartz, Anchi Cheng, Utz Heinrich Ermel, Saugat Kandel, Dari Kimanius, Elizabeth Montabana, Daniel Serwas, Hannah Siems, Feng Wang, Zhuowen Zhao, Shawn Zheng, Matthias Haury, David Agard, Clinton Potter, Bridget Carragher, Kyle Harrington, Mohammadreza Paraan",
        "doi": "https://doi.org/10.1101/2024.11.04.621686",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.04.621686v2.full.pdf",
        "abstract": "Cryo-electron tomography (cryoET) has emerged as a powerful structural biology tool for understanding protein complexes in their native cellular environments. Presently, 3D volumes of cellular environments can be acquired in the thousands in a few days where each volume provides a rich and complex cellular landscape. Despite numerous innovations, localizing and identifying the vast majority of protein species in these volumes remains prohibitively difficult. Machine learning based methods provide an opportunity to automate the process of labeling and annotating cryoET volumes. Due to current bottlenecks in the annotation process, and a lack of large standardized datasets, training datasets for machine learning algorithms have been scarce. Here, we present a defined “phantom” sample, along with “ground truth” annotations, that will be the basis of a machine learning challenge to bring cryoET and ML experts together and spur creativity to address this annotation problem. We have also set up a cryoET data portal that provides additional diverse sets of annotated 3D volumes from cryoET experts across the world for the machine learning challenge.",
        "posted": "November 21, 2024"
    },
    {
        "title": "Universal differential equations for systems biology: Current state and open problems",
        "authors": "Maren Philipps, Nina Schmid, Jan Hasenauer",
        "doi": "https://doi.org/10.1101/2024.11.29.626122",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.11.29.626122v2.full.pdf",
        "abstract": "Universal Differential Equations (UDEs) combine mechanistic differential equations with data-driven artificial neural networks, forming a flexible framework for modelling complex biological systems. This hybrid approach leverages prior knowledge and data to uncover unknown processes and deliver accurate predictions. However, UDEs face challenges in efficient and reliable training due to stiff dynamics and noisy, sparse data common in biology, and in ensuring the interpretability of the parameters of the mechanistic model. We investigate these challenges and evaluate UDE performance on realistic biological scenarios, providing a systematic training pipeline. Our results demonstrate the versatility of UDEs in systems biology and reveal that noise and limited data significantly degrade performance, but regularisation can improve accuracy and interpretability. By addressing key challenges and offering practical solutions, this work advances UDE methodology and underscores its potential in tackling complex problems in systems biology.",
        "posted": "December 17, 2024"
    },
    {
        "title": "Bayesian Occam’s Razor to Optimize Metamodeling for Complex Biological Systems",
        "authors": "Chenxi Wang, Jihui Zhao, Jingjing Zheng, Barak Raveh, Xuming He, Liping Sun",
        "doi": "https://doi.org/10.1101/2024.05.28.594654",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.28.594654v2.full.pdf",
        "abstract": "Modeling complex biological systems necessitates the integration of vast and multifaceted information spanning various aspects of these systems, and is expected to yield more insights into the system than any of the inputs. Metamodeling, a specialized form of integrative modeling, addresses this by integrating existing models. Developing and optimizing metamodels pose challenges due to the complexities introduced by diverse input models and their inherent uncertainties. In this study, we employ Bayesian formalism to rigorously analyze the propagation of probability throughout the metamodeling process and propose quantitative assessments for it. Building on this, we introduce a method for optimizing metamodeling that adheres to the Bayesian Occam’s razor rationale, by (i) minimizing model uncertainty; (ii) maximizing model consistency; and (iii) reducing model complexity. To illustrate the benefits of this method, we apply it to the dynamic system of glucose-stimulated insulin secretion in pancreatic β-cells. The optimized metamodel delivers more accurate estimates of impaired β-cell dynamics and function in T2D subjects compared to the non-optimized one, underscoring the critical role of optimization in enhancing both model reliability and applicability. This method is implemented through the Integrative Modeling Platform (IMP), facilitating the development of accurate, precise, and sufficiently simple models for a variety of complex systems.",
        "posted": "December 02, 2024"
    },
    {
        "title": "A Mathematical Framework for the Quantitative Analysis of Genetic Buffering",
        "authors": "Jim Karagiannis",
        "doi": "https://doi.org/10.1101/2024.12.09.627635",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.12.09.627635v1.full.pdf",
        "abstract": "Genetic buffering plays a pivotal role in orchestrating the relationship between genotype and phenotype in outbred populations. While high-throughput screens have identified many instances of genetic buffering – through the detection of “synthetic lethality” or “synthetic sickness” – a formal and general method for its quantitative analysis across systems is lacking. In this report, an axiomatic mathematical framework that can be used to classify, quantify, and compare buffering relationships between genes is described. Importantly, this methodology employs a ratio scale as its basis, thereby permitting the definition of a novel neutrality model for gene interaction that is referred to as the “parallel” model. This model does not contradict, and instead complements, the commonly used “product” model (more aptly referred to herein as the “serial” neutrality model). Moreover, simple extensions of this newly developed framework permit the unambiguous definition and classification of gene interactions in a formal, general, and mathematical way. Consequently, the concept of genetic buffering as first conceived by Leland Hartwell becomes a specific case within a comprehensive model of gene interaction.",
        "posted": "December 13, 2024"
    },
    {
        "title": "Systems biology framework for rational design of operational conditions for in vitro / in vivo translation of microphysiological systems",
        "authors": "Jose L. Cadavid, Nikolaos Meimetis, Linda G. Griffith, Douglas A. Lauffenburger",
        "doi": "https://doi.org/10.1101/2025.01.17.633624",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.17.633624v1.full.pdf",
        "abstract": "Preclinical models are used extensively to study diseases and potential therapeutic treatments. Complex in vitro platforms incorporating human cellular components, known as microphysiological systems (MPS), can model cellular and microenvironmental features of diseased tissues. However, determining experimental conditions -- particularly biomolecular cues such as growth factors, cytokines, and matrix proteins -- providing most effective translatability of MPS-generated information to in vivo human subject contexts is a major challenge. Here, using metabolic dysfunction-associated fatty liver disease (MAFLD) studied using the CNBio PhysioMimix as a case study, we developed a machine learning framework called Latent In Vitro to In Vivo Translation (LIV2TRANS) to ascertain how MPS data map to in vivo data, first sharpening translation insights and consequently elucidating experimental conditions that can further enhance translation capability. Our findings in this case study highlight TGFβ as a crucial cue for MPS translatability and indicate that adding JAK-STAT pathway perturbations via interferon stimuli could increase the predictive performance of this MPS in MAFLD studies. Finally, we developed an optimization approach that identified androgen and EGFR signaling as key for maximizing the capacity of this MPS to capture in vivo human biological information germane to MAFLD. More broadly, this work establishes a mathematically principled approach for identifying experimental conditions most beneficially capturing in vivo human-relevant molecular pathways and processes, generalizable to preclinical studies for a wide range of diseases and potential treatments.",
        "posted": "January 22, 2025"
    },
    {
        "title": "Hybrid Generative Model: Bridging Machine Learning and Biophysics to Expand RNA Functional Diversity",
        "authors": "Vaitea Opuu",
        "doi": "https://doi.org/10.1101/2025.01.20.633900",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.20.633900v1.full.pdf",
        "abstract": "The RNA world hypothesis suggests that RNA once catalyzed reactions now performed by proteins. Rediscovering these functions requires exploring sequence spaces beyond natural RNAs. While machine learning (ML)-based RNA design shows promise, it struggles to extrapolate beyond training data. In contrast, biophysics-based approaches leveraging RNA secondary (2D) structure operate independently of training data but are not tailored for functional discovery. We present a hybrid generative model that combines a Potts model with the thermodynamic folding model of RNA 2D structure. This approach disentangles folding contributions from functional signals, such as binding, enabling the data-driven component to focus on tertiary interactions and improving contact predictions. This disentanglement introduces structural imprinting—a novel strategy that uses structural variability to guide mutations, which showed great promise in uncovering hidden natural diversity. By bridging ML and biophysics, this model tackles the longstanding challenge of expanding diversity beyond the mere reproduction of the training data.",
        "posted": "January 22, 2025"
    },
    {
        "title": "Predicting antimicrobial class specificity of small molecules using machine learning",
        "authors": "Yojana Gadiya, Olga Genilloud, Ursula Bilitewski, Mark Brönstrup, Leonie von Berlin, Marie Attwood, Philip Gribbon, Andrea Zaliani",
        "doi": "https://doi.org/10.1101/2024.12.02.626313",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.12.02.626313v2.full.pdf",
        "abstract": "Whilst the useful armory of antibiotic drugs is continually depleted due to the emergence of drug-resistant pathogens, the development of novel therapeutics has also slowed down. In the era of advanced computational methods, approaches like machine learning (ML) could be one potential solution to help reduce the high costs and complexity of antibiotic drug discovery and attract collaboration across organizations. In our work, we developed a large antimicrobial knowledge graph (AntiMicrobial-KG) as a repository for collecting and visualizing public in-vitro antibacterial assay. Utilizing this data, we build ML models to efficiently scan compound libraries to identify compounds with the potential to exhibit antimicrobial activity. Our strategy involved training seven classic ML models across six compound fingerprint representations, of which the Random Forest trained on the MHFP6 fingerprint outperformed, demonstrating an accuracy of 75.9% and Cohen’s Kappa score of 0.68. Finally, we illustrated the model’s applicability for predicting the antimicrobial properties of two small molecule screening libraries. Firstly, the EU-OpenScreen library was tested against a panel of Gram-positive, Gram-negative, and Fungal pathogens. Here, we unveiled that the model was able to correctly predict more than 30% of active compounds for Gram-positive, Gram-negative, and Fungal pathogens. Secondly, with the Enamine library, a commercially available HTS compound collection with claimed antibacterial properties, we predicted its antimicrobial activity and pathogen class specificity. These results may provide a means for accelerating research in AMR drug discovery efforts by carefully filtering out compounds from commercial libraries with lower chances of being active.",
        "posted": "January 24, 2025"
    },
    {
        "title": "Dual process impairments in reinforcement learning and working memory systems underlie learning deficits in physiological anxiety",
        "authors": "Jennifer Senta, Sonia Bishop, Anne GE Collins",
        "doi": "https://doi.org/10.1101/2025.02.14.638024",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.14.638024v1.full.pdf",
        "abstract": "Anxiety has been robustly linked to deficits in frontal executive function including working memory (WM) and attentional control processes. However, although anxiety has also been associated with impaired performance on learning tasks, computational investigations of reinforcement learning (RL) impairment in anxiety have yielded mixed results. WM processes are known to contribute to learning behavior in parallel to RL processes and to modulate the effective learning rate as a function of load. However, WM processes have typically not been modeled in investigations of anxiety and RL. In the current study, we leveraged an experimental paradigm (RLWM) which manipulates the relative contributions of WM and RL processes in a reinforcement learning and retention task using multiple stimulus set sizes. Using a computational model of interactive RL and WM processes, we investigated whether individual differences in physiological or cognitive anxiety impacted task performance via deficits in RL or WM. Elevated physiological, but not cognitive, anxiety scores were strongly associated with worse performance during learning and retention testing across all set sizes. Computationally, higher physiological anxiety scores were significantly related to reduced learning rate and increased rate of WM decay. To highlight the importance of modeling WM contributions to learning, we considered the effect of fitting RL models without WM modules to the data. Here we found that reduced learning performance for higher physiological anxiety was at least partially misattributed to stochastic decision noise in 9 out of 10 RL-only models considered. These findings reveal a dual-process impairment in learning in anxiety that is linked to a more physiological than cognitive anxiety phenotype. More broadly, this work also points to the importance of accounting for the contribution of WM to RL when investigating psychopathology-related deficits in learning.",
        "posted": "February 14, 2025"
    },
    {
        "title": "Sleep Resolves Competition Between Explicit and Implicit Memory Systems",
        "authors": "Katja Kleespies, Philipp C. Paulus, Hao Zhu, Florian Pargent, Marie Jakob, Jana Werle, Michael Czisch, Joschka Boedecker, Steffen Gais, Monika Schönauer",
        "doi": "https://doi.org/10.1101/2025.02.21.639581",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.21.639581v1.full.pdf",
        "abstract": "Sleep supports stabilization of explicit, declarative memory and benefits implicit, procedural memory. In addition, sleep may change the quality of memory representations. Explicit and implicit learning systems, usually linked to the hippocampus and striatum, can compete during learning, but whether they continue to interact during offline periods remains unclear. Here, we investigate for feedback-driven classification learning, whether sleep integrates explicit and implicit aspects of memory. The negative relationship between implicit and explicit memory components was resolved over sleep, but not wakefulness. Additionally, sleep benefitted performance on a task that allows the cooperative use of explicit and implicit memory, and participants who slept showed superior performance in generalizing their knowledge to unseen exemplars. A reinforcement learning model relates this to better transfer of the learned exemplar value representation after sleep. This suggests that sleep integrates information learned by different routes and helps us respond optimally to everyday life contingencies.",
        "posted": "February 25, 2025"
    },
    {
        "title": "Thermodynamic uncertainty relation constraints information transmission through cell signaling systems",
        "authors": "Shreyansh Verma, Vishva Saravanan R, Bhaswar Ghosh",
        "doi": "https://doi.org/10.1101/2025.01.04.631284",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.01.04.631284v2.full.pdf",
        "abstract": "Biological systems in general operates out of equilibrium which demands the requirement for constant supply of energy due to non-equilibrium entropy production. The thermodynamic uncertainty relation (TUR) essentially imposes a bound on minimum current fluctuation the system can have given a entropy production rate. The fluctuation eventually impacts the signal to noise ratio imposing an upper bound on information transmission accuracy. In this study, we explored the role of TUR on the information transmission capacity of a set of cellular signaling systems using a coupled mathematical and machine learning approaches to experimental data in yeast under several stress conditions. Cell signaling systems are involved in sensing the changes in environment by activating a set of transcription factors which typically diffuse inside the nucleus to trigger transcription of the required genes. However, the inherent stochasticity of the biochemical pathways associated with signaling processes severely limits the accuracy of estimating the environmental input by the transcription factors. Application of TUR reveals a general picture about the working principle of the transcription factors. We found that the the activation followed by biased diffusion of transcription factors (TF) towards the nucleus triggers entropy production which amplifies magnitude of the overall TF currents towards the nucleus as well as reduces the fluctuations. These outcomes significantly improve the accuracy of information transmission carried out by the transcription factors following the bound imposed by TUR. Thus, experimental observations coupled with TUR based theoretical models demonstrate the role of thermodynamic fluctuation and entropy production on cellular information processing.",
        "posted": "February 16, 2025"
    },
    {
        "title": "Integrating Interpretable Machine Learning and Multi-omics Systems Biology for Personalized Biomarker Discovery and Drug Repurposing in Alzheimer’s Disease",
        "authors": "Mohammadsadeq Mottaqi, Pengyue Zhang, Lei Xie",
        "doi": "https://doi.org/10.1101/2025.03.24.644676",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.24.644676v1.full.pdf",
        "abstract": "Background Alzheimer’s disease (AD) is a complex neurodegenerative disorder with substantial molecular variability across different brain regions and individuals, hindering therapeutic development. This study introduces PRISM-ML, an interpretable machine learning (ML) framework integrating multiomics data to uncover patient-specific biomarkers, subtissue-level pathology, and drug repurposing opportunities. Methods We harmonized transcriptomic and genomic data of three independent brain studies containing 2105 post-mortem brain samples (1363 AD, 742 controls) across nine tissues. A Random Forest classifier with SHapley Additive exPlanations (SHAP) identified patient-level biomarkers. Clustering further delineated each tissue into subtissues, and network analysis revealed critical “bottleneck” (hub) genes. Finally, a knowledge graph-based screening identified multi-target drug candidates, and a real-world pharmacoepidemiologic study evaluated their clinical relevance. Results We uncovered 36 molecularly distinct subtissues, each defined by a set of associated unique biomarkers and genetic drivers. Through network analysis of gene-gene interactions networks, we highlighted 262 bottleneck genes enriched in synaptic, cytoskeletal, and membrane-associated processes. Knowledge graph queries identified six FDA-approved drugs predicted to target multiple bottleneck genes and AD-relevant pathways simultaneously. One candidate, promethazine, demonstrated an association with reduced AD incidence in a large healthcare dataset of over 364000 individuals (hazard ratios ≤ 0.43; p < 0.001). These findings underscore the potential for multi-target approaches, reveal connections between AD and cardiovascular pathways, and offer novel insights into the heterogeneous biology of AD. Conclusions PRISM-ML bridges interpretable ML with multi-omics and systems biology to decode AD heterogeneity, revealing region-specific mechanisms and repurposable therapeutics. The validation of promethazine in real-world data underscores the clinical relevance of multi-target strategies, paving the way for more personalized treatments in AD and other complex disorders.",
        "posted": "March 28, 2025"
    },
    {
        "title": "Sensitivity based model agnostic scalable explanations of deep learning",
        "authors": "Manu Aggarwal, NG Cogan, Vipul Periwal",
        "doi": "https://doi.org/10.1101/2025.02.21.639516",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.02.21.639516v2.full.pdf",
        "abstract": "Deep neural networks (DNNs) are powerful tools for data-driven predictive machine learning, but their complex architecture obscures mechanistic relations that they have learned from data. This information is critical to the scientific method of hypotheses development, experiment design, and model validation, especially when DNNs are used for biological and clinical predictions that affect human health. We design SensX, a model agnostic explainable AI (XAI) framework that outperformed current state-of-the-art XAI in accuracy (up to 52% higher) and computation time (up to 158 times faster), with higher consistency in all cases. It also determines an optimal subset of important input features, reducing dimensionality of further analyses. SensX scaled to explain vision transformer (ViT) models with more than 150, 000 features, which is computationally infeasible for current state-of-the-art XAI. SensX validated that ViT models learned justifiable features as important for different facial attributes of different human faces. SensX revealed biases inherent to the ViT architecture, an observation possible only when importance of each feature is explained. We trained DNNs to annotate biological cell types using single-cell RNA-seq data and SensX determined the sets of genes that the DNNs learned to be important to different cell types.",
        "posted": "March 07, 2025"
    },
    {
        "title": "Aerobicity stimulon in Escherichia coli revealed using multi-scale computational systems biology of adapted respiratory variants",
        "authors": "Arjun Patel, Neha Banwani, Raegan Mink, Divya M. Prabhakaran, Snehal V. Khairnar, Adam M. Feist, Bernhard O. Palsson, Amitesh Anand",
        "doi": "https://doi.org/10.1101/2025.03.13.642450",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.03.13.642450v1.full.pdf",
        "abstract": "Energy homeostasis facilitated by the interplay of substrate-level and oxidative phosphorylation is crucial for bacterial adaptation to diverse substrates and environments. To investigate how bioenergetic systems optimize under restrictive conditions, we evolved ETS variants with distinct proton-pumping efficiencies (1, 2, 3, or 4 proton(s) per electron) on succinate and glycerol. These substrates impose unique metabolic constraints: succinate requires complete gluconeogenesis, while glycerol supports mixed glycolytic and gluconeogenic fluxes. Multi-scale computational analysis of the strains revealed (a) Growth optimization across carbon substrates for multiple ETS variants, (b) A conserved aerobicity stimulon comprising seven independently regulated gene groups that are co-regulated with increasing aerobic capacities, (c) Proteome reallocation linked to aerobicity, validated using genome-scale metabolism and expression modeling, and (d) Carbon source-specific compensatory mutations in succinate transporters and regulatory elements. These findings define the aerobicity stimulon and establish a unifying framework for understanding bacterial respiratory flexibility, demonstrating how transcriptional networks and metabolic systems integrate to achieve energy homeostasis and bioenergetic resilience.",
        "posted": "March 15, 2025"
    },
    {
        "title": "Decomposed Linear Dynamical Systems (dLDS) models reveal instantaneous, context-dependent dynamic connectivity in C. elegans",
        "authors": "Eva Yezerets, Noga Mudrik, Adam S. Charles",
        "doi": "https://doi.org/10.1101/2024.05.31.596903",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2024.05.31.596903v2.full.pdf",
        "abstract": "Mounting empirical evidence indicates that neural “tuning” can be highly variable within an individual across time and especially across individuals. Furthermore, modulatory effects can change the relationship between neurons in the brain as a function of behavioral or other conditions, meaning that the changes in activity (the derivative) may be as important as the activity itself. However, current computational models fail to capture the nonstationarity and variability of neural coding, preventing the quantitative evaluation of these effects, especially during individuals’ adaptation to their environments. Here we present a novel way to study the effects of adaptation in one of the most well-studied organisms, C. elegans, leveraging recent advances in dynamical systems modeling, specifically decomposed Linear Dynamical Systems (dLDS).Our approach enables the discovery of multiple parallel neural processes on different timescales using a low-dimensional set of linear operators that can be recombined in different ratios. Our model identifies “dynamic connectivity,” describing patterns of dynamic neural interactions in time. We use these patterns to identify instantaneous, contextually-dependent, hierarchical roles of neurons; discover the underlying variability of neural representations even under seemingly discrete behaviors; and learn a single aligned latent space underlying multiple individual worms’ activity. By analyzing individual worms and neurons, we found evidence that 1) changes in interneuron connectivity mediate efficient task-switching and 2) changes in sensory neuron connectivity show a mechanism of adaptation.",
        "posted": "April 21, 2025"
    },
    {
        "title": "StACKER, A TOOL FOR SYSTEMS LEVEL ANALYSIS OF BASE STACKING IN NUCLEOTIDE-RICH STRUCTURES",
        "authors": "Eric D. Sakkas, Daniel Krizanc, Kelly M. Thayer, Michael P. Weir",
        "doi": "https://doi.org/10.1101/2025.04.13.648419",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.04.13.648419v1.full.pdf",
        "abstract": "Nucleic acid macromolecules can undergo significant structural changes—often mediated by nucleotide modification or molecular interactions. These alterations can be critical to their function. An ongoing challenge is to develop useful tools to quantify system-wide changes in nucleic acid-rich structures. We introduce StACKER, a robust Python package for observing conformational changes in a nucleic acid structure through its pi-stacking of base rings. StACKER creates System Stacking Fingerprints (SSFs) which highlight the landscape of pi-stacking throughout a molecule and can be used to show widespread conformational adjustments. Additionally, StACKER’s Pairwise Stacking Fingerprint (PSF) can further characterize pi-stacking in a select residue pair, showing how the effects of localized residue changes spread through a nucleic acid system. We apply StACKER to molecular dynamics (MD) simulations of a subsystem of the ribosome to reveal that alternative codons at the ribosome A-site and 3’ adjacent +1 codon position induce allosteric structure changes in the decoding center neighborhood, leading to a toggle between two conformational states. Through previous analysis of ribosome profiling data, we link these states to an observed fast/slow translation phenotype (Sun et al. 2024). We benchmark StACKER alongside other lenses for observing allostery to demonstrate its use in assessing allosteric shifts and its relevance to future structure-to-function studies.",
        "posted": "April 18, 2025"
    },
    {
        "title": "Characterization and orthogonality assessment of two quorum sensing systems for synthetic biology applications",
        "authors": "De Baets Jasmine, De Paepe Brecht, De Mey Marjan",
        "doi": "https://doi.org/10.1101/2025.04.03.643276",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.04.03.643276v1.full.pdf",
        "abstract": "Quorum sensing systems have a broad range of applications within the field of synthetic biology. However, a bottleneck is the optimization and tuning of these systems due to the lack of standardization and complete characterization. In this research, two quorum sensing systems, namely the LasI/LasR and the EsaI/EsaR system, were fully characterized in the model host organism Escherichia coli. Furthermore, insight was gained in the interplay between the various parts of these systems. To further expand the range of possibilities with these quorum sensing systems, the orthogonality of the two systems was assessed to allow simultaneous use within the same cell without interfering crosstalk. This assessment was performed on three levels: promoter, signal and synthase crosstalk. It was demonstrated that LasR is able to interact with the promoter of the EsaI/EsaR system, albeit to a low extent. Additionally, LasR was able to respond to the autoinducers produced by EsaI. To solve the promoter crosstalk, a nucleotide change was introduced into the binding site of EsaR within the promoter region. Additionally, LasR mutants were created rationally and screened for decreased response to EsaI while retaining functionality. The best performing mutant, LasR(P117S), was further characterized. In conclusion, we have further unlocked the potential of quorum sensing systems for synthetic biology applications by obtaining two functional, characterized and orthogonal quorum sensing systems. – Characterization of two LuxR-type quorum sensing systems – Assessing the orthogonality of the EsaI/EsaR and LasI/LasR quorum sensing system – Eliminating the crosstalk between the EsaI/EsaR and LasI/LasR quorum sensing system",
        "posted": "April 03, 2025"
    },
    {
        "title": "Systems biology analysis of vasodynamics in mouse cerebral arterioles during resting state and functional hyperemia",
        "authors": "Hadi Esfandi, Mahshad Javidan, Eric R. McGregor, Rozalyn M. Anderson, Ramin Pashaie",
        "doi": "https://doi.org/10.1101/2025.05.06.652356",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.05.06.652356v1.full.pdf",
        "abstract": "Cerebral hemodynamics is tightly regulated by arteriolar vasodynamics. In this study, a systems biology approach was employed to investigate how the interplay between passive, myogenic, neurogenic, and astrocytic responses shapes arteriolar vasodynamics in small rodents. A model of neurovascular coupling is proposed in which neurons inhibit and dampen the myogenic response to promote vasodilation during activation, and facilitate the myogenic response to promote rapid vasoconstriction immediately post-activation. In this model, inhibition of the myogenic response is mediated by the hyperpolarization of smooth muscle and endothelial cells. Dampening and facilitation of the response are mediated by neuronal production of nitric oxide and release of neuropeptide Y, respectively. We also introduce a model for gliovascular coupling, in which astrocytes periodically inhibit the myogenic response upon detecting an increase in myogenic activity through interactions between their endfeet and arterioles. Our study revealed that in the resting state, the interplay between the delayed myogenic response and passive distension, acting as negative and positive feedbacks respectively, generates undamped oscillations in vessel diameter, known as vasomotion. In the active state, these oscillations are disrupted by the neurogenic and astrocytic responses. The biophysical model of arteriolar vasodynamics presented in this study lays the foundation for quantitative analysis of cerebral hemodynamics for cerebrovascular health diagnostics and hemodynamic neuroimaging. Author summary Cerebral hemodynamic imaging is widely used to investigate brain function in-vivo. These signals are primarily shaped by arteriolar vasodynamics, which result from a combination of physiological processes mediated by multiple interacting cell types. A biophysical model of this dynamics offers a valuable computational framework for achieving more accurate and quantitative interpretation of hemodynamic signals. In this study, I applied a computational biology approach to incorporate several well-established cellular signaling pathways into a unified model, which was used to investigate system-level arteriolar behavior and identify missing or less understood mechanisms involved in cerebral blood flow regulation. Our results show that arteriolar vasodynamics is not solely driven by neurogenic responses; astrocytic response and hemo-vascular interactions also play important roles in shaping the observed dynamics. The model also provided a means to explore how in-silico analysis of hemodynamic signals can reveal potential cellular-level impairments that manifest as system-level changes in cerebral hemodynamics. Incorporating our proposed biophysical model into cerebral hemodynamic analysis can improve the fidelity of hemodynamic imaging—enabling more accurate inference of regional neuronal and astrocytic activity from hemodynamic signals, and enhancing our ability to diagnose cerebrovascular pathologies.",
        "posted": "May 10, 2025"
    },
    {
        "title": "PyCycleBio: modelling non-sinusoidal-oscillator systems in temporal biology",
        "authors": "Alexander R. Bennett, George Birchenough, Daniel Bojar",
        "doi": "https://doi.org/10.1101/2025.04.30.651403",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.04.30.651403v1.full.pdf",
        "abstract": "Protein, mRNA, and metabolite abundances can exhibit rhythmic dynamics, such as during the day/night cycle. Leading bioinformatics platforms for identifying biological rhythms often utilise single-component models of the harmonic oscillator equation, or multi-component models based upon the Cosinor framework. These approaches offer distinct advantages: modelling either temporally-resolved regulatory behaviour via the extended harmonic oscillator equation, or complex rhythmic patterns in the case of Cosinor. Here, we have developed a new platform to combine the advantages of these two approaches. PyCycleBio utilises bounded-multi-component models and modulus operators alongside the harmonic oscillator equation, to model a diverse and interpretable array of rhythmic behaviours, including the regulation of temporal dynamics via amplitude coefficients. We demonstrate increased sensitivity and functionality of PyCycleBio compared to other analytical frameworks, and uncover new relationships between data modalities or sampling conditions with the qualities of rhythmic behaviours from biological datasets— including transcriptomics, proteomics, and metabolomics. We envision that this new approach for disentangling complicated temporal regulation of biomolecules will advance chronobiology and our understanding of physiology. PyCycleBio is available at: https://github.com/Glycocalex/PyCycleBio, and the Python package is available to install at: https://pypi.org/project/pycyclebio/. PyCycleBio can also be used at https://colab.research.google.com/github/Glycocalex/PyCycleBio/blob/main/PyCycleBio.ipynb with no installations necessary.",
        "posted": "May 05, 2025"
    },
    {
        "title": "A systems-level machine learning approach uncovers therapeutic targets in clear cell renal cell carcinoma",
        "authors": "Silas Ruhrberg Estévez, Greta Baltusyte, Gehad Youssef, Namshik Han",
        "doi": "https://doi.org/10.1101/2025.05.26.656158",
        "pdf_link": "https://www.biorxiv.org/content/10.1101/2025.05.26.656158v1.full.pdf",
        "abstract": "We present a generalisable, interpretable machine learning framework for therapeutic target discovery using single-cell transcriptomics, protein interaction networks, and drug proximity analysis. The pipeline integrates feature selection via gradient boosting classifiers, systems-level network inference, and in silico drug repurposing, enabling the identification of actionable targets with cellular specificity. As a proof of concept, we apply the method to clear cell renal cell carcinoma (ccRCC), an aggressive kidney cancer with limited treatment options. The model identifies 96 tumour-intrinsic genes, refines them to 16 targets through CRISPR screens and biological curation, and prioritises FDA-approved compounds via network-based proximity scoring. Several novel therapeutic mechanisms - including ABL1, CDK4/6, and JAK inhibition - emerge from this analysis, with predicted compounds showing superior efficacy to standard-of-care drugs across multiple ccRCC cell lines. Beyond ccRCC, this framework offers a scalable strategy for drug discovery across diverse diseases, combining machine learning interpretability with systems biology to accelerate therapeutic development.",
        "posted": "May 29, 2025"
    }
]